#Область ПрограммныйИнтерфейс

Процедура СоздатьИСтартоватьПроцессСогласования(ЗаявкаНаСогласование) Экспорт
	
	ЕстьУжеПроцессПоЗаявке = ЕстьПроцесс(ЗаявкаНаСогласование);
	
	Если НЕ ЕстьУжеПроцессПоЗаявке Тогда
		
		БПОбъект = БизнесПроцессы.СогласованиеУсловийВознаграждения.СоздатьБизнесПроцесс();
		БПОбъект.УстановитьНовыйНомер();
		БПОбъект.Дата = ТекущаяДатаСеанса();
		БПОбъект.Заполнить(ЗаявкаНаСогласование);
		БПОбъект.Записать();
		БПОбъект.Старт(); 
		
	Иначе 
		
		БПОбъект = БПСогласования(ЗаявкаНаСогласование);
		
	КонецЕсли;
	
	ВыполнитьВсеЗадачиТекущегоПроцесса(БПОбъект.Ссылка);
	
КонецПроцедуры	

Функция ЕстьПроцесс(ЗаявкаНаСогласование) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласованиеУсловийВознаграждения.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.СогласованиеУсловийВознаграждения КАК СогласованиеУсловийВознаграждения
		|ГДЕ
		|	СогласованиеУсловийВознаграждения.Основание = &Основание
		|	И СогласованиеУсловийВознаграждения.Стартован
		|	И НЕ СогласованиеУсловийВознаграждения.Завершен";
	
	Запрос.УстановитьПараметр("Основание", ЗаявкаНаСогласование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция БПСогласования(ЗаявкаНаСогласование) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласованиеУсловийВознаграждения.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.СогласованиеУсловийВознаграждения КАК СогласованиеУсловийВознаграждения
		|ГДЕ
		|	СогласованиеУсловийВознаграждения.Основание = &Основание
		|	И СогласованиеУсловийВознаграждения.Стартован
		|	И НЕ СогласованиеУсловийВознаграждения.Завершен";
	
	Запрос.УстановитьПараметр("Основание", ЗаявкаНаСогласование);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	

Процедура ВыполнитьВсеЗадачиТекущегоПроцесса(СсылкаНаПроцесс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &БизнесПроцесс
		|	И НЕ ЗадачаИсполнителя.Выполнена";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", СсылкаНаПроцесс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗадачаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЗадачаОбъект.ВыполнитьЗадачу();
	КонецЦикла;
	
КонецПроцедуры

Функция КаналПродажАгента(Агент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_АгентскиеДоговоры.КаналПродаж КАК КаналПродаж
		|ИЗ
		|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
		|ГДЕ
		|	AMS_АгентскиеДоговоры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Агент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.КаналПродаж;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции	

#КонецОбласти


