#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьИмяПеременной(Префикс = "Var") Экспорт
	
	СвободныйНомер = 1;
	ОбъектНумерации = Перечисления.AMS_ОбъектыНумерации.КлючиУсловий;
	
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить();
	Элемент.Область = "РегистрСведений.AMS_НумераторПеременных";
	Элемент.Режим   = РежимБлокировкиДанных.Исключительный;
	Элемент.УстановитьЗначение("Префикс", Префикс);
	Элемент.УстановитьЗначение("ТипОбъекта", ОбъектНумерации);
	Блокировка.Заблокировать();
	
	НачатьТранзакцию();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	AMS_НумераторПеременных.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.AMS_НумераторПеременных КАК AMS_НумераторПеременных
		|ГДЕ
		|	AMS_НумераторПеременных.ТипОбъекта = &ТипОбъекта
		|	И AMS_НумераторПеременных.Префикс = &Префикс
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
	
	Запрос.УстановитьПараметр("ТипОбъекта", ОбъектНумерации);
	Запрос.УстановитьПараметр("Префикс", Префикс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		СвободныйНомер = ВыборкаДетальныеЗаписи.Номер + 1;	
		
	КонецЕсли;	
	
	ИмяПеременной = Префикс + Формат(СвободныйНомер, "ЧГ=0");
	РегистрыСведений.AMS_НумераторПеременных.ДобавитьИмяПеременной(ОбъектНумерации,
											Префикс, СвободныйНомер, ИмяПеременной);
	ЗафиксироватьТранзакцию();
	
	Возврат ИмяПеременной; 
	
КонецФункции

Функция СоздатьКлючУсловий(ПараметрыУсловий) Экспорт

	Если ПараметрыУсловий.Количество() = 0 Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	ЭтоПростоеУсловие = НЕ ЗначениеЗаполнено(ПараметрыУсловий[0].КлючСвязиСложногоУсловия);
	
	Если ЭтоПростоеУсловие Тогда
		
		КлючУсловий = СоздатьКлючПростогоУсловия(ПараметрыУсловий);
		
	Иначе
		
		КлючУсловий = СоздатьКлючСложногоУсловия(ПараметрыУсловий);
		
	КонецЕсли;	

	Возврат КлючУсловий.КонтрольноеЧисло;
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Функция СоздатьКлючПростогоУсловия(ПараметрыУсловий)
	
	ДанныеДляРасчета = Новый Массив;
	Для каждого Условие Из ПараметрыУсловий Цикл
	
		СтруктураУсловий = AMS_КлючиУсловийСервер.СтруктураПростыхУсловий(Истина);
		ЗаполнитьЗначенияСвойств(СтруктураУсловий, Условие);
	    ДанныеДляРасчета.Добавить(СтруктураУсловий);
		
	КонецЦикла;
	
	КонтрольноеЧисло = AMS_КлючиУсловийСервер.КонтрольноеЧислоКлюча(ДанныеДляРасчета);
	
	ТекущийКлюч = Справочники.AMS_КлючиУсловий.НайтиПоРеквизиту("КонтрольноеЧисло", КонтрольноеЧисло);
	
	Если ЗначениеЗаполнено(ТекущийКлюч) Тогда
		
		Возврат ТекущийКлюч;
		
	КонецЕсли;
	
	Ключ = Справочники.AMS_КлючиУсловий.СоздатьЭлемент();
	Ключ.КонтрольноеЧисло = КонтрольноеЧисло;
	
	Для каждого Условие Из ДанныеДляРасчета Цикл
	
		СтрокаКлюча = Ключ.НаборУсловий.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКлюча, Условие);
	    СтрокаКлюча.ЗначениеПроизвольногоТипа = Новый ХранилищеЗначения(Условие.ЗначениеПроизвольногоТипа);
		
	КонецЦикла;
	
	Ключ.Записать();
	Возврат Ключ.Ссылка;
	
КонецФункции	

Функция СоздатьКлючСложногоУсловия(ПараметрыУсловий)

	ТаблицаУсловий = Новый ТаблицаЗначений;
	ТаблицаУсловий.Колонки.Добавить("Параметр");
	ТаблицаУсловий.Колонки.Добавить("ОператорСравнения");
	ТаблицаУсловий.Колонки.Добавить("Значение");
	ТаблицаУсловий.Колонки.Добавить("КлючСвязи");
	ТаблицаУсловий.Колонки.Добавить("КлючСвязиСложногоУсловия");
	ТаблицаУсловий.Колонки.Добавить("ОсновноеУсловие");
	
	МассивКлючей = Новый Массив;
	
	Для каждого Условие Из ПараметрыУсловий Цикл
	
		СтрокаТаблицы = ТаблицаУсловий.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Условие);
	
	КонецЦикла;
	
	Идентификаторы = ТаблицаУсловий.Скопировать(, "КлючСвязиСложногоУсловия");
	Идентификаторы.Свернуть("КлючСвязиСложногоУсловия");
	
	Для каждого Идентификатор Из Идентификаторы Цикл
	
		Отбор = Новый Структура("КлючСвязиСложногоУсловия", Идентификатор.КлючСвязиСложногоУсловия);
		
		СтрокиУсловий = ТаблицаУсловий.НайтиСтроки(Отбор);
		
		Параметры = Новый Массив;
		ЭтоОсновнойКлюч = Ложь;
		
		Для каждого СтрокаУсловий Из СтрокиУсловий Цикл
			
			ЭтоОсновнойКлюч = СтрокаУсловий.ОсновноеУсловие;
			
			СтруктураУсловий = AMS_КлючиУсловийСервер.СтруктураПростыхУсловий();
	        ЗаполнитьЗначенияСвойств(СтруктураУсловий, СтрокаУсловий);
		    Параметры.Добавить(СтруктураУсловий);
			
		КонецЦикла;
		
		КлючУсловий = СоздатьКлючПростогоУсловия(Параметры);
		
		НаборКлючей = Новый Структура("КлючУсловий, ОсновнойКлюч");
		
		НаборКлючей.КлючУсловий  = КлючУсловий;
		НаборКлючей.ОсновнойКлюч = ЭтоОсновнойКлюч;
		МассивКлючей.Добавить(НаборКлючей);
		
	КонецЦикла;
	
	КонтрольноеЧисло = AMS_КлючиУсловийСервер.КонтрольноеЧислоКлюча(Новый Массив, МассивКлючей);
	
	ТекущийКлюч = Справочники.AMS_КлючиУсловий.НайтиПоРеквизиту("КонтрольноеЧисло", КонтрольноеЧисло);
	
	Если ЗначениеЗаполнено(ТекущийКлюч) Тогда
		
		Возврат ТекущийКлюч;
		
	КонецЕсли;
	
	Ключ = Справочники.AMS_КлючиУсловий.СоздатьЭлемент();
	Ключ.КонтрольноеЧисло = КонтрольноеЧисло;
	
	Для каждого Условие Из МассивКлючей Цикл
	
		СтрокаКлюча = Ключ.НаборКлючей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКлюча, Условие);
	
	КонецЦикла;
	
	Ключ.Записать();
	
	Возврат Ключ.Ссылка;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.Ссылка.КонтрольноеЧисло;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли