#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииИсточниковДанныхПечати
Процедура ПриОпределенииИсточниковДанныхПечати(Объект, ИсточникиДанныхПечати) Экспорт
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
				
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//  Параметры                  - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ОтзывСогласияНаОбработкуПерсональныхДанных.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
//  Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.AMS_ИзмененияДанныхПродавцов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


#Область ЗагрузкаДанныхИзЦССУ 

Процедура СоздатьДокументИзменениеДанныхПродавцов(ПараметрыЗаполнения, СписокПродавцов) Экспорт 
	
	Если ПараметрыЗаполнения.Свойство("ДопСоглашение") Тогда
		ДокументСсылка = Документы.AMS_ИзмененияДанныхПродавцов.НайтиПоРеквизиту("ГУИДЦССУ", ПараметрыЗаполнения.ДопСоглашение)
	Иначе	
		ДокументСсылка = Документы.AMS_ИзмененияДанныхПродавцов.НайтиПоРеквизиту("АгентскийДоговор", ПараметрыЗаполнения.АгентскийДоговор);
	КонецЕсли;

	Если ДокументСсылка.Пустая() Тогда
		ДокументОбъект = Документы.AMS_ИзмененияДанныхПродавцов.СоздатьДокумент();
	Иначе
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ДокументОбъект, ПараметрыЗаполнения);
	ДокументОбъект.Дата = ПараметрыЗаполнения.ДатаВступленияВСилу;
    ДокументОбъект.УстановитьНовыйНомер();
	ДокументОбъект.Продавцы.Очистить();

	Для Каждого Строка Из СписокПродавцов Цикл 

		НоваяСтрока = ДокументОбъект.Продавцы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);

		НоваяСтрока.Продавец = ЭлементСправочникаПоЦССУ("AMS_Продавцы", Строка.Продавец);
		НоваяСтрока.Куратор = ЭлементСправочникаПоЦССУ("AMS_Агенты", Строка.Куратор);
		НоваяСтрока.КаналПродаж = Справочники.AMS_КаналыПродаж.НайтиПоНаименованию(Строка.КаналПродаж, Истина);
		НоваяСтрока.ПодканалПродаж = Справочники.AMS_КаналыПродаж.НайтиПоНаименованию(Строка.ПодканалПродаж, Истина);
		НоваяСтрока.ФункциональнаяПринадлежность = ЭлементСправочникаПоЦССУ("AMS_ФункциональныеПринадлежности", Строка.ФункциональнаяПринадлежность);		
	КонецЦикла;	

	Попытка

		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника агентский договор, создание документы продавцы", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Документы.AMS_ИзмененияДанныхПродавцов,
		ДокументОбъект.Ссылка,
		"Документ создан"); 

	Исключение 
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника агентский договор, создание документы продавцы", 
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Документы.AMS_ИзмененияДанныхПродавцов,
		ДокументОбъект.Ссылка,
		ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#КонецЕсли