
#Область ОбработчикСобытий   

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.AMS_ИнформацияОПродавце.Записывать = Истина; 
	
	Для Каждого ТекСтрокаПродавцы Из Продавцы Цикл 
		
		Движение = Движения.AMS_ИнформацияОПродавце.Добавить(); 
		
		ДатаЗаписи = Дата;
		
		Если Не НачалоДня(Дата) = ДатаВступленияВСилу Тогда
			ДатаЗаписи = ДатаВступленияВСилу;
		КонецЕсли;
		
		Движение.Период = ДатаЗаписи;
		Движение.Продавец = ТекСтрокаПродавцы.Продавец;
		Движение.Агент = Агент;                                                        
		Движение.АгентскийДоговор = АгентскийДоговор;
		Движение.Уволен = ТекСтрокаПродавцы.Уволен;
		Движение.Куратор = ТекСтрокаПродавцы.Куратор;
		Движение.ВидТерритории = ТекСтрокаПродавцы.ВидТерритории;
		Движение.КаналПродаж = ТекСтрокаПродавцы.КаналПродаж;
		Движение.ПодканалПродаж = ТекСтрокаПродавцы.ПодканалПродаж;
		Движение.ФункциональнаяПринадлежность = ТекСтрокаПродавцы.ФункциональнаяПринадлежность;
		Движение.ВидОперации = ВидОперации;
		Движение.ВидыСтраховыхПродуктов = ТекСтрокаПродавцы.ВидыСтраховыхПродуктов;
		Движение.СтраховыеПродукты = ТекСтрокаПродавцы.СтраховыеПродукты;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ДанныеЗаполнения = Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		
		Если ДанныеЗаполнения.Свойство("Продавцы") Тогда
			Для Каждого Строка Из ДанныеЗаполнения.Продавцы Цикл
				НоваяСтрока = Продавцы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);				
			КонецЦикла;	
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ГУИД = "";
	
КонецПроцедуры

#КонецОбласти
