#Область ОбработчикСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьПутьДоФайлаОбменаАвтоматически()
КонецПроцедуры

&НаКлиенте
Процедура ПланОбменаПриИзменении(Элемент)
	ПолучитьПутьДоФайлаОбменаАвтоматически()
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	
	НачалоВыполненияКоманды = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	ОчиститьСообщения();
	
	ВыполнитьКомандуНаСервере();
	
	ВремяОкончания = ОбщегоНазначенияКлиент.ДатаСеанса();
 	СтруктураРазницыВремени = ПолучитьРазностьДатВремени(НачалоВыполненияКоманды, ВремяОкончания);
  
  	МассивПодстрок = Новый Массив;
  	МассивПодстрок.Добавить("ПолучениеКоманды");
 	МассивПодстрок.Добавить(СтрШаблон("НачалоВыполнения %1 /Окончание %2", НачалоВыполненияКоманды, ВремяОкончания ));
  	МассивПодстрок.Добавить(СтрШаблон("Потребовалось %1 %2 %3 %4" 
        , ?(СтруктураРазницыВремени.ОстатокДней > 0,СтрШаблон("Д. %1, ", СтруктураРазницыВремени.ОстатокДней), "") 
        , ?(СтруктураРазницыВремени.ОстатокЧасов > 0,СтрШаблон("Ч. %1, " + СтруктураРазницыВремени.ОстатокЧасов ), "") 
        , ?(СтруктураРазницыВремени.ОстатокМинут > 0,СтрШаблон("Мин %1, " + СтруктураРазницыВремени.ОстатокМинут ), "") 
        , "Сек " + СтруктураРазницыВремени.ОстатокСекунд));
  
  	ТекстСообщения = СтрСоединить(МассивПодстрок, Символы.ПС);
  
 	 ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
	//ОтобразитьСсылкуНаОбъект(); 
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере()

	Если ПроверкаНаВалидностьJSON() Тогда 
		
		СписокСообщений = Новый Массив(); 
		
		Сообщение = Новый Структура(); 
		
		Сообщение.Вставить("ВходящееСообщение", ДанныеJSON);
		
		СписокСообщений.Добавить(Сообщение);
		
		МодульОбъекта = РеквизитФормыВЗначение("Объект");
		
		МодульОбъекта.ВыгрузкаЗагрузкаДанных(Истина, ПланОбмена, ПутьДоФайлаОбмена, "", 1, "Обмен данными.ЦССУ.Получение данных", 
											0, ПланОбмена.Наименование, "Загрузка", Истина, СписокСообщений);
											
		//Элементы.СсылкаНаОбъект.Видимость = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлОбмена(Команда)
	
	ВыборФайлаОбмена = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайлаОбмена.Фильтр = "(*.xml, *.txt)|*.xml;*.txt";
	ВыборФайлаОбмена.Заголовок = "Выберите файл";
	ВыборФайлаОбмена.ПредварительныйПросмотр = Ложь;
	ВыборФайлаОбмена.ПроверятьСуществованиеФайла = Истина;
	Если ВыборФайлаОбмена.Выбрать() Тогда
		ПутьДоФайлаОбмена = ВыборФайлаОбмена.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлJSON(Команда)

	ВыборФайлаJSON = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайлаJSON.Фильтр = "(*.json, *.txt)|*.json;*.txt";
	ВыборФайлаJSON.Заголовок = "Выберите файл";
	ВыборФайлаJSON.ПредварительныйПросмотр = Ложь;
	ВыборФайлаJSON.ПроверятьСуществованиеФайла = Истина;
	Если ВыборФайлаJSON.Выбрать() Тогда
		ПутьДоФайлаJSON = ВыборФайлаJSON.ПолноеИмяФайла;
		ТекстФайла = Новый ТекстовыйДокумент;
		ТекстФайла.Прочитать(ПутьДоФайлаJSON);
		ДанныеJSON = ТекстФайла.ПолучитьТекст();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ДанныеJSON = "";
	ПутьДоФайлаJSON = "";
	Элементы.СсылкаНаОбъект.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

Функция ПроверкаНаВалидностьJSON()

	Результат = Истина;
	Попытка
		Данные = ПолучитьСтруктуруJSON(ДанныеJSON);
	Исключение
		Результат = Ложь;
		Сообщить("Не корректная структура JSON");
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ОтобразитьСсылкуНаОбъект();
	
	СсылкаНаОбъект = Неопределено;
	
	Попытка
		
		СтруктураJSON = ПолучитьСтруктуруJSON(ДанныеJSON); 
		
		ВходящийИдентификатор = Новый УникальныйИдентификатор(СтруктураJSON.GUID); 
		
		Если СтруктураJSON.ТипСправочника = "Контрагент" Тогда   
			
			СсылкаНаОбъект = Справочники.AMS_Агенты.ПолучитьСсылку(ВходящийИдентификатор);
			
		ИначеЕсли СтруктураJSON.ТипСправочника = "СтраховойПродукт" Тогда
			
			СсылкаНаОбъект = Справочники.AMS_СтраховыеПродукты.ПолучитьСсылку(ВходящийИдентификатор);
			
		ИначеЕсли СтруктураJSON.ТипСправочника = "ПравилоСтрахования" Тогда
			
			СсылкаНаОбъект = Справочники.AMS_ПравилаСтрахования.ПолучитьСсылку(ВходящийИдентификатор); 
			
		ИначеЕсли СтруктураJSON.ТипСправочника = "СтраховойРиск" Тогда   
			
			СсылкаНаОбъект = Справочники.AMS_СтраховыеРиски.ПолучитьСсылку(ВходящийИдентификатор);
			
		ИначеЕсли СтруктураJSON.ТипСправочника = "ВидСтрахования" Тогда  
			
			СсылкаНаОбъект = Справочники.AMS_ВидыСтрахования.ПолучитьСсылку(ВходящийИдентификатор);
			
		ИначеЕсли СтруктураJSON.ТипСправочника = "ПодканалПродаж" Тогда
			
			СсылкаНаОбъект = Справочники.AMS_КаналыПродаж.ПолучитьСсылку(ВходящийИдентификатор);
						
		ИначеЕсли СтруктураJSON.ТипСправочника = "ДоговорАгента" Тогда 
			
			СсылкаНаОбъект = Документы.AMS_ИзменениеУсловийАгентскогоДоговора.ПолучитьСсылку(ВходящийИдентификатор);
			
		ИначеЕсли СтруктураJSON.ТипСправочника = "Продавец" Тогда
			
			СсылкаНаОбъект = Справочники.AMS_Продавцы.ПолучитьСсылку(ВходящийИдентификатор); 
			
		ИначеЕсли СтруктураJSON.ТипСправочника = "РегиональнаяГруппа" Тогда
			
			СсылкаНаОбъект = Справочники.AMS_РегиональныеГруппы.ПолучитьСсылку(ВходящийИдентификатор);
			
		ИначеЕсли СтруктураJSON.ТипСправочника = "ФункциональнаяПринадлежность" Тогда
			
			СсылкаНаОбъект = Справочники.AMS_ФункциональныеПринадлежности.ПолучитьСсылку(ВходящийИдентификатор);
			
		Иначе  
			
			Сообщить("Неизвестный тип справочника (" + СтруктураJSON.ТипСправочника + ")")
			
		КонецЕсли;
		
	Исключение
		
	КонецПопытки;
	
	Если НЕ СсылкаНаОбъект = Неопределено Тогда 
		
		Сообщить("Данные JSON записаны");
		
	Иначе  
		
		Сообщить("Не удалось записать данные JSON");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруJSON(ТекстСообщения)

	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
	СтруктураJSON = ПрочитатьJSON(ЧтениеJSON, Ложь);
	
	Возврат СтруктураJSON;

КонецФункции

Процедура ПолучитьПутьДоФайлаОбменаАвтоматически()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТранспортаОбменаДанными.FILEКаталогОбменаИнформацией КАК FILEКаталогОбменаИнформацией
		|ИЗ
		|	РегистрСведений.НастройкиТранспортаОбменаДанными КАК НастройкиТранспортаОбменаДанными
		|ГДЕ
		|	НастройкиТранспортаОбменаДанными.Корреспондент = &Корреспондент";
	
	Запрос.УстановитьПараметр("Корреспондент", ПланОбмена);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПутьДоФайлаОбмена = ВыборкаДетальныеЗаписи.FILEКаталогОбменаИнформацией;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРазностьДатВремени(ДатаНачала, ДатаОкончания)
  
  СтруктураОтвета = Новый Структура("ВремяВыполненияВСекундах,ОстатокДней,ОстатокЧасов,ОстатокМинут,ОстатокСекунд");
  
  СтруктураОтвета.ВремяВыполненияВСекундах = ДатаОкончания - ДатаНачала;
  СтруктураОтвета.ОстатокСекунд = СтруктураОтвета.ВремяВыполненияВСекундах;
  СтруктураОтвета.ОстатокДней = Цел(СтруктураОтвета.ОстатокСекунд/(60*60*24));
  СтруктураОтвета.ОстатокСекунд = СтруктураОтвета.ОстатокСекунд - СтруктураОтвета.ОстатокДней*24*60*60;
  СтруктураОтвета.ОстатокЧасов = Цел((СтруктураОтвета.ОстатокСекунд)/(60*60));
  СтруктураОтвета.ОстатокСекунд = СтруктураОтвета.ОстатокСекунд - СтруктураОтвета.ОстатокЧасов*60*60;
  СтруктураОтвета.ОстатокМинут = Цел((СтруктураОтвета.ОстатокСекунд)/(60));
  СтруктураОтвета.ОстатокСекунд = СтруктураОтвета.ОстатокСекунд - СтруктураОтвета.ОстатокМинут*60;
  
  Возврат СтруктураОтвета;
  
КонецФункции

#КонецОбласти




















