#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(АдресПодписи) Тогда
		
		Если ЗначениеЗаполнено(Запись.Факсимиле) Тогда
			
			ФайлОбъект = Запись.Факсимиле.ПолучитьОбъект();
			
		Иначе
			
			ФайлОбъект = Справочники.ПрисоединенныеФайлыПодписантыОрганизаций.СоздатьЭлемент();
			
		КонецЕсли;	
			
		ФайлОбъект.ДанныеФайла = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресПодписи));
		ФайлОбъект.Записать();
		ТекущийОбъект.Факсимиле = ФайлОбъект.Ссылка;		
		
	КонецЕсли;	
	ТекущийОбъект.ДатаЗаписи = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Запись.Факсимиле) Тогда
		
		КартинкаПодписи = Запись.Факсимиле.ДанныеФайла.Получить();
		АдресПодписи = ПоместитьВоВременноеХранилище(КартинкаПодписи, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодписьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗагрузитьПодписть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьПодписть()

	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберете изображение подписи";
	
	ОповещениеОкончанияЗагрузки = Новый ОписаниеОповещения("ОповещениеОкончанияЗагрузки", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ОповещениеОкончанияЗагрузки,,,, ПараметрыДиалога, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОповещениеОкончанияЗагрузки(ОписаниеФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеФайла = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	АдресПодписи = ОписаниеФайла.Адрес;
	
КонецПроцедуры

#КонецОбласти
