#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДокументаУслуги(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПереченьУслугИКУСрезПоследних.ДоговорИКУ КАК ДоговорИКУ,
	|	ПереченьУслугИКУСрезПоследних.Услуга КАК Услуга,
	|	ПереченьУслугИКУСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПереченьУслугИКУСрезПоследних.СтоимостьОТ КАК СтоимостьОТ,
	|	ПереченьУслугИКУСрезПоследних.СтоимостьДО КАК СтоимостьДО,
	|	ПереченьУслугИКУСрезПоследних.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.ПереченьУслугИКУ.СрезПоследних(, ДоговорИКУ = &ДоговорИКУ) КАК ПереченьУслугИКУСрезПоследних";
	
	Запрос.УстановитьПараметр("ДоговорИКУ", Ссылка);
	
	ВыборкаУслуги = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаУслуги;

КонецФункции

Функция ДанныеДокументаВознаграждения(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияВознагражденияИКУСрезПоследних.ДоговорИКУ КАК ДоговорИКУ,
	|	УсловияВознагражденияИКУСрезПоследних.НаборЗначений КАК НаборЗначений,
	|	УсловияВознагражденияИКУСрезПоследних.КатегорияДоговора КАК КатегорияДоговора,
	|	УсловияВознагражденияИКУСрезПоследних.ТипСтрахователя КАК ТипСтрахователя,
	|	УсловияВознагражденияИКУСрезПоследних.Пролонгация КАК Пролонгация,
	|	УсловияВознагражденияИКУСрезПоследних.НовыйБизнес КАК НовыйБизнес,
	|	УсловияВознагражденияИКУСрезПоследних.РазмерВознагражденияПроцент КАК РазмерВознагражденияПроцент,
	|	УсловияВознагражденияИКУСрезПоследних.РазмерВознагражденияЗаЕдиницу КАК РазмерВознагражденияЗаЕдиницу,
	|	УсловияВознагражденияИКУСрезПоследних.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	УсловияВознагражденияИКУСрезПоследних.МаксимальныйЛимитПоДоговору КАК МаксимальныйЛимитПоДоговору
	|ИЗ
	|	РегистрСведений.УсловияВознагражденияИКУ.СрезПоследних(, ДоговорИКУ = &ДоговорИКУ) КАК УсловияВознагражденияИКУСрезПоследних";
	
	Запрос.УстановитьПараметр("ДоговорИКУ", Ссылка);
	
	ВыборкаВознагражение = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаВознагражение;

КонецФункции

Функция ДанныеДокумента(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияДоговораИКУСрезПоследних.АгентскийДоговор КАК АгентскийДоговор,
	|	УсловияДоговораИКУСрезПоследних.Агент КАК Агент,
	|	УсловияДоговораИКУСрезПоследних.Филиал КАК Филиал,
	|	УсловияДоговораИКУСрезПоследних.РегистрационныйНомер КАК РегистрационныйНомер,
	|	УсловияДоговораИКУСрезПоследних.ДатаПодписанияАгентом КАК ДатаПодписанияАгентом,
	|	УсловияДоговораИКУСрезПоследних.Статус КАК Статус,
	|	УсловияДоговораИКУСрезПоследних.Основание КАК Основание,
	|	УсловияДоговораИКУСрезПоследних.Подразделение КАК Подразделение,
	|	УсловияДоговораИКУСрезПоследних.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	УсловияДоговораИКУСрезПоследних.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	УсловияДоговораИКУСрезПоследних.НеТиповойДоговор КАК НеТиповойДоговор,
	|	УсловияДоговораИКУСрезПоследних.УдержаниеКомиссии КАК УдержаниеКомиссии,
	|	УсловияДоговораИКУСрезПоследних.ПериодичностьВыплатыКВ КАК ПериодичностьВыплатыКВ,
	|	УсловияДоговораИКУСрезПоследних.ДатаВыплаты КАК ДатаВыплаты,
	|	УсловияДоговораИКУСрезПоследних.ПодписантСоСтороныАгента КАК ПодписантСоСтороныАгента,
	|	УсловияДоговораИКУСрезПоследних.ДолжностьПодписантаАгента КАК ДолжностьПодписантаАгента,
	|	УсловияДоговораИКУСрезПоследних.ДокументПодписанта КАК ДокументПодписанта,
	|	УсловияДоговораИКУСрезПоследних.ДополнительноеСоглашение КАК ДополнительноеСоглашение,
	|	УсловияДоговораИКУСрезПоследних.ПричинаВнесенияИзменений КАК ПричинаВнесенияИзменений,
	|	УсловияДоговораИКУСрезПоследних.ДатаДосрочногоРасторжения КАК ДатаДосрочногоРасторжения,
	|	УсловияДоговораИКУСрезПоследних.ПричинаРасторжения КАК ПричинаРасторжения,
	|	УсловияДоговораИКУСрезПоследних.ТипЗначений КАК ТипЗначений,
	|	УсловияДоговораИКУСрезПоследних.ГУИД КАК ГУИД,
	|	УсловияДоговораИКУСрезПоследних.Комментарий КАК Комментарий,
	|	УсловияДоговораИКУСрезПоследних.Ответственный КАК Ответственный,
	|	УсловияДоговораИКУСрезПоследних.Бессрочно КАК Бессрочно,
	|	УсловияДоговораИКУСрезПоследних.ПодписантСоСтороныСК КАК ПодписантСоСтороныСК,
	|	УсловияДоговораИКУСрезПоследних.ДолжностьПодписантаКомпании КАК ДолжностьПодписантаКомпании,
	|	УсловияДоговораИКУСрезПоследних.ДокументПодписантаКомпании КАК ДокументПодписантаКомпании
	|ИЗ
	|	РегистрСведений.УсловияДоговораИКУ.СрезПоследних(, ДоговорИКУ = &ДоговорИКУ) КАК УсловияДоговораИКУСрезПоследних";
	
	Запрос.УстановитьПараметр("ДоговорИКУ", Ссылка);
	
	ВыборкаДокумент = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаДокумент;

КонецФункции

#КонецОбласти

#КонецЕсли