
#Область ОбработчикиСобытий  

Процедура ОбработкаПроведения(Отказ, Режим)
		
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(Агент) 
		И НЕ ЗначениеЗаполнено(Филиал)
		И НЕ ЗначениеЗаполнено(КаналПродаж) Тогда
		
		Отказ = Истина;
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидЗаявки) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Если РегистрыСведений.СостояниеЗаявокНаИзменениеАД.ТекущийСтатус(Ссылка) = ПредопределенноеЗначение("Справочник.СтатусыЗаявок.Новая")
		Тогда
		РегистрыСведений.СостояниеЗаявокНаИзменениеАД.УстановитьСтатус(Ссылка, 
							ПредопределенноеЗначение("Справочник.СтатусыЗаявок.Новая"));
	КонецЕсли;
						
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ПроцессыСогласованияЗаявкиСервер.ЗаполнитьСогласующихПоЗаявке(ЭтотОбъект);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
