#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ДобавитьИмяПеременной(ТипОбъекта, Префикс, Номер, Имя) Экспорт
	
	Менеджер = РегистрыСведений.AMS_НумераторПеременных.СоздатьМенеджерЗаписи();
	Менеджер.ТипОбъекта = ТипОбъекта;
	Менеджер.Префикс    = Префикс;
	Менеджер.Номер		= Номер;
	Менеджер.Имя		= Имя;
	Менеджер.Записать(Истина);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли