#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьСоответствие(Агент, Куратор) Экспорт
	
	Менеджер = РегистрыСведений.СоответствиеКураторовАгентам.СоздатьМенеджерЗаписи();
	Менеджер.Куратор = Куратор;
	Менеджер.Агент   = Агент;
	Менеджер.Записать(Истина);
	
КонецПроцедуры	

#Область ИнтеграцияСМАМС

Функция СформироватьСообщениеДляМАМС(Куратор, Агент) Экспорт
	
	 Результат = ПолучитьСтруктуруСообщения();
	 ЗаполнитьСтруктуруСообщенияМАМС(Куратор, Агент, Результат);	 	 
	 Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	 
	 Возврат Данные;
	 
 КонецФункции
 
#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПервоначальноеЗаполнение() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	AMS_ИнформацияОПродавцеСрезПоследних.Куратор КАК Куратор,
		|	AMS_ИнформацияОПродавцеСрезПоследних.Агент КАК Агент
		|ИЗ
		|	РегистрСведений.AMS_ИнформацияОПродавце.СрезПоследних(, ) КАК AMS_ИнформацияОПродавцеСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Куратор)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Агент) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			АгентОбъект = ВыборкаДетальныеЗаписи.Куратор.Получитьобъект();
			АгентОбъект.Куратор = Истина;
			АгентОбъект.ОбменДанными.Загрузка = Истина;
			АгентОбъект.Записать();
			
			Куратор = СоздатьКуратораПоАгенту(ВыборкаДетальныеЗаписи.Куратор);
			ЗаписатьСоответствие(ВыборкаДетальныеЗаписи.Агент, Куратор)
			
		Исключение;
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Запись Агента Куратора"
			, УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.СоответствиеКураторовАгентам, , ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры	

Функция СоздатьКуратораПоАгенту(Агент) Экспорт
	
	Куратор = Справочники.Кураторы.НайтиПоРеквизиту("ГУИД", Агент.ГУИД);
	
	Если ЗначениеЗаполнено(Куратор) Тогда
		
		Возврат Куратор;
		
	КонецЕсли;
	
	КураторОбъект = Справочники.Кураторы.СоздатьЭлемент();
	КураторОбъект.Заполнить(Агент);
	КураторОбъект.Записать();
	
	Возврат КураторОбъект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(Куратор, Агент, Результат)

	Результат.curatorGuid = Куратор.ГУИД;
	Результат.agentGuid   = Агент.ГУИД;
		
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "Curator");
	Результат.Вставить("curatorGuid");
	Результат.Вставить("agentGuid");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции
	
#КонецОбласти

#Область Инициализация

#КонецОбласти 

#КонецЕсли