
&НаСервере
Процедура ОбработатьСообщениеНаСервере()
	ИсходныеДанные = ПолучитьСтруктуруJSON(Запись.Сообщение);				                                   
		
		Попытка
			Документы
				.AMS_РеестрПоПремиальнымПрограммам
				.СформироватьИзменитьЭлементСправочника(ИсходныеДанные);
				
		Исключение
						
			Ошибка = ИнформацияОбОшибке();
			Сообщить(ПодробноеПредставлениеОшибки(Ошибка));
						
		КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруJSON(ТекстСообщения)
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
		
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);	
	
	Возврат ДанныеJSON;	
		
КонецФункции

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	ОбработатьСообщениеНаСервере();
КонецПроцедуры
