#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт
	
	 Результат = ПолучитьСтруктуруСообщения();
	 ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);	 	 
	 Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	 //Данные = СтрЗаменить(Данные, """""", "null");
	 
	 Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)

	ДанныеПоАгентам = ДанныеПоСсылке(ОбъектСсылка);	
	Для каждого ЗаписьДанных Из ДанныеПоАгентам Цикл
		
		Если НЕ ЗначениеЗаполнено(Результат.brokerGuid) Тогда
			ЗаполнитьЗначенияСвойств(Результат, ЗаписьДанных); 
		КонецЕсли;
		
		Результат.agents.Добавить(ЗаписьДанных.agentGuid);
		
	КонецЦикла;
		
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "Broker");
	Результат.Вставить("brokerGuid");
	Результат.Вставить("brokerName");
	Результат.Вставить("mainSellerGuid");
	Результат.Вставить("agents", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

Функция ДанныеПоСсылке(ОбъектСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_СоответствиеБрокеровАгентам.ПодчиненныйАгент.ГУИД КАК agentGuid,
		|	AMS_СоответствиеБрокеровАгентам.Брокер.ГУИД КАК brokerGuid,
		|	AMS_СоответствиеБрокеровАгентам.Брокер.Наименование КАК brokerName,
		|	AMS_СоответствиеБрокеровАгентам.Брокер.Продавец.ГУИД КАК mainSellerGuid
		|ИЗ
		|	РегистрСведений.AMS_СоответствиеБрокеровАгентам КАК AMS_СоответствиеБрокеровАгентам
		|ГДЕ
		|	AMS_СоответствиеБрокеровАгентам.Брокер = &Брокер
		|	И AMS_СоответствиеБрокеровАгентам.Брокер.ЭтоБрокер";
	
	Запрос.УстановитьПараметр("Брокер", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
		
КонецФункции	

#КонецОбласти

#КонецЕсли
