#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьРеестры() Экспорт
	
	ТекстЗапросаПоРеестрам = ПолучитьТекстЗапросаПоРеестрам();	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоРеестрам;
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивРеестровДляИзмененияСтатуса = Новый Массив;
	
	ВыборкаМП = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМП.Следующий() Цикл
		
		ВыборкаНачалаРеестра = ВыборкаМП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНачалаРеестра.Следующий() Цикл
			
			ВыборкаОкончаниеРеестра = ВыборкаНачалаРеестра.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОкончаниеРеестра.Следующий() Цикл
				
				Выборка = ВыборкаОкончаниеРеестра.Выбрать();
				
				ОбъектDTO = Справочники.AMS_РеестрыВознагражденийПоМотивационнымПрограммамДляПередачивЦССУ.СоздатьЭлемент();
				ОбъектDTO.МотивационнаяПрограмма = ВыборкаМП.МотивационнаяПрограмма;
				ОбъектDTO.НачалоПериода          = ВыборкаНачалаРеестра.НачалоПериода;
				ОбъектDTO.КонецПериода           = ВыборкаОкончаниеРеестра.ОкончаниеПериода;
				ОбъектDTO.ГУИД					 = Новый УникальныйИдентификатор;
				ОбъектDTO.Наименование = Строка(ОбъектDTO.МотивационнаяПрограмма) 
							+ " за период " 
							+ ОбъектDTO.НачалоПериода
							+ " по "
							+ ОбъектDTO.КонецПериода;
				Пока Выборка.Следующий() Цикл
					
					СтрокаРасшифровки = ОбъектDTO.ВознагражденияАгентов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, Выборка);
					
					Если МассивРеестровДляИзмененияСтатуса.Найти(Выборка.Реестр) = Неопределено Тогда
						МассивРеестровДляИзмененияСтатуса.Добавить(Выборка.Реестр);
					КонецЕсли;
					
				КонецЦикла;	   
				
				ОбъектDTO.Записать();
				
			КонецЦикла;
			
		КонецЦикла;	 
		
	КонецЦикла;	

	Для каждого Реестр Из МассивРеестровДляИзмененияСтатуса Цикл
	
		РеестрОбъект = Реестр.ПолучитьОбъект();
		РеестрОбъект.Статус = Перечисления.AMS_СтатусыРеестра.ГотовКОтправке;
		РеестрОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаПоРеестрам()
	 
	Результат = "ВЫБРАТЬ
		|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка КАК Реестр,
		|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка.НачалоПериода КАК НачалоПериода,
		|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка.ОкончаниеПериода КАК ОкончаниеПериода,
		|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка.Агент КАК Агент,
		|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.МотивационнаяПрограмма КАК МотивационнаяПрограмма,
		|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.СуммаВознаграждения КАК СуммаВознаграждения
		|ИЗ
		|	Документ.AMS_РеестрПоПремиальнымПрограммам.МотивационныеПрограммы КАК AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы
		|ГДЕ
		|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеестра.Согласован)
		|ИТОГИ ПО
		|	МотивационнаяПрограмма,
		|	НачалоПериода,
		|	ОкончаниеПериода";
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#КонецЕсли