#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт

	Идентификаторы = ИдентификаторыПредопределенныхДанных();
	ПолноеНаименование = ПолноеНаименованиеПредопределенных();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
	
		КаналПродажОбъект = КлючЗначение.Ключ.ПолучитьОбъект();
		КаналПродажОбъект.НаименованиеПолное = ПолноеНаименование.Получить(КлючЗначение.Ключ);
		КаналПродажОбъект.ГУИД = КлючЗначение.Значение;
		КаналПродажОбъект.ГУИДЦССУ = КлючЗначение.Значение;
		КаналПродажОбъект.ОбменДанными.Загрузка = Истина;
		КаналПродажОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт

	Результат = ПолучитьСтруктуруСообщения(); 
	
	ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);	 	 
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	//Данные = СтрЗаменить(Данные, """""", "null");
	 
	Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)
	
	Реквизиты = "ГУИД, Наименование, Родитель";
	ДанныеКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты);	
	
	Результат.guid					 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ГУИД);
	Результат.name 				 	 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Наименование);
	
	Если ЗначениеЗаполнено(ДанныеКП.Родитель) Тогда
		Результат.objectType = "SaleSubchannel";
		Результат.Вставить("saleChannelGuid", ПреобразоватьЗначениеДляJSON(ДанныеКП.Родитель.ГУИД));
	КонецЕсли;	

КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "SaleChannel");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедуры
// Первая версия модуля 28.08.2024
Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Если Не ИсходныеДанные.Свойство("GUID") Тогда
		
		Комментарий = "Для справочника не заполнен обязательный реквизит ГУИД";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Каналы продаж", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		
		Возврат;
		
	КонецЕсли;	
		
	ИсходныеДанные			  = СериализацияИсходныхДанных(ИсходныеДанные);
		
	СсылкаНаОбъект 			  = Справочники.AMS_КаналыПродаж.ПолучитьСсылку(ИсходныеДанные.УИД);
	
	КаналыПродажОбъект 	  = СсылкаНаОбъект.ПолучитьОбъект();
	
	Если КаналыПродажОбъект = Неопределено Тогда 
		
		КаналыПродажОбъект = Справочники.AMS_КаналыПродаж.СоздатьЭлемент();
		
		КаналыПродажОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(КаналыПродажОбъект, ИсходныеДанные);
	
	Попытка
		
		КаналыПродажОбъект.Записать();
		
		Комментарий = СтрШаблон("Успешно записан канал продаж с УИД %1", ИсходныеДанные.УИД);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Каналы продаж", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_КаналыПродаж, КаналыПродажОбъект.Ссылка, Комментарий);
			
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Каналы продаж", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_КаналыПродаж, КаналыПродажОбъект.Ссылка, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Функция СериализацияИсходныхДанных(Данные)
	
	Попытка
		
		СодержимоеСтруктуры = "УИД, Комментарий, Наименование, НаименованиеПолное, ПометкаУдаления, Родитель, ТипСправочника";
		
		Результат = Новый Структура(СодержимоеСтруктуры);
		
		Результат.УИД = Новый УникальныйИдентификатор(Данные.GUID);
		
		Результат.Комментарий		 = Данные.Комментарий;
		Результат.Наименование		 = Данные.Наименование;
		Результат.НаименованиеПолное = Данные.НаименованиеПолное;
		Результат.ПометкаУдаления	 = Булево(Данные.ПометкаУдаления);
		Результат.Родитель			 = Справочники.AMS_КаналыПродаж[Данные.Родитель];
		Результат.ТипСправочника	 = Данные.ТипСправочника;
		
	Исключение
		
		Результат = Неопределено;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Каналы продаж", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_КаналыПродаж,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнениеГУИДПредопределенныхЭлементов() Экспорт

	ВнешниеГУИДы = ПолучитьГУИДыПредопределенныхЭлементов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_КаналыПродаж.Ссылка КАК Ссылка,
		|	AMS_КаналыПродаж.Код КАК Код
		|ИЗ
		|	Справочник.AMS_КаналыПродаж КАК AMS_КаналыПродаж
		|ГДЕ
		|	AMS_КаналыПродаж.ГУИД = """"
		|	И AMS_КаналыПродаж.Предопределенный";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Код = Выборка.Код;
			Ссылка = Выборка.Ссылка;
			НовыйОбъект = Ссылка.ПолучитьОбъект();
			НовыйОбъект.ГУИД = ВнешниеГУИДы[Код];
			
			НовыйОбъект.Записать();
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьГУИДыПредопределенныхЭлементов()

	Результат = Новый Соответствие();
	
	Результат.Вставить("00001", "bd9a9957-e710-11df-b319-001517da95cc");
	Результат.Вставить("00002", "bd9a9958-e710-11df-b319-001517da95cc");
	Результат.Вставить("00003", "bd9a9959-e710-11df-b319-001517da95cc");
	Результат.Вставить("00004", "bd9a995a-e710-11df-b319-001517da95cc");
	Результат.Вставить("00006", "0f78dae3-70ab-413e-8156-554c45f7acd9");
	Результат.Вставить("00007", "6cc4e944-10eb-41bb-8bb9-03e4151183c9");
	Результат.Вставить("00008", "063e1a60-e631-4582-9211-4f541d44a9b3");
	Результат.Вставить("00009", "a307d714-8718-4452-a296-d523c0b820d8");
	Результат.Вставить("00010", "a1e1d750-86f3-4baa-9e95-3ffd69eb7831");
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанных()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_КаналыПродаж.АКП,			 "bd9a9958-e710-11df-b319-001517da95cc");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ДКП,			 "bd9a9957-e710-11df-b319-001517da95cc");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.Интернет,		 "0f78dae3-70ab-413e-8156-554c45f7acd9");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ККП,			 "bd9a995a-e710-11df-b319-001517da95cc");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ЛВС,			 "063e1a60-e631-4582-9211-4f541d44a9b3");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ОКП,			 "bd9a9959-e710-11df-b319-001517da95cc");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ПКП,			 "6cc4e944-10eb-41bb-8bb9-03e4151183c9");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.БАКП,			 "5bbc2054-19dd-4df5-bf54-5ae969a1f0a5");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.КАКП,			 "329e239d-40a1-465f-8e7d-5f01fff06580");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.БПКП,			 "71d29dde-4dd2-43e9-9f83-509fe5640530");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ИПКП,			 "5fdf6e2c-6725-4771-b201-812d5114f969");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ЛПКП,			 "3d921846-a70b-4436-8bcc-1251bbcaab7c");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.НПКП,			 "98db9312-40a1-43ee-8385-2c684c080cf0");
	
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ККПVIP,			 "86ac4dd3-8597-4919-a42a-5124a9b78f97");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ККПБрокеры,		 "82a57bb3-f69d-47a2-849e-7d6a58bbc15b");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.БКПКорп,		 "de758f5d-df43-4a89-9b64-ce31217aaf26");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ЛККП,			 "be4e19fb-f403-4cc8-85b6-bbeb8773578b");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ОнлайнB2C,		 "ec0d439c-8297-4f1f-8bf6-647df6e6e846");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ОнлайнB2B,		 "1411a07a-672b-44f7-8a2e-a83f95c0c50d");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.Маркетплейсы,	 "c5d15468-0166-4f19-af80-2408c754f830");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.Сайт,			 "bd18af2e-96a3-49fa-8db4-056813887a2e");
	
	
	Возврат Результат;
	
КонецФункции

Функция ПолноеНаименованиеПредопределенных()

	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_КаналыПродаж.АКП,			 "bd9a9958-e710-11df-b319-001517da95cc");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ДКП,			 "bd9a9957-e710-11df-b319-001517da95cc");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.Интернет,		 "0f78dae3-70ab-413e-8156-554c45f7acd9");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ККП,			 "bd9a995a-e710-11df-b319-001517da95cc");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ЛВС,			 "063e1a60-e631-4582-9211-4f541d44a9b3");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ОКП,			 "bd9a9959-e710-11df-b319-001517da95cc");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ПКП,			 "6cc4e944-10eb-41bb-8bb9-03e4151183c9");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.БАКП,			 "Брокерский");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.КАКП,			 "Классический");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.БПКП,			 "Банкострахование");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ИПКП,			 "Ипотечный");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ЛПКП,			 "Лизинговый ");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.НПКП,			 "Нефинансовые посредники");
	
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ККПVIP,			 "ВИП Корпоративный");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ККПБрокеры,		 "Брокерский корпоративный");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.БКПКорп,		 "Банковский корпоративный");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ЛККП,			 "Лизинговый корпоративный");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ОнлайнB2C,		 "Онлайн B2C");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.ОнлайнB2B,		 "Онлайн B2B");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.Маркетплейсы,	 "Маркетплейсы");
	Результат.Вставить(Справочники.AMS_КаналыПродаж.Сайт,			 "Сайт");
	
	Возврат Результат;	

КонецФункции

#КонецОбласти

#КонецЕсли