#Область ПрограммныйИнтерфейс

Процедура ЗаполниттьОбъект(СсылкаНаОбъет) Экспорт

	СоответствиеМенеджеров = СоответствиеМенеджеров();
	Менеджер = СоответствиеМенеджеров.Получить(ТипЗнч(СсылкаНаОбъет));
	
	Если Менеджер = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	МенеджерДанных = Обработки.ИнтеграцияСВитриной.Создать();
	МенеджерДанных.УстановитьстандартныеНастройки()
			.Подключиться()
			.Продавец(СсылкаНаОбъет.ГУИД);
			
	Если МенеджерДанных.Данные = Неопределено Тогда
				
		Возврат;
				
	КонецЕсли;	
	
	Данные = ОбщегоНазначения.ТаблицаЗначенийВМассив(МенеджерДанных.Данные);	
	Менеджер.СформироватьИзменитьЭлементСправочника(Данные);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоответствиеМенеджеров()

	Результат = Новый Соответствие;
	Результат.Вставить(Тип("СправочникСсылка.AMS_Продавцы"), Справочники.AMS_Продавцы);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти