#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДокументаИКУ();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Пакет = Запрос.ВыполнитьПакет();
	
	УсловияДокумента 		= Пакет[0].Выгрузить();
	УсловияВознаграждения 	= Пакет[1].Выгрузить();
	ПереченьУслуг 			= Пакет[2].Выгрузить();
	
	СтруктураТаблицДокумента = Новый Структура;
	СтруктураТаблицДокумента.Вставить("УсловияДоговораИКУ"			, УсловияДокумента);
	СтруктураТаблицДокумента.Вставить("УсловияВознагражденияИКУ"	, УсловияВознаграждения);
	СтруктураТаблицДокумента.Вставить("ПереченьУслугИКУ"			, ПереченьУслуг);
	
	ПараметрыПроведения.Вставить("СтруктураТаблицДокумента", СтруктураТаблицДокумента);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДокументаИКУ()
	
	Результат = 
		"ВЫБРАТЬ
		|	СозданиеИИзменениеУсловийДоговораИКУ.Дата КАК Период,
		|	СозданиеИИзменениеУсловийДоговораИКУ.АгентскийДоговор КАК АгентскийДоговор,
		|	СозданиеИИзменениеУсловийДоговораИКУ.Агент КАК Агент,
		|	СозданиеИИзменениеУсловийДоговораИКУ.Филиал КАК Филиал,
		|	СозданиеИИзменениеУсловийДоговораИКУ.РегистрационныйНомер КАК РегистрационныйНомер,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДатаПодписанияАгентом КАК ДатаПодписанияАгентом,
		|	СозданиеИИзменениеУсловийДоговораИКУ.Статус КАК Статус,
		|	СозданиеИИзменениеУсловийДоговораИКУ.Основание КАК Основание,
		|	СозданиеИИзменениеУсловийДоговораИКУ.Подразделение КАК Подразделение,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	СозданиеИИзменениеУсловийДоговораИКУ.НеТиповойДоговор КАК НеТиповойДоговор,
		|	СозданиеИИзменениеУсловийДоговораИКУ.УдержаниеКомиссии КАК УдержаниеКомиссии,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ПериодичностьВыплатыКВ КАК ПериодичностьВыплатыКВ,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДатаВыплаты КАК ДатаВыплаты,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ПодписантСоСтороныАгента КАК ПодписантСоСтороныАгента,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДолжностьПодписантаАгента КАК ДолжностьПодписантаАгента,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДокументПодписанта КАК ДокументПодписанта,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДополнительноеСоглашение КАК ДополнительноеСоглашение,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ПричинаВнесенияИзменений КАК ПричинаВнесенияИзменений,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДатаДосрочногоРасторжения КАК ДатаДосрочногоРасторжения,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ПричинаРасторжения КАК ПричинаРасторжения,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ТипЗначений КАК ТипЗначений,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ГУИД КАК ГУИД,
		|	СозданиеИИзменениеУсловийДоговораИКУ.Комментарий КАК Комментарий,
		|	СозданиеИИзменениеУсловийДоговораИКУ.Ответственный КАК Ответственный,
		|	СозданиеИИзменениеУсловийДоговораИКУ.Бессрочно КАК Бессрочно,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДоговорИКУ КАК ДоговорИКУ,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ПодписантСоСтороныСК КАК ПодписантСоСтороныСК,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДолжностьПодписантаКомпании КАК ДолжностьПодписантаКомпании,
		|	СозданиеИИзменениеУсловийДоговораИКУ.ДокументПодписантаКомпании КАК ДокументПодписантаКомпании
		|ИЗ
		|	Документ.СозданиеИИзменениеУсловийДоговораИКУ КАК СозданиеИИзменениеУсловийДоговораИКУ
		|ГДЕ
		|	СозданиеИИзменениеУсловийДоговораИКУ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.Ссылка КАК Ссылка,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.НаборЗначений КАК НаборЗначений,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.КатегорияДоговора КАК КатегорияДоговора,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.ТипСтрахователя КАК ТипСтрахователя,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.Пролонгация КАК Пролонгация,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.НовыйБизнес КАК НовыйБизнес,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.РазмерВознагражденияПроцент КАК РазмерВознагражденияПроцент,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.РазмерВознагражденияЗаЕдиницу КАК РазмерВознагражденияЗаЕдиницу,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.МаксимальныйЛимитПоДоговору КАК МаксимальныйЛимитПоДоговору,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.Ссылка.Дата КАК Период,
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.Ссылка.ДоговорИКУ КАК ДоговорИКУ
		|ИЗ
		|	Документ.СозданиеИИзменениеУсловийДоговораИКУ.УсловияВознаграждения КАК СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения
		|ГДЕ
		|	СозданиеИИзменениеУсловийДоговораИКУУсловияВознаграждения.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг.Ссылка КАК Ссылка,
		|	СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг.Услуга КАК Услуга,
		|	СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг.СтоимостьОТ КАК СтоимостьОТ,
		|	СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг.СтоимостьДО КАК СтоимостьДО,
		|	СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг.Ссылка.Дата КАК Период,
		|	СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг.Ссылка.ДоговорИКУ КАК ДоговорИКУ,
		|	СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг.Приоритет КАК Приоритет
		|ИЗ
		|	Документ.СозданиеИИзменениеУсловийДоговораИКУ.ПереченьУслуг КАК СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг
		|ГДЕ
		|	СозданиеИИзменениеУсловийДоговораИКУПереченьУслуг.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли