#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.УсловияДоговораИКУ.Записывать = Истина;
	Движения.УсловияВознагражденияИКУ.Записывать = Истина;
	Движения.ПереченьУслугИКУ.Записывать = Истина;
	
	AMS_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ПараметрыПроведедения = Документы.СозданиеИИзменениеУсловийДоговораИКУ.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	AMS_ПроведениеСервер.ПроведениеПоРегистрам(ЭтотОбъект, ПараметрыПроведедения);
	
	ЗаписатьСостояниеДоговора();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ДоговорИКУ = Справочники.ДоговорИКУ.ПустаяСсылка() Тогда 
		
		Если ЭтотОбъект.РегистрационныйНомер = "" Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить номер нового договора ИКУ или выбрать существующий",,,,Истина);
		Иначе 
			СправочникОбъект = Справочники.ДоговорИКУ.СоздатьЭлемент();
			СправочникОбъект.Наименование = СтрШаблон("Договор № %1", ЭтотОбъект.РегистрационныйНомер);
			СправочникОбъект.ГУИД = Новый УникальныйИдентификатор();
			СправочникОбъект.Записать();
			ДоговорИКУ = СправочникОбъект.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ГУИД = Новый УникальныйИдентификатор();
	ДоговорИКУ = Справочники.ДоговорИКУ.ПустаяСсылка();
	РегистрационныйНомер = "";
	
	Если УсловияВознаграждения.Количество() > 0 Тогда
		Для Каждого Вознаграждения Из УсловияВознаграждения Цикл
			Вознаграждения.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьСостояниеДоговора()
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СостояниеДоговораИКУ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорИКУ.Установить(ДоговорИКУ); 
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ДатаНачалаДействия;
		НоваяЗапись.ДоговорИКУ = ДоговорИКУ;
		НоваяЗапись.Действует = Истина;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ?(ЗначениеЗаполнено(ДатаДосрочногоРасторжения), ДатаДосрочногоРасторжения, ДатаОкончанияДействия);
		НоваяЗапись.ДоговорИКУ = ДоговорИКУ;
		НоваяЗапись.Действует = Ложь;
		
	Иначе
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Если Запись.Действует Тогда
				
				Запись.Период = ДатаНачалаДействия
				
			Иначе
				
				Запись.Период = ?(ЗначениеЗаполнено(ДатаДосрочногоРасторжения), ДатаДосрочногоРасторжения, ДатаОкончанияДействия);
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры
 
#КонецОбласти



