#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВызова) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УведомлениеОбИзмененииКВ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
										"УведомлениеОбИзмененииКВ",
										"Уведомление об изменении КВ",
										ПечатьУведомленияОбИзмененииКВ(МассивОбъектов, ОбъектыПечати),
										,
										"Обработка.ПечатьАгентскийДоговор.ПФ_MXL_УведомлениеОбИзмененииКВ");
		
	КонецЕсли;	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДополнительноеСоглашение") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
										"ДополнительноеСоглашение",
										"Дополнительное соглашение",
										ПечатьДополнительноеСоглашение(МассивОбъектов, ОбъектыПечати),
										,
										"Обработка.ПечатьАгентскийДоговор.ПФ_MXL_ДополнительноеСоглашение");
		
	КонецЕсли;
									
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьУведомленияОбИзмененииКВ(МассивОбъектов, ОбъектыПечати)
	
КонецФункции	

Функция ПечатьДополнительноеСоглашение(МассивОбъектов, ОбъектыПечати)
	
КонецФункции

#КонецОбласти

#КонецЕсли