#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСекрет(Интеграция) Экспорт
	
	СредаЗапуска  = AMS_Администрирование.ПолучитьСредуЗапускаИБ();
	НастройкаВолт = ПолучитьНастройкуВолт(СредаЗапуска, Интеграция);
	
	Соединение = Новый HTTPСоединение(НастройкаВолт.АдресСервера,,,,,10, Новый ЗащищенноеСоединениеOpenSSL);
	
	ТокенСессии 	= ПолучитьТокенСессии(НастройкаВолт, Соединение);	
	ЗначениеСикрета = ПолучитьЗначениеСикрета(НастройкаВолт, ТокенСессии, Соединение);
	
	Возврат ЗначениеСикрета;

КонецФункции

// <Описание процедуры>
//
// Параметры:
//  Нет
//
Процедура ОчиститьДанныеПродуктовойСреды() Экспорт
	
	Если ПараметрыСеанса.AMS_СредаЗапуска = Перечисления.AMS_СредыЗапуска.Прод Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	СредаПрод = Перечисления.AMS_СредыЗапуска.Прод;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	AMS_НастройкиVaultПараметрыПоСредамИсполнения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AMS_НастройкиVault.ПараметрыПоСредамИсполнения КАК AMS_НастройкиVaultПараметрыПоСредамИсполнения
		|ГДЕ
		|	AMS_НастройкиVaultПараметрыПоСредамИсполнения.СредаИсполнения = &СредаИсполнения";
	
	Запрос.УстановитьПараметр("СредаИсполнения", СредаПрод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НастройкаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Отбор = Новый Структура("СредаИсполнения", СредаПрод);
		
		СтрокиДляУдаления = НастройкаОбъект.ПараметрыПоСредамИсполнения.НайтиСтроки(Отбор);
		
		Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
		
			НастройкаОбъект.ПараметрыПоСредамИсполнения.Удалить(СтрокаДляУдаления);
		
		КонецЦикла;	
		
		НастройкаОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеВJSON(Значение)
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Значение);
	
	Результат = Запись.Закрыть();	
	Возврат Результат;
	
КонецФункции	

Функция JSONВЗначение(СтрокаJSON)

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Результат = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьНастройкуВолт(СредаЗапуска, Интеграция)
	
	Результат = ИнициализироватьНастройку();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	AMS_НастройкиVault.АдресСервера КАК АдресСервера,
	               |	AMS_НастройкиVault.RoleID КАК ИмяРоли,
	               |	AMS_НастройкиVault.SecretID КАК ТокенДоступа,
	               |	AMS_НастройкиVaultПараметрыПоСредамИсполнения.Адрес КАК Адрес,
	               |	AMS_НастройкиVaultПараметрыПоСредамИсполнения.Путь КАК Путь,
	               |	AMS_НастройкиVaultПараметрыПоСредамИсполнения.Логин КАК Логин,
	               |	AMS_НастройкиVaultПараметрыПоСредамИсполнения.Пароль КАК Пароль
	               |ИЗ
	               |	Справочник.AMS_НастройкиVault КАК AMS_НастройкиVault
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_НастройкиVault.ПараметрыПоСредамИсполнения КАК AMS_НастройкиVaultПараметрыПоСредамИсполнения
	               |		ПО (AMS_НастройкиVaultПараметрыПоСредамИсполнения.Ссылка = AMS_НастройкиVault.Ссылка)
	               |ГДЕ
	               |	AMS_НастройкиVaultПараметрыПоСредамИсполнения.СредаИсполнения = &СредаИсполнения
	               |	И AMS_НастройкиVault.Интеграция = &Интеграция
	               |	И НЕ AMS_НастройкиVault.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Интеграция", Интеграция);
	Запрос.УстановитьПараметр("СредаИсполнения", СредаЗапуска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ВызватьИсключение ("Отсутствуют настроки авторизации для текущей среды", 
							КатегорияОшибки.ОшибкаСеанса);
		
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции	

Функция ИнициализироватьНастройку()

	Результат = Новый Структура;
	Результат.Вставить("АдресСервера");
	Результат.Вставить("ИмяРоли");
	Результат.Вставить("ТокенДоступа");
	Результат.Вставить("Логин");
	Результат.Вставить("Путь");
	Результат.Вставить("Адрес");
	Результат.Вставить("Пароль");
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьТокенСессии(НастройкаВолт, Соединение)
	
	АдресРесурса = "/v1/auth/approle/login";
	ДанныеЗапроса = Новый Структура;
	
	ДанныеЗапроса.Вставить("secret_id", НастройкаВолт.ТокенДоступа);
	ДанныеЗапроса.Вставить("role_id", НастройкаВолт.ИмяРоли);
	
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	Запрос.УстановитьТелоИзСтроки(ЗначениеВJSON(ДанныеЗапроса));
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если (Ответ.КодСостояния < 200) ИЛИ (Ответ.КодСостояния >= 300) Тогда
		ВызватьИсключение СтрШаблон("Ошибка авторизации в Vault : %1
									|%2'"
									,Строка(Ответ.КодСостояния)
									,Ответ.ПолучитьТелоКакСтроку()); 
	КонецЕсли;
	
	Ответ = JSONВЗначение(Ответ.ПолучитьТелоКакСтроку());	
	ТокенСессии = Ответ.auth.client_token;
	
	Возврат ТокенСессии;
	
КонецФункции	

Функция ПолучитьЗначениеСикрета(НастройкаВолт, ТокенСессии, Соединение)

	ПутьЗапроса   = "/v1/" + НастройкаВолт.Путь;
	
	ЗапросСекрета = Новый HTTPЗапрос(ПутьЗапроса);
	ЗапросСекрета.Заголовки.Вставить("X-Vault-Token", ТокенСессии);
	
	Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросСекрета);
	
	Если (Ответ.КодСостояния < 200) ИЛИ (Ответ.КодСостояния >= 300) Тогда
		ВызватьИсключение СтрШаблон("Ошибка запроса секрета в Vault : код состояния %1; ; Vault путь: %3
									|%2'"
									,Строка(Ответ.КодСостояния)
									,Ответ.ПолучитьТелоКакСтроку()
									,НастройкаВолт.Путь);
	КонецЕсли;
								
	Ответ = JSONВЗначение(Ответ.ПолучитьТелоКакСтроку());

	Результат = НовыйОписаниеОтвета();
	
	ЗаполнитьОтвет(Ответ.data.data, Результат, НастройкаВолт);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйОписаниеОтвета()

	Результат = Новый Структура;
	Результат.Вставить("Адрес");
	Результат.Вставить("Логин");
	Результат.Вставить("Пароль");
	
	Возврат Результат;

КонецФункции

Процедура ЗаполнитьОтвет(ДанныеВолт, ДанныеОтвета, НастройкаВолт)
	
	ДанныеВолт.Свойство(НастройкаВолт.Адрес, ДанныеОтвета.Адрес);
	ДанныеВолт.Свойство(НастройкаВолт.Логин, ДанныеОтвета.Логин);
	ДанныеВолт.Свойство(НастройкаВолт.Пароль, ДанныеОтвета.Пароль);
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли