#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс  

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииИсточниковДанныхПечати
Процедура ПриОпределенииИсточниковДанныхПечати(Объект, ИсточникиДанныхПечати) Экспорт
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
				
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//  Параметры                  - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ОтзывСогласияНаОбработкуПерсональныхДанных.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
//  Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.AMS_ИзмененияДанныхПродавцов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#Область ПроведениеДокумента

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТаблицыДокумента();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ = Запрос.Выполнить().Выгрузить();	
	
	СтруктураТаблицДокумента = Новый Структура;
	СтруктураТаблицДокумента.Вставить("AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ", AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ);
	
	ПараметрыПроведения.Вставить("СтруктураТаблицДокумента", СтруктураТаблицДокумента);
	
	Возврат ПараметрыПроведения;
	
КонецФункции	

Функция ТекстЗапросаТаблицыДокумента()
	
	Результат = 
	"ВЫБРАТЬ
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.СтраховойПродукт КАК СтраховойПродукт,
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.Ссылка КАК Ссылка,
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.Процент КАК Процент,
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.Отменен КАК Отменен,
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеПоказатели.КлючУсловий КАК КлючУсловий,
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.КлючСвязи КАК ГУИД,
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.СтраховойРиск КАК СтраховойРиск,
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.ДатаНачалаДействия КАК ДатаНачалаДействия
	|ПОМЕСТИТЬ ВТ_ДанныеПоСтраховымПродуктам
	|ИЗ
	|	Документ.AMS_ИзменениеДополнительногоКВИндивидуальное.СтраховыеПродукты КАК AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ИзменениеДополнительногоКВИндивидуальное.Показатели КАК AMS_ИзменениеДополнительногоКВИндивидуальноеПоказатели
	|		ПО AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.КлючСвязи = AMS_ИзменениеДополнительногоКВИндивидуальноеПоказатели.КлючСвязи
	|ГДЕ
	|	AMS_ИзменениеДополнительногоКВИндивидуальноеПоказатели.Ссылка = &Ссылка
	|	И AMS_ИзменениеДополнительногоКВИндивидуальноеСтраховыеПродукты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AMS_ИзменениеДополнительногоКВИндивидуальное.Филиал КАК Филиал,
	|	ВТ_ДанныеПоСтраховымПродуктам.СтраховойПродукт КАК СтраховойПродукт,
	|	ВТ_ДанныеПоСтраховымПродуктам.Процент КАК Процент,
	|	ВТ_ДанныеПоСтраховымПродуктам.Отменен КАК Отменен,
	|	ВТ_ДанныеПоСтраховымПродуктам.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ВТ_ДанныеПоСтраховымПродуктам.КлючУсловий КАК КлючУсловий,
	|	ВТ_ДанныеПоСтраховымПродуктам.СтраховойРиск КАК СтраховойРиск,
	|	AMS_ИзменениеДополнительногоКВИндивидуальное.Агент КАК Агент,
	|	AMS_ИзменениеДополнительногоКВИндивидуальное.Дата КАК Период,
	|	ВТ_ДанныеПоСтраховымПродуктам.ГУИД КАК ГУИД,
	|	ВТ_ДанныеПоСтраховымПродуктам.ДатаНачалаДействия КАК ДатаНачалаДействия
	|ИЗ
	|	ВТ_ДанныеПоСтраховымПродуктам КАК ВТ_ДанныеПоСтраховымПродуктам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ИзменениеДополнительногоКВИндивидуальное КАК AMS_ИзменениеДополнительногоКВИндивидуальное
	|		ПО ВТ_ДанныеПоСтраховымПродуктам.Ссылка = AMS_ИзменениеДополнительногоКВИндивидуальное.Ссылка";
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли