#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Движения.AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Записывать = Истина;
	
	AMS_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ПараметрыПроведедения = Документы.AMS_ИзменениеДополнительногоКВИндивидуальное.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	AMS_ПроведениеСервер.ПроведениеПоРегистрам(ЭтотОбъект, ПараметрыПроведедения);
	AMS_АктуализацияКВПоИпотеке.СформироватьЗаписиАктуальногоКВ(Ссылка);
	
КонецПроцедуры


//Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
//	
//	ВидПродукта = Перечисления.AMS_ВидыСтраховыхПродуктов.ОСАГО;
//	Ответственный = Пользователи.ТекущийПользователь();
//	Организация = Константы.AMS_ОрганизацияПоУмолчанию.Получить();
//	
//КонецПроцедуры

#КонецОбласти
