#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ВидимостьЭлементовФормы();
	ВидимостьКаналовПродажПоПользователю();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

//Определяет видимость элементов формы (вызывается в "ПриСозданииНаСервере")
Процедура ВидимостьЭлементовФормы()

	Если Пользователи.РолиДоступны("ЧтениеГуидОбъекта", ПользователиКлиентСервер.ТекущийПользователь(), Ложь) Тогда
		Элементы.ГУИД.Видимость 		= Истина;
		//Элементы.ГУИД_Внешний.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьКаналовПродажПоПользователю()
	
	КаналПользователя = ПользователиКлиентСервер.ТекущийПользователь().AMS_КаналПродаж.ГУИД;
	
	Если НЕ КаналПользователя = "" Тогда
		
		ВидРавно = ВидСравненияКомпоновкиДанных.Равно;
		Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ГУИД", КаналПользователя, ВидРавно, Неопределено, Истина, Режим);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


