#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроведениеДокумента

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТаблицыДокумента();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	AMS_РазмерыКВБанков = Запрос.Выполнить().Выгрузить();	
	
	СтруктураТаблицДокумента = Новый Структура;
	СтруктураТаблицДокумента.Вставить("AMS_РазмерыКВБанков", AMS_РазмерыКВБанков);
	
	ПараметрыПроведения.Вставить("СтруктураТаблицДокумента", СтруктураТаблицДокумента);
	
	Возврат ПараметрыПроведения;
	
КонецФункции	

Функция ТекстЗапросаТаблицыДокумента()
	
	Результат = 
	"ВЫБРАТЬ
	|	AMS_ИзменениеКВБанка.Банк КАК Банк,
	|	AMS_ИзменениеКВБанкаВознаграждение.Риск КАК Риск,
	|	AMS_ИзменениеКВБанкаВознаграждение.РазмерКВ КАК РазмерКВ,
	|	AMS_ИзменениеКВБанкаВознаграждение.Идентификатор КАК ГУИД,
	|	AMS_ИзменениеКВБанка.Ссылка КАК ДокументИзменения,
	|	AMS_ИзменениеКВБанка.Дата КАК Период,
	|	AMS_ИзменениеКВБанкаВознаграждение.ДатаНачалаДействия КАК ДатаНачалаДействия
	|ИЗ
	|	Документ.AMS_ИзменениеКВБанка КАК AMS_ИзменениеКВБанка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ИзменениеКВБанка.Вознаграждение КАК AMS_ИзменениеКВБанкаВознаграждение
	|		ПО AMS_ИзменениеКВБанка.Ссылка = AMS_ИзменениеКВБанкаВознаграждение.Ссылка
	|ГДЕ
	|	AMS_ИзменениеКВБанка.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции	

Процедура ПерезаписатьДатуОкончания(Вознаграждения, Банк, Дата) Экспорт
	
	Риски = Вознаграждения.ВыгрузитьКолонку("Риск");
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаРазмерыКВ();
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("Риски", Риски);
	Запрос.УстановитьПараметр("ДатаДокумента", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", Дата(1, 1, 1));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПерезаписатьНаборДанных(Выборка, Вознаграждения);
	
КонецПроцедуры

Функция ТекстЗапросаРазмерыКВ()
	
	Результат = 
	"ВЫБРАТЬ
	|	AMS_РазмерыКВБанковСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.AMS_РазмерыКВБанков.СрезПоследних(
	|			&ДатаДокумента,
	|			Банк = &Банк
	|				И Риск В (&Риски)
	|				И ДатаОкончанияДействия = &ДатаОкончанияДействия) КАК AMS_РазмерыКВБанковСрезПоследних";
	
	Возврат Результат;
	
КонецФункции

Процедура ПерезаписатьНаборДанных(Выборка, Вознаграждения)
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого Вознаграждение Из Вознаграждения Цикл
			
			Набор = РегистрыСведений.AMS_РазмерыКВБанков.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Набор.Прочитать();
			
			Для Каждого Запись Из Набор Цикл
				
				Если Вознаграждение.Риск = Запись.Риск ТОгда
					Запись.ДатаОкончанияДействия = НачалоДня(Вознаграждение.ДатаНачалаДействия) - 1;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Набор.Модифицированность() Тогда
				Набор.Записать();
				
				УзелСОРВ = ОбменДаннымиСобытия.ВсеУзлыПланаОбмена("СОРВ");
				ПланыОбмена.ЗарегистрироватьИзменения(УзелСОРВ, Выборка.Регистратор);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтменаПроведенияДокументаКВБанков(Вознаграждения, Банк, Дата) Экспорт

	Риски = Вознаграждения.ВыгрузитьКолонку("Риск");
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаРаспроведение();
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("Риски", Риски);
	Запрос.УстановитьПараметр("ДатаДокумента", Новый Граница(Дата, ВидГраницы.Исключая));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОчиститьДатуОкончания(Выборка, Вознаграждения);
	
КонецПроцедуры

Функция ТекстЗапросаРаспроведение()
	
	Результат = 
	"ВЫБРАТЬ
	|	AMS_РазмерыКВБанковСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.AMS_РазмерыКВБанков.СрезПоследних(
	|			&ДатаДокумента,
	|			Банк = &Банк
	|				И Риск В (&Риски)) КАК AMS_РазмерыКВБанковСрезПоследних";
	
	Возврат Результат;
	
КонецФункции

Процедура ОчиститьДатуОкончания(Выборка, Вознаграждения)

	Выборка.Следующий();
		
		Для Каждого Вознаграждение Из Вознаграждения Цикл
			
			Набор = РегистрыСведений.AMS_РазмерыКВБанков.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Набор.Прочитать();
			
			Для Каждого Запись Из Набор Цикл
				
				Если Вознаграждение.Риск = Запись.Риск ТОгда
					Запись.ДатаОкончанияДействия = Дата(1, 1, 1);
				КонецЕсли;
				
			КонецЦикла;
			
			Если Набор.Модифицированность() Тогда
				Набор.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли