
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.AMS_РазмерыКВБанков.Записывать = Истина;
	
	Документы.AMS_ИзменениеКВБанка.ПерезаписатьДатуОкончания(Вознаграждение, Банк, Дата);
	
	AMS_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ПараметрыПроведедения = Документы.AMS_ИзменениеКВБанка.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	AMS_ПроведениеСервер.ПроведениеПоРегистрам(ЭтотОбъект, ПараметрыПроведедения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Документы.AMS_ИзменениеКВБанка.ОтменаПроведенияДокументаКВБанков(Вознаграждение, Банк, Дата);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ГУИД = "";
	Ответственный = Справочники.Пользователи.ПустаяСсылка();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для каждого СтрокаВознаграждения Из Вознаграждение Цикл
	
		Если НЕ ЗначениеЗаполнено(СтрокаВознаграждения.Идентификатор) Тогда
			
			 СтрокаВознаграждения.Идентификатор = Строка(Новый УникальныйИдентификатор);
			 
		КонецЕсли;	 
	
	КонецЦикла;
	
КонецПроцедуры
