#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьЗаполнениеРеквизита() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ОбщиеПравилаРасчетаКВ.Период КАК Период,
		|	AMS_ОбщиеПравилаРасчетаКВ.Регистратор КАК Регистратор,
		|	AMS_ОбщиеПравилаРасчетаКВ.НомерСтроки КАК НомерСтроки,
		|	AMS_ОбщиеПравилаРасчетаКВ.Активность КАК Активность,
		|	AMS_ОбщиеПравилаРасчетаКВ.Филиал КАК Филиал,
		|	AMS_ОбщиеПравилаРасчетаКВ.КаналПродаж КАК КаналПродаж,
		|	AMS_ОбщиеПравилаРасчетаКВ.ПодканалПродаж КАК ПодканалПродаж,
		|	AMS_ОбщиеПравилаРасчетаКВ.КатегорияПродавца КАК КатегорияПродавца,
		|	AMS_ОбщиеПравилаРасчетаКВ.Банк КАК Банк,
		|	AMS_ОбщиеПравилаРасчетаКВ.ГодСтрахования КАК ГодСтрахования,
		|	AMS_ОбщиеПравилаРасчетаКВ.КатегорияДоговора КАК КатегорияДоговора,
		|	AMS_ОбщиеПравилаРасчетаКВ.КБМОт КАК КБМОт,
		|	AMS_ОбщиеПравилаРасчетаКВ.КБМДо КАК КБМДо,
		|	AMS_ОбщиеПравилаРасчетаКВ.ПремияОт КАК ПремияОт,
		|	AMS_ОбщиеПравилаРасчетаКВ.ПремияДо КАК ПремияДо,
		|	AMS_ОбщиеПравилаРасчетаКВ.СтраховойПродукт КАК СтраховойПродукт,
		|	AMS_ОбщиеПравилаРасчетаКВ.СтраховойРиск КАК СтраховойРиск,
		|	AMS_ОбщиеПравилаРасчетаКВ.ЭтоЭлектронноеОсаго КАК ЭтоЭлектронноеОсаго,
		|	AMS_ОбщиеПравилаРасчетаКВ.Процент КАК Процент,
		|	AMS_ОбщиеПравилаРасчетаКВ.Отменен КАК Отменен,
		|	AMS_ОбщиеПравилаРасчетаКВ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	AMS_ОбщиеПравилаРасчетаКВ.ГУИД КАК ГУИД
		|ИЗ
		|	РегистрСведений.AMS_ОбщиеПравилаРасчетаКВ КАК AMS_ОбщиеПравилаРасчетаКВ
		|ИТОГИ ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРегистратор.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаРегистратор.Выбрать();
		
		Набор = РегистрыСведений.AMS_ОбщиеПравилаРасчетаКВ.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаписьНабора = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ВыборкаДетальныеЗаписи);
			ЗаписьНабора.ГУИД = Строка(Новый УникальныйИдентификатор);
			
		КонецЦикла;
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать(Истина);
		
	КонецЦикла;
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли