#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Для Каждого Строка Из ИсходныеДанные Цикл
		
		Если Не Строка.Свойство("ВидСтрахования") Тогда
			
			Комментарий = "Для справочника не заполнен обязательный реквизит ВидСтрахования";
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Виды страхования", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			
			Возврат;
			
		КонецЕсли;	
					
		СправочникЭлемент = Справочники.AMS_ВидыСтрахования.НайтиПоРеквизиту("ГУИДЦССУ", Строка.ВидСтрахования); 
		
		Если СправочникЭлемент.Пустая() Тогда 
			
			Если Строка.ЭтоГруппа Тогда
				
				СправочникОбъект = Справочники.AMS_ВидыСтрахования.СоздатьГруппу();
				
			Иначе
				
				СправочникОбъект = Справочники.AMS_ВидыСтрахования.СоздатьЭлемент();
				
			КонецЕсли;	
			
		Иначе
			
			СправочникОбъект = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка, "Наименование");
				
		Если Не Строка.ЭтоГруппа Тогда 
			
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка);
			
		КонецЕсли;
		
		ДозаполнитьВидСтрахования(СправочникОбъект, Строка, Строка.ЭтоГруппа);
		
		Попытка 
			
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Записать();
			
			Комментарий = СтрШаблон("Успешно записан вид страхования с УИД %1", Строка.ВидСтрахования);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Виды страхования", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_ВидыСтрахования, СправочникОбъект.Ссылка, Комментарий);
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Виды страхования", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_ВидыСтрахования, СправочникОбъект.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
			
	КонецЦикла;	
		
КонецПроцедуры  

Процедура ДозаполнитьВидСтрахования(СправочникОбъект, Строка, ЭтоГруппа)
	
	СправочникОбъект.Родитель = ЭлементСправочникаПоЦССУ("AMS_ВидыСтрахования", Строка.Родитель);
	СправочникОбъект.ГУИДЦССУ = Строка.ВидСтрахования;
	СправочникОбъект.ГУИД = Строка.ГУИД;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СправочникОбъект.ОсновнойРиск = ЭлементСправочникаПоЦССУ("AMS_СтраховыеРиски", Строка.ОсновнойРиск);
	
КонецПроцедуры

Процедура ДобавитьРиск(ВидыСтрахования, СтраховойРиск) Экспорт
	
	Для Каждого Строка Из ВидыСтрахования Цикл
		
		СправочникСсылка = ЭлементСправочникаПоЦССУ("AMS_ВидыСтрахования", Строка.ВидСтрахования);
		
		Если СправочникСсылка.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.ОсновнойРиск = СтраховойРиск;
		СправочникОбъект.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли