#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт

	Идентификаторы = ИдентификаторыПредопределенныхДанных();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
	
		СистемаОбъект = КлючЗначение.Ключ.ПолучитьОбъект();
		СистемаОбъект.ГУИД = КлючЗначение.Значение;
		СистемаОбъект.ГУИДЦССУ = КлючЗначение.Значение;
		СистемаОбъект.ОбменДанными.Загрузка = Истина;
	    СистемаОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедуры

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Если Не ИсходныеДанные.Свойство("GUID") Тогда
		
		Комментарий = "Для справочника не заполнен обязательный реквизит ГУИД";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Системы", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		
		Возврат;
		
	КонецЕсли;	
		
	ИсходныеДанные		  = СериализацияИсходныхДанных(ИсходныеДанные);
		
	СсылкаНаОбъект 		  = Справочники.AMS_Системы.ПолучитьСсылку(ИсходныеДанные.УИД); 
	
	СистемыОбъект				  = СсылкаНаОбъект.ПолучитьОбъект(); 
	
	Если СистемыОбъект = Неопределено Тогда 
		
		СистемыОбъект = Справочники.AMS_Системы.СоздатьЭлемент();
		
		СистемыОбъект.УстановитьСсылкуНового(СсылкаНаОбъект); 
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СистемыОбъект, ИсходныеДанные);
	
	Попытка 
		
		СистемыОбъект.Записать();
		
		Комментарий = СтрШаблон("Успешно записана система с УИД %1", ИсходныеДанные.УИД);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Системы", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_Системы, СистемыОбъект.Ссылка, Комментарий);
			
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Системы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_Системы, СистемыОбъект.Ссылка, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры  

Функция СериализацияИсходныхДанных(Данные)
	
	Попытка 
		
		СодержимоеСтруктуры = "УИД, Наименование, НаименованиеПолное, Отключен, СОРВКлючДляApi, СОРВРасчетВознаграждений,
							| СОРВПолучениеПравилРасчета, СОРВАдминистрирование";
		
		Результат = Новый Структура(СодержимоеСтруктуры);
		
		Результат.УИД = Новый УникальныйИдентификатор(Данные.GUID);
		
		Результат.Наименование					 = Данные.Наименование;
		Результат.ПолноеНаименование			 = Данные.ПолноеНаименование;
		Результат.Отключен						 = Булево(Данные.Отключен);
		Результат.СОРВКлючДляApi				 = Данные.СОРВКлючДляApi;
		Результат.СОРВРасчетВознаграждений		 = Булево(Данные.СОРВРасчетВознаграждений);
		Результат.СОРВПолучениеПравилРасчета	 = Булево(Данные.СОРВПолучениеПравилРасчета);
		Результат.СОРВАдминистрирование			 = Булево(Данные.СОРВАдминистрирование);
		
	Исключение 
		
		Результат = Неопределено;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Системы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_Системы,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанных()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_Системы.AMS, "f29a41ac-3a86-4605-9c6f-6cf407d65a18");
	Результат.Вставить(Справочники.AMS_Системы.СОРВ, "b0313a40-ae56-49ec-a0cf-6226f3879041");
	Результат.Вставить(Справочники.AMS_Системы.MasterAMS, "f29a41ac-3a86-4605-9c6f-6cf407d65a18");
	Результат.Вставить(Справочники.AMS_Системы.ЦССУ, "7110a067-d00d-4f7c-86af-0ef332a18d81");
	Результат.Вставить(Справочники.AMS_Системы.ЮПро2, "32d0c08a-cff6-495d-ae4e-f31c510f44fb");
	Результат.Вставить(Справочники.AMS_Системы.ЮПро3, "fb6349c9-4f20-43ce-8d3d-30bae15cba97");
	Результат.Вставить(Справочники.AMS_Системы.КИАС, "67b6ecf7-5df2-4628-8a71-9be9cc162d19");
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#КонецЕсли