#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедуры

Процедура ОбработатьОшибкуВЖурналРегистрации(ОбъектСсылка);
	
	СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий,ДатаСобытия");
	СтруктураСобытий.ИмяСобытия 		 = "Обмен с МАМС(MasterAMS)";
	СтруктураСобытий.ПредставлениеУровня = "Ошибка";
	СтруктураСобытий.Комментарий 		 = "Обмен RatingIncreaseCriteria с MAMS завершился с ошибкой. Не заполнен Прирост портфеля агента в документе" + ОбъектСсылка;
	СтруктураСобытий.ДатаСобытия 		 = ТекущаяДатаСеанса();
	
	СобытияДляЖурналаРегистрации = Новый СписокЗначений();
	СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
	
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт
	
	Результат = Новый Массив;
	
	ЗаполнитьДанныеРейтинга(ОбъектСсылка, Результат);
	ЗаполнитьДанныеУчастниковРейтингов(ОбъектСсылка, Результат);
	ЗаполнитьДанныеКурсыБалов(ОбъектСсылка, Результат);
	ЗаполнитьДанныеУсловияПриростаПортфеля(ОбъектСсылка, Результат);
	
	Возврат Результат;
	
КонецФункции	

#Область СообщениеДляМАМС

Функция ПолучитьСтруктуруСообщенияУсловияПриростаФиксированный()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "RatingIncreaseCriteria");
	Результат.Вставить("guid");
	Результат.Вставить("ratingGuid");
	Результат.Вставить("minInsurancePremium");
	Результат.Вставить("minContractCount");
	Результат.Вставить("minIncreaseInsurancePremium");
	Результат.Вставить("minIncreaseContractCount");
	Результат.Вставить("termAgreementMonth");
	Результат.Вставить("type");
	Результат.Вставить("scale", Неопределено);
	Результат.Вставить("fixed", Новый Структура("percent, points"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСообщенияУсловияПриростаШкала()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "RatingIncreaseCriteria");
	Результат.Вставить("guid");
	Результат.Вставить("ratingGuid");
	Результат.Вставить("minInsurancePremium");
	Результат.Вставить("minContractCount");
	Результат.Вставить("minIncreaseInsurancePremium");
	Результат.Вставить("minIncreaseContractCount");
	Результат.Вставить("termAgreementMonth");
	Результат.Вставить("type");
	Результат.Вставить("fixed", Неопределено);
	Результат.Вставить("scale");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтрукрутуСообщенияУсловияПриростаШкалаТЧ()
	
	Результат = Новый Структура;
	Результат.Вставить("minPercent");
	Результат.Вставить("maxPercent");
	Результат.Вставить("points");
	
	Возврат Результат;
	
КонецФункции // ПолучитьСтрукрутуСообщенияУсловияПриростаШкалаТЧ()

Функция ПолучитьСтруктуруСообщенияРейтинги()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "Rating");
	Результат.Вставить("guid");
	Результат.Вставить("typeGuid");
	Результат.Вставить("isCuratorial");
	Результат.Вставить("startDate");
	Результат.Вставить("endDate");
	Результат.Вставить("name");
	Результат.Вставить("isActive");
	Результат.Вставить("positionOffset");
	Результат.Вставить("isFreeAccess");
	Результат.Вставить("parentRatingGuid");
	Результат.Вставить("prizePlaces");
	Результат.Вставить("prizeNumberPoints");
	Результат.Вставить("isQuantity");
	Результат.Вставить("participantActivationRule", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСообщенияУчастникиРейтинговИсключения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "RatingParticipant");
	Результат.Вставить("partnerGuid");
	Результат.Вставить("ratingGuid");
	Результат.Вставить("blacklist", Новый Массив);

	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСообщенияУчастникиРейтингов()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "RatingParticipant");
	Результат.Вставить("partnerGuid");
	Результат.Вставить("ratingGuid");

	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСообщенияКурсыБалов()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "RatingCriteria");
	Результат.Вставить("guid");
	Результат.Вставить("insurancePremium");
	Результат.Вставить("numberPoints");
	Результат.Вставить("productTypeGuid");
	Результат.Вставить("productGuid");
	Результат.Вставить("ratingGuid");
	Результат.Вставить("minInsurancePeriodMonth");
	Результат.Вставить("minInsurancePremium");
	Результат.Вставить("eqQuantityPayment");
	Результат.Вставить("isNewBisiness");
	Результат.Вставить("isProlongation");
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаУчастников()
	
	Текст = 
		"ВЫБРАТЬ
		|	AMS_КонкурсыИРейтингиАгентовУчастники.Ссылка.ГУИД КАК ratingGuid,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУчастники.Ссылка.МероприятиеКуратора
		|			ТОГДА AMS_КонкурсыИРейтингиАгентовУчастники.Куратор.ГУИД
		|		ИНАЧЕ AMS_КонкурсыИРейтингиАгентовУчастники.Агент.ГУИД
		|	КОНЕЦ КАК partnerGuid
		|ИЗ
		|	Справочник.AMS_КонкурсыИРейтингиАгентов.Участники КАК AMS_КонкурсыИРейтингиАгентовУчастники
		|ГДЕ
		|	AMS_КонкурсыИРейтингиАгентовУчастники.Ссылка = &Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаКураторов()

	Текст = 
		"ВЫБРАТЬ
		|	AMS_КонкурсыИРейтингиАгентовУчастники.Ссылка.ГУИД КАК ratingGuid,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУчастники.Ссылка.МероприятиеКуратора
		|			ТОГДА AMS_КонкурсыИРейтингиАгентовУчастники.Куратор.ГУИД
		|		ИНАЧЕ AMS_КонкурсыИРейтингиАгентовУчастники.Агент.ГУИД
		|	КОНЕЦ КАК partnerGuid,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУчастники.Ссылка.МероприятиеКуратора
		|			ТОГДА AMS_КонкурсыИРейтингиАгентовУчастникиИсключения.Агент.ГУИД
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК blacklist
		|ИЗ
		|	Справочник.AMS_КонкурсыИРейтингиАгентов.Участники КАК AMS_КонкурсыИРейтингиАгентовУчастники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_КонкурсыИРейтингиАгентов.УчастникиИсключения КАК AMS_КонкурсыИРейтингиАгентовУчастникиИсключения
		|		ПО AMS_КонкурсыИРейтингиАгентовУчастники.КлючСвязи = AMS_КонкурсыИРейтингиАгентовУчастникиИсключения.КлючСвязи
		|ГДЕ
		|	AMS_КонкурсыИРейтингиАгентовУчастники.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	ratingGuid,
		|	partnerGuid";
	
	Возврат Текст;
	
КонецФункции

Процедура ЗаполнитьКуратораИсключения(Запрос, Результат)

	Запрос.Текст = ТекстЗапросаКураторов();
	ВыборкаКонкурсаРейтинга = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,,);
	
	Пока ВыборкаКонкурсаРейтинга.Следующий() Цикл
		
		ВыборкаУчастники = ВыборкаКонкурсаРейтинга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУчастники.Следующий() Цикл
			
			ВыборкаИсключения = ВыборкаУчастники.Выбрать();
			Исключения = Новый Массив;
			
			Пока ВыборкаИсключения.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаИсключения.blacklist) Тогда
					Исключения.Добавить(ВыборкаИсключения.blacklist);
				КонецЕсли;
				
			КонецЦикла;
			
			УчастникиРейтингов = ПолучитьСтруктуруСообщенияУчастникиРейтингов();
			УчастникиРейтингов.partnerGuid = ВыборкаУчастники.partnerGuid;
			УчастникиРейтингов.ratingGuid = ВыборкаУчастники.ratingGuid;
			УчастникиРейтингов.Вставить("blacklist" ,Исключения);
			
			Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(УчастникиРейтингов, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
			Результат.Добавить(Данные);
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьАгента(Запрос, Результат)

	Запрос.Текст = ТекстЗапросаУчастников();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УчастникиРейтингов = ПолучитьСтруктуруСообщенияУчастникиРейтингов();
		ЗаполнитьЗначенияСвойств(УчастникиРейтингов, Выборка);
		
		Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(УчастникиРейтингов, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
		Результат.Добавить(Данные);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДанныеУчастниковРейтингов(ОбъектСсылка, Результат)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	Если ОбъектСсылка.МероприятиеКуратора Тогда
		ЗаполнитьКуратораИсключения(Запрос, Результат);
	Иначе
		ЗаполнитьАгента(Запрос, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеКурсыБалов(ОбъектСсылка, Результат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.Ссылка.ГУИД КАК ratingGuid,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.Премия КАК insurancePremium,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.Баллы КАК numberPoints,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.ВидПродукта.ГУИД КАК productTypeGuid,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.Продукт.ГУИД КАК productGuid,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.ИдентификаторСтроки КАК guid,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.Пролонгация КАК isProlongation,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.НовыйБизнес КАК isNewBisiness,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.МинимальнаяСтраховаяПремия КАК minInsurancePremium,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.СрокСтрахованияПоДоговору КАК minInsurancePeriodMonth,
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.КоличествоПлатежей КАК eqQuantityPayment
		|ИЗ
		|	Справочник.AMS_КонкурсыИРейтингиАгентов.КурсБалловРейтинга КАК AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга
		|ГДЕ
		|	AMS_КонкурсыИРейтингиАгентовКурсБалловРейтинга.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		КурсыБалов	 = ПолучитьСтруктуруСообщенияКурсыБалов();
		ЗаполнитьЗначенияСвойств(КурсыБалов, ВыборкаДетальныеЗаписи);
		Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(КурсыБалов, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
		Результат.Добавить(Данные);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДанныеРейтинга(ОбъектСсылка, Результат)
	
	Рейтинги 			 = ПолучитьСтруктуруСообщенияРейтинги();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_КонкурсыИРейтингиАгентов.ГУИД КАК guid,
		|	AMS_КонкурсыИРейтингиАгентов.ДатаНачалаДействия КАК startDate,
		|	AMS_КонкурсыИРейтингиАгентов.ДатаОкончанияДействия КАК endDate,
		|	AMS_КонкурсыИРейтингиАгентов.Наименование КАК name,
		|	AMS_КонкурсыИРейтингиАгентов.Действует КАК isActive,
		|	AMS_КонкурсыИРейтингиАгентов.СмещениеРейтинга КАК positionOffset,
		|	AMS_КонкурсыИРейтингиАгентов.ДоступенВсем КАК isFreeAccess,
		|	AMS_КонкурсыИРейтингиАгентов.Родитель.ГУИД КАК parentRatingGuid,
		|	AMS_КонкурсыИРейтингиАгентов.КоличествоПризовыхМест КАК prizePlaces,
		|	AMS_КонкурсыИРейтингиАгентов.КоличествоПризовыхБаллов КАК prizeNumberPoints,
		|	AMS_КонкурсыИРейтингиАгентов.ТипМероприятия.ГУИД КАК typeGuid,
		|	AMS_КонкурсыИРейтингиАгентов.МероприятиеКуратора КАК isCuratorial,
		|	AMS_КонкурсыИРейтингиАгентов.РасчетПоКоличествуДоговоров КАК isQuantity
		|ИЗ
		|	Справочник.AMS_КонкурсыИРейтингиАгентов КАК AMS_КонкурсыИРейтингиАгентов
		|ГДЕ
		|	AMS_КонкурсыИРейтингиАгентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ЗаполнитьЗначенияСвойств(Рейтинги, ВыборкаДетальныеЗаписи);
	Рейтинги.startDate = Формат(Рейтинги.startDate, "ДФ=yyyy-MM-dd");
	Рейтинги.endDate   = Формат(Рейтинги.endDate, "ДФ=yyyy-MM-dd");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	AMS_КонкурсыИРейтингиАгентовУсловияУчастия.Условие.РеквизитВДругихСистемах КАК УсловиеРеквизитВДругихСистемах,
		|	AMS_КонкурсыИРейтингиАгентовУсловияУчастия.Параметр КАК Параметр
		|ИЗ
		|	Справочник.AMS_КонкурсыИРейтингиАгентов.УсловияУчастия КАК AMS_КонкурсыИРейтингиАгентовУсловияУчастия
		|ГДЕ
		|	AMS_КонкурсыИРейтингиАгентовУсловияУчастия.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ДанныеСоответствия = Новый Соответствие;
		ДанныеСоответствия.Вставить(ВыборкаДетальныеЗаписи.УсловиеРеквизитВДругихСистемах, ВыборкаДетальныеЗаписи.Параметр);
		Рейтинги.participantActivationRule = ДанныеСоответствия;
		
	КонецЕсли;
		
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Рейтинги, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	Результат.Добавить(Данные);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеУсловияПриростаПортфеля(ОбъектСсылка, Результат)
	
	УсловиеНачисления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "УсловияНачисленияБалловЗаПрирост");
	
	Если УсловиеНачисления = Перечисления.УсловияНачисленияБалловЗаПрирост.Фиксированый Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаФиксированный();
		Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
		
		ВыборкаФиксированный = Запрос.Выполнить().Выбрать();
		ВыборкаФиксированный.Следующий();
		
		УсловияПрироста = ПолучитьСтруктуруСообщенияУсловияПриростаФиксированный();
		ЗаполнитьЗначенияСвойств(УсловияПрироста, ВыборкаФиксированный);
		ЗаполнитьЗначенияСвойств(УсловияПрироста.fixed, ВыборкаФиксированный);
		
	ИначеЕсли УсловиеНачисления = Перечисления.УсловияНачисленияБалловЗаПрирост.Шкала Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаШкала();
		Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
		
		ВыборкаШкала = Запрос.Выполнить().Выбрать();
		ВыборкаШкала.Следующий();
		
		УсловияПрироста = ПолучитьСтруктуруСообщенияУсловияПриростаШкала();
		ЗаполнитьЗначенияСвойств(УсловияПрироста, ВыборкаШкала);
		
		ЗапросТЧ = Новый Запрос;
		ЗапросТЧ.Текст = ТекстЗапросаШкалаТЧ();
		ЗапросТЧ.УстановитьПараметр("Ссылка", ОбъектСсылка);
		
		ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
		
		ШкалаТЧ = Новый Массив;
		
		Пока ВыборкаТЧ.Следующий() Цикл
			
			УсловияПриростаТЧ = ПолучитьСтрукрутуСообщенияУсловияПриростаШкалаТЧ();
			ЗаполнитьЗначенияСвойств(УсловияПриростаТЧ, ВыборкаТЧ);
			ШкалаТЧ.Добавить(УсловияПриростаТЧ);
			
		КонецЦикла;
		
		УсловияПрироста.scale = ШкалаТЧ;
		
	КонецЕсли;
	
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(УсловияПрироста, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	Результат.Добавить(Данные);

КонецПроцедуры

Функция ТекстЗапросаФиксированный()

	Текст = "ВЫБРАТЬ
		|	AMS_КонкурсыИРейтингиАгентов.ГУИД КАК ratingGuid,
		|	AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.ГУИДПрироста КАК guid,
		|	AMS_КонкурсыИРейтингиАгентов.СрокДействия КАК termAgreementMonth,
		|	AMS_КонкурсыИРейтингиАгентов.СрокДействияПрироста.ВСистемеМастерАМС КАК type,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальнаяСтраховаяПремия = 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальнаяСтраховаяПремия, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК minInsurancePremium,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеУвеличениеКоличестваДоговоров = 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеУвеличениеКоличестваДоговоров, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК minIncreaseContractCount,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеУвеличениеСтраховойПремии = 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеУвеличениеСтраховойПремии, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК minIncreaseInsurancePremium,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеКоличествоДоговоров = 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеКоличествоДоговоров, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК minContractCount,
		|	AMS_КонкурсыИРейтингиАгентовФиксированный.ПроцентПрироста КАК percent,
		|	AMS_КонкурсыИРейтингиАгентовФиксированный.Баллы КАК points
		|ИЗ
		|	Справочник.AMS_КонкурсыИРейтингиАгентов КАК AMS_КонкурсыИРейтингиАгентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_КонкурсыИРейтингиАгентов.УсловияПриростаПортфеля КАК AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля
		|		ПО AMS_КонкурсыИРейтингиАгентов.Ссылка = AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_КонкурсыИРейтингиАгентов.Фиксированный КАК AMS_КонкурсыИРейтингиАгентовФиксированный
		|		ПО AMS_КонкурсыИРейтингиАгентов.Ссылка = AMS_КонкурсыИРейтингиАгентовФиксированный.Ссылка
		|ГДЕ
		|	AMS_КонкурсыИРейтингиАгентов.Ссылка = &Ссылка";
	
	Возврат Текст;

КонецФункции

Функция ТекстЗапросаШкала()

	Текст = "ВЫБРАТЬ
		|	AMS_КонкурсыИРейтингиАгентов.ГУИД КАК ratingGuid,
		|	AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.ГУИДПрироста КАК guid,
		|	AMS_КонкурсыИРейтингиАгентов.СрокДействия КАК termAgreementMonth,
		|	AMS_КонкурсыИРейтингиАгентов.СрокДействияПрироста.ВСистемеМастерАМС КАК type,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальнаяСтраховаяПремия = 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальнаяСтраховаяПремия, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК minInsurancePremium,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеУвеличениеКоличестваДоговоров = 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеУвеличениеКоличестваДоговоров, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК minIncreaseContractCount,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеУвеличениеСтраховойПремии = 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеУвеличениеСтраховойПремии, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК minIncreaseInsurancePremium,
		|	ВЫБОР
		|		КОГДА AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеКоличествоДоговоров = 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.МинимальноеКоличествоДоговоров, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК minContractCount
		|ИЗ
		|	Справочник.AMS_КонкурсыИРейтингиАгентов КАК AMS_КонкурсыИРейтингиАгентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_КонкурсыИРейтингиАгентов.УсловияПриростаПортфеля КАК AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля
		|		ПО AMS_КонкурсыИРейтингиАгентов.Ссылка = AMS_КонкурсыИРейтингиАгентовУсловияПриростаПортфеля.Ссылка
		|ГДЕ
		|	AMS_КонкурсыИРейтингиАгентов.Ссылка = &Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаШкалаТЧ()

	Текст = "ВЫБРАТЬ
	|	AMS_КонкурсыИРейтингиАгентовШкала.МинимальныйПроцентПрироста КАК minPercent,
	|	AMS_КонкурсыИРейтингиАгентовШкала.МаксимальныйПроцентПрироста КАК maxPercent,
	|	AMS_КонкурсыИРейтингиАгентовШкала.Баллы КАК points
	|ИЗ
	|	Справочник.AMS_КонкурсыИРейтингиАгентов.Шкала КАК AMS_КонкурсыИРейтингиАгентовШкала
	|ГДЕ
	|	AMS_КонкурсыИРейтингиАгентовШкала.Ссылка = &Ссылка";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли