
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если МероприятиеКуратора Тогда
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Участники.Агент"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Участники.Филиал"));
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПриростПортфеляАгента Тогда
		
		Для Каждого Прирост Из УсловияПриростаПортфеля Цикл
			
			Если Прирост.ГУИДПрироста = "" Тогда
				
				Прирост.ГУИДПрироста = Новый УникальныйИдентификатор;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
