#Область ПрограммныйИнтерфейс

Функция ПреобразоватьСообщениеЦССУВТаблицуЗначений(ТаблицаДокументаМассив) Экспорт
	
	ТаблицаДанных = ИнициализироватьТаблицуИзЦССУ();
	
	Если ТаблицаДокументаМассив.Количество() = 0 Тогда
		
		Возврат ТаблицаДанных;
		
	КонецЕсли;
	
	
	Для каждого СтрокаМассиваДанных Из ТаблицаДокументаМассив Цикл
	
		СтрокаТаблицы = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаМассиваДанных); 
	
	КонецЦикла;
	
	СгруппироватьТаблицуЦССУ(ТаблицаДанных);
	
	Возврат ТаблицаДанных;
	
КонецФункции	

Функция ФилиалАгента(Агент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	AMS_АгентскиеДоговоры.Филиал КАК Филиал
		|ИЗ
		|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
		|ГДЕ
		|	AMS_АгентскиеДоговоры.Владелец = &Агент";
	
	Запрос.УстановитьПараметр("Агент", Агент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Филиал;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СгруппироватьТаблицуЦССУ(ТаблицаДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВходящиеДанные.Процент КАК Процент,
		|	ВходящиеДанные.Отменен КАК Отменен,
		|	ВходящиеДанные.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ВходящиеДанные.ГУИД КАК ГУИД,
		|	ВходящиеДанные.Проведен КАК Проведен,
		|	ВходящиеДанные.ВидПродукта КАК ВидПродукта,
		|	ВходящиеДанные.Агент КАК Агент,
		|	ВходящиеДанные.ЭтоБанк КАК ЭтоБанк,
		|	ВходящиеДанные.ПодканалПродаж КАК ПодканалПродаж,
		|	ВходящиеДанные.КатегорияПродавца КАК КатегорияПродавца,
		|	ВходящиеДанные.КБМОт КАК КБМОт,
		|	ВходящиеДанные.ПремияОт КАК ПремияОт,
		|	ВходящиеДанные.БанкИНН КАК БанкИНН,
		|	ВходящиеДанные.ГодСтрахования КАК ГодСтрахования,
		|	ВходящиеДанные.Филиал КАК Филиал,
		|	ВходящиеДанные.КатегорияДоговора КАК КатегорияДоговора,
		|	ВходящиеДанные.СтраховойПродукт КАК СтраховойПродукт,
		|	ВходящиеДанные.СтраховойРиск КАК СтраховойРиск,
		|	ВходящиеДанные.КаналПродаж КАК КаналПродаж,
		|	ВходящиеДанные.ЭтоЭлектронноеОсаго КАК ЭтоЭлектронноеОсаго,
		|	ВходящиеДанные.ДополнительноеКВ КАК ДополнительноеКВ,
		|	ВходящиеДанные.Ссылка КАК Ссылка,
		|	ВходящиеДанные.Дата КАК Дата,
		|	ВходящиеДанные.ИдентификаторПоказателя КАК ИдентификаторПоказателя
		|ПОМЕСТИТЬ ВТ_ВходящиеДанные
		|ИЗ
		|	&ВходящиеДанные КАК ВходящиеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_ВходящиеДанные.Процент) КАК Процент,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.Отменен) КАК Отменен,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.ДатаОкончанияДействия) КАК ДатаОкончанияДействия,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.ГУИД) КАК ГУИД,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.Проведен) КАК Проведен,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.ВидПродукта) КАК ВидПродукта,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.Агент) КАК Агент,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.ЭтоБанк) КАК ЭтоБанк,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.ПодканалПродаж) КАК ПодканалПродаж,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.КатегорияПродавца) КАК КатегорияПродавца,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.КБМОт) КАК КБМОт,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.ПремияОт) КАК ПремияОт,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.БанкИНН) КАК БанкИНН,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.ГодСтрахования) КАК ГодСтрахования,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.Филиал) КАК Филиал,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.КатегорияДоговора) КАК КатегорияДоговора,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.СтраховойПродукт) КАК СтраховойПродукт,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.СтраховойРиск) КАК СтраховойРиск,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.КаналПродаж) КАК КаналПродаж,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.ЭтоЭлектронноеОсаго) КАК ЭтоЭлектронноеОсаго,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.ДополнительноеКВ) КАК ДополнительноеКВ,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.Ссылка) КАК Ссылка,
		|	МАКСИМУМ(ВТ_ВходящиеДанные.Дата) КАК Дата
		|ИЗ
		|	ВТ_ВходящиеДанные КАК ВТ_ВходящиеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВходящиеДанные.ИдентификаторПоказателя";
	
	Запрос.УстановитьПараметр("ВходящиеДанные", ТаблицаДанных);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДанных = РезультатЗапроса;
	
КонецПроцедуры	

Функция ИнициализироватьТаблицуИзЦССУ()
	
	ТипЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 2));
	ТипСтрока = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36));
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипДата   = Новый ОписаниеТипов("Дата");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Процент"				, ТипЧисло);
	Результат.Колонки.Добавить("Отменен"				, ТипБулево);
	Результат.Колонки.Добавить("ДатаОкончанияДействия"	, ТипДата);
	Результат.Колонки.Добавить("ГУИД"					, ТипСтрока);
	Результат.Колонки.Добавить("Проведен"				, ТипБулево);
	Результат.Колонки.Добавить("ВидПродукта"			, ТипСтрока);
	Результат.Колонки.Добавить("Агент"					, ТипСтрока);
	Результат.Колонки.Добавить("ЭтоБанк"				, ТипБулево);
	Результат.Колонки.Добавить("ПодканалПродаж"			, ТипСтрока);
	Результат.Колонки.Добавить("КатегорияПродавца"		, ТипСтрока);
	Результат.Колонки.Добавить("КБМОт"					, ТипЧисло);
	Результат.Колонки.Добавить("ПремияОт"				, ТипЧисло);
	Результат.Колонки.Добавить("БанкИНН"				, ТипСтрока);
	Результат.Колонки.Добавить("ГодСтрахования"			, ТипДата);
	Результат.Колонки.Добавить("Филиал"					, ТипСтрока);
	Результат.Колонки.Добавить("КатегорияДоговора"		, ТипСтрока);
	Результат.Колонки.Добавить("СтраховойПродукт"		, ТипСтрока);
	Результат.Колонки.Добавить("СтраховойРиск"			, ТипСтрока);
	Результат.Колонки.Добавить("КаналПродаж"			, ТипСтрока);
	Результат.Колонки.Добавить("ЭтоЭлектронноеОсаго"	, ТипБулево);
	Результат.Колонки.Добавить("ДополнительноеКВ"		, ТипБулево);
	Результат.Колонки.Добавить("Ссылка"					, ТипСтрока);
	Результат.Колонки.Добавить("Дата"					, ТипДата);
	Результат.Колонки.Добавить("ИдентификаторПоказателя", ТипСтрока);
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти
