#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура УсловияНачисленияБалловЗаПриростПриИзменении(Элемент)
	УстановитьВидимостьПоУсловиюНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ПриростПортфеляАгентаПриИзменении(Элемент)
	УстановитьВидимостьПоПриростуПортфеляАгента();
	УстановитьВидимостьПоУсловиюНачисления();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьЗаполнениеДанных(Отказ);
	ОчиститьУсловияПрироста();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_Филиалы") Тогда
		
		МассивАгентов = ПолучитьАгентовПоФилиалу(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_Агенты") Тогда	
		
		МассивАгентов = ПолучитьАгентовПоАгенту(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_КаналыПродаж") Тогда
		
		МассивАгентов = ПолучитьАгентовПоКаналам(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Кураторы") Тогда
		
		МассивАгентов = ПолучитьАгентовПоКураторам(ВыбранноеЗначение);
		
	КонецЕсли;
	
	ЗаполнитьУчастников(МассивАгентов);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсБалловРейтингаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Объект.КурсБалловРейтинга[Объект.КурсБалловРейтинга.Количество()-1].ИдентификаторСтроки = ПолучитьУИД();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьПоПриростуПортфеляАгента();
	УстановитьВидимостьПоТипуМероприятия();
	УстановитьВидимостьПоУсловиюНачисления();
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ТипМероприятияПриИзменении(Элемент)
	УстановитьВидимостьПоТипуМероприятия();
КонецПроцедуры

&НаКлиенте
Процедура УчастникиИсключенияАгентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УчастникиИсключения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;

	ТекущиеДанные.ИдентификаторАгента = ИдентификаторАгента(ТекущиеДанные.Агент);
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриростаПортфеляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Объект.УсловияПриростаПортфеля.Количество() > 0;
КонецПроцедуры

&НаКлиенте
Процедура ФиксированныйПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Объект.Фиксированный.Количество() > 0;
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПриИзменении(Элемент)
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПриАктивизацииСтроки(Элемент)
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПередУдалением(Элемент, Отказ)
	
	ИндексСтроки = Объект.Участники.Индекс(Элементы.Участники.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.Участники.Получить(ИндексСтроки);
	КлючСвязи = ВыделеннаяСтрока.КлючСвязи;
	
	НулевыеСтроки = Объект.УчастникиИсключения.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
	
	Для каждого СтрокаТаблицы Из НулевыеСтроки Цикл
		
		Объект.УчастникиИсключения.Удалить(СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Объект.Участники[Объект.Участники.Количество()-1].КлючСвязи = ПолучитьУИД();
		
	КонецЕсли;
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиИсключенияПриИзменении(Элемент)
	
	ИндексСтрокиУсловия = Объект.Участники.Индекс(Элементы.Участники.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.Участники.Получить(ИндексСтрокиУсловия);
	КлючСвязи = ВыделеннаяСтрока.КлючСвязи;
	
	Для каждого Стр Из Объект.УчастникиИсключения Цикл
		
		Если Не ЗначениеЗаполнено(Стр.КлючСвязи) Тогда
			
			Стр.КлючСвязи = КлючСвязи;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УчастникиИсключенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.Участники.Количество() <> 0 Тогда
		ИндексСтрокиУсловия = Объект.Участники.Индекс(Элементы.Участники.ТекущиеДанные);
		ВыделеннаяСтрока = Объект.Участники.Получить(ИндексСтрокиУсловия);
	Иначе
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо добавить участников",,"Объект.Участники",,Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Очистить(Команда)
	Объект.Участники.Очистить();
	Объект.УчастникиИсключения.Очистить();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Агент(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	ОткрытьФорму("Справочник.AMS_Агенты.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура Канал(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	ОткрытьФорму("Справочник.AMS_КаналыПродаж.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура Филиал(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	ОткрытьФорму("Справочник.AMS_Филиалы.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Куратор(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	ОткрытьФорму("Справочник.Кураторы.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьСтрок()
	
	ТекущиеДанные = Элементы.Участники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСвязи = ТекущиеДанные.КлючСвязи;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("КлючСвязи", КлючСвязи);
	Элементы.УчастникиИсключения.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторАгента(Агент)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Агент, "ГУИД")
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьУИД()
	Возврат Новый УникальныйИдентификатор();
КонецФункции

&НаСервере
Процедура ЗаполнитьУчастников(МассивАгентов)
	
	Для каждого Агент Из МассивАгентов Цикл 
		
		Отбор = Новый Структура("Агент", Агент.Агент);
		СтрокиТабличнойЧасти = Объект.Участники.НайтиСтроки(Отбор);
		
		Если СтрокиТабличнойЧасти.Количество() = 0 Тогда
			
			СтрокаУчастников = Объект.Участники.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаУчастников, Агент);
			
			Если НЕ ЗначениеЗаполнено(СтрокаУчастников.КлючСвязи) Тогда
				СтрокаУчастников.КлючСвязи = ПолучитьУИД();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.МероприятиеКуратора Тогда
		
		ВременнаяТаблицаУчастников = Объект.Участники.Выгрузить();	
		ВременнаяТаблицаУчастников.Свернуть("Филиал, Куратор, КлючСвязи");
		ВременнаяТаблицаУчастников.Колонки.Добавить("Агент");
		ВременнаяТаблицаУчастников.Колонки.Добавить("ИдентификаторАгента");
		ВременнаяТаблицаУчастников.Колонки.Добавить("СтатусАгента");
		
		Объект.Участники.Загрузить(ВременнаяТаблицаУчастников);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАгентовПоФилиалу(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_АгентскиеДоговоры.Владелец КАК Владелец,
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал
	|ИЗ
	|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|ГДЕ
	|	AMS_АгентскиеДоговоры.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Филиал", ВыбранноеЗначение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Агент", 	 Выборка.Владелец);
		СтруктураДанных.Вставить("Филиал", 	 Выборка.Филиал);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАгентовПоАгенту(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
	|	AMS_Агенты.Ссылка КАК Владелец
	|ИЗ
	|	Справочник.AMS_Агенты КАК AMS_Агенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ПО AMS_Агенты.Ссылка = AMS_АгентскиеДоговоры.Владелец
	|ГДЕ
	|	AMS_Агенты.Ссылка = &Агенты";
	
	Запрос.УстановитьПараметр("Агенты", ВыбранноеЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Агент", 	 Выборка.Владелец);
		СтруктураДанных.Вставить("Филиал", 	 Выборка.Филиал);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАгентовПоКаналам(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
	|	AMS_АгентскиеДоговоры.Владелец КАК Владелец
	|ИЗ
	|	Справочник.AMS_КаналыПродаж КАК AMS_КаналыПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ПО AMS_КаналыПродаж.Ссылка = AMS_АгентскиеДоговоры.КаналПродаж
	|ГДЕ
	|	AMS_КаналыПродаж.Ссылка = &Канал";
	
	Запрос.УстановитьПараметр("Канал", ВыбранноеЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Агент", 	 Выборка.Владелец);
		СтруктураДанных.Вставить("Филиал", 	 Выборка.Филиал);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАгентовПоКураторам(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
	|	СоответствиеКураторовАгентам.Агент КАК Агент,
	|	СоответствиеКураторовАгентам.Куратор КАК Куратор
	|ИЗ
	|	РегистрСведений.СоответствиеКураторовАгентам КАК СоответствиеКураторовАгентам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ПО СоответствиеКураторовАгентам.Агент = AMS_АгентскиеДоговоры.Владелец
	|ГДЕ
	|	СоответствиеКураторовАгентам.Куратор = &Куратор";
	
	Запрос.УстановитьПараметр("Куратор", ВыбранноеЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Агент", 	 Выборка.Агент);
		СтруктураДанных.Вставить("Филиал", 	 Выборка.Филиал);
		СтруктураДанных.Вставить("Куратор",	 Выборка.Куратор);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеДанных(Отказ)

	Если ЗначениеЗаполнено(Объект.Родитель) Тогда
		Если Объект.ДоступенВсем Тогда
			
			Если Объект.Участники.Количество() > 0 Тогда
				ТекстСообщения = "Установлен флаг ""Доступен всем"". Необходимо очистить участников рейтинга.";
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.ДоступенВсем",,Истина);
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ Объект.ДоступенВсем Тогда
			
			Если Объект.Участники.Количество() = 0 Тогда
				ТекстСообщения = "Необходимо добавить хотя бы одного участника рейтинга.";
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.Участники",,Истина);
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	Для Каждого Строка Из Объект.КурсБалловРейтинга Цикл
		
		Если ЗначениеЗаполнено(Строка.ВидПродукта) И ЗначениеЗаполнено(Строка.Продукт) Тогда
			Индекс = Строка.НомерСтроки - 1;
			ТекстСообщения = "Необходимо заполнить только одно поле: либо Вид продукта либо Продукт";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.КурсБалловРейтинга[" + Индекс + "].ВидПродукта",,Истина);
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.ВидПродукта) И НЕ ЗначениеЗаполнено(Строка.Продукт) Тогда	
			Индекс = Строка.НомерСтроки - 1;
			ТекстСообщения = "Необходимо заполнить одно поле: либо Вид продукта либо Продукт";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.КурсБалловРейтинга[" + Индекс + "].ВидПродукта",,Истина);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.ПриростПортфеляАгента Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.СрокДействияПрироста) Тогда
			ТекстСообщения = "Необходимо заполнить Срок действия прироста";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.СрокДействияПрироста",,Истина);
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.СрокДействия) Тогда
			ТекстСообщения = "Необходимо заполнить Срок действия";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.СрокДействия",,Истина);
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.УсловияНачисленияБалловЗаПрирост) Тогда
			ТекстСообщения = "Необходимо выбрать Условие начисление баллов за прирост";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.УсловияНачисленияБалловЗаПрирост",,Истина);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоТипуМероприятия()
	
	Элементы.Условия.Видимость = Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.AMS_Мероприятия.Конкурс");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоПриростуПортфеляАгента()
	
	Элементы.СрокДействияПрироста.Видимость				 = Объект.ПриростПортфеляАгента;
	Элементы.СрокДействия.Видимость						 = Объект.ПриростПортфеляАгента;
	Элементы.УсловияНачисленияБалловЗаПрирост.Видимость	 = Объект.ПриростПортфеляАгента;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоУсловиюНачисления()
	
	Если Объект.ПриростПортфеляАгента Тогда
		
		Элементы.УсловиеПриростаПортфеля.Видимость = Истина;
		
		Элементы.УсловиеШкала.Видимость = Объект.УсловияНачисленияБалловЗаПрирост = 
											ПредопределенноеЗначение("Перечисление.УсловияНачисленияБалловЗаПрирост.Шкала");
											
		Элементы.УсловиеФиксированный.Видимость = Объект.УсловияНачисленияБалловЗаПрирост = 
											ПредопределенноеЗначение("Перечисление.УсловияНачисленияБалловЗаПрирост.Фиксированый");
	Иначе
		
		Элементы.УсловиеШкала.Видимость = Ложь;
		Элементы.УсловиеФиксированный.Видимость = Ложь;
		Элементы.УсловиеПриростаПортфеля.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУсловияПрироста()

	Если НЕ Элементы.УсловиеШкала.Видимость Тогда
		Объект.Шкала.Очистить();
	КонецЕсли;
	
	Если НЕ Элементы.УсловиеФиксированный.Видимость Тогда
		Объект.Фиксированный.Очистить();
	КонецЕсли;
	
	Если НЕ Объект.ПриростПортфеляАгента Тогда
		Объект.УсловияНачисленияБалловЗаПрирост = ПредопределенноеЗначение("Перечисление.УсловияНачисленияБалловЗаПрирост.ПустаяСсылка");
		Объект.СрокДействияПрироста = ПредопределенноеЗначение("Справочник.СрокДействияПрироста.ПустаяСсылка");
		Объект.СрокДействия = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
