
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Ключ", Объект.Основание);
	ПараметрыОткрытия.Вставить("ЗадачаИспонителя", Объект.Ссылка);
	
	Если НужнаФормаСогласования(Объект.Основание) Тогда
		ОткрытьФорму("Документ.ЗаявкаНаИзменениеАД.Форма.ФормаДокументаСогласование", ПараметрыОткрытия);
	Иначе
		ОткрытьФорму("Документ.ЗаявкаНаИзменениеАД.Форма.ФормаДокумента", ПараметрыОткрытия);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервереБезКонтекста
Функция НужнаФормаСогласования(Ссылка)

	Статус = РегистрыСведений.СостояниеЗаявокНаИзменениеАД.ТекущийСтатус(Ссылка);
	
	Возврат Статус = ПредопределенноеЗначение("Справочник.СтатусыЗаявок.НаСогласовании");
	
КонецФункции	
	
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти