Функция НеобходимостьСогласованияПродукта(СтраховойПродукт, Процент, Агент) Экспорт
	
	ПараметрыКонтроля = РегистрыСведений.AMS_ОграниченияВознагражденийПоПродукту.ПараметрыПроверкиОграничений();
	ПараметрыКонтроля.РазмерПремии = Процент;
	ПараметрыКонтроля.СтраховойПродукт = СтраховойПродукт;
	Проверка1 = РегистрыСведений.AMS_ОграниченияВознагражденийПоПродукту.ПроверитьОграниченияМаксимальногоКВ(ПараметрыКонтроля);	

	ПараметрыКонтроля = Документы.ПриказОМаксимальномРазмереКВ.ПараметрыПроверкиОграничений();
	ПараметрыКонтроля.Агент = Агент;
	ПараметрыКонтроля.РазмерКВ = Процент;
	ПараметрыКонтроля.СтраховойПродукт = СтраховойПродукт;
	Проверка2 = Документы.ПриказОМаксимальномРазмереКВ.ПроверитьОграниченияМаксимальногоКВ(ПараметрыКонтроля);
	
	Возврат Проверка1 И Проверка2;
	
КонецФункции