
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаИзменениеАД") Тогда
		
		Основание = ДанныеЗаполнения.Ссылка;
		Филиал = ДанныеЗаполнения.Филиал;
		Процесс = Справочники.Процессы.СогласованиеЗаявкиОИзмененииАД;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РешениеПоКВПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Истина;
	
	//Проверка ограничяений по продукту
	ПараметрыКонтроля = РегистрыСведений.AMS_ОграниченияВознагражденийПоПродукту.ПараметрыПроверкиОграничений();
	Для каждого СтраховойПродукт Из Основание.СтраховыеПродукты Цикл
		
		ПараметрыКонтроля.РазмерПремии = СтраховойПродукт.Процент;
		ПараметрыКонтроля.СтраховойПродукт = СтраховойПродукт.СтраховойПродукт;
		Проверка = РегистрыСведений.AMS_ОграниченияВознагражденийПоПродукту.ПроверитьОграниченияМаксимальногоКВ(ПараметрыКонтроля);
		
		Если НЕ Проверка Тогда
			
			Результат = Ложь;
			Возврат;
			
		КонецЕсли;		
		
	КонецЦикла;	
		
	// Проверка ограничений по приказу 174
	ПараметрыКонтроля = Документы.ПриказОМаксимальномРазмереКВ.ПараметрыПроверкиОграничений();
	ПараметрыКонтроля.Агент = Основание.Агент;
	
	Для каждого СтраховойПродукт Из Основание.СтраховыеПродукты Цикл
	
		Если СтраховойПродукт.Отменен Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПараметрыКонтроля.РазмерКВ = СтраховойПродукт.Процент;
		ПараметрыКонтроля.СтраховойПродукт = СтраховойПродукт.СтраховойПродукт;
		Проверка = Документы.ПриказОМаксимальномРазмереКВ.ПроверитьОграниченияМаксимальногоКВ(ПараметрыКонтроля);
		
		Если НЕ Проверка Тогда
			
			Результат = Ложь;
			Возврат;
			
		КонецЕсли;	
				
	КонецЦикла;

	Если Результат = Истина Тогда
		
		РегистрыСведений.СостояниеЗаявокНаИзменениеАД.УстановитьСтатус(Основание, ПредопределенноеЗначение("Справочник.СтатусыЗаявок.ВРаботе"));
		Контекст = Новый Структура("Номер", Основание.Номер);
		СообщенияПользователямКлиентСервер.СоздатьСообщение(Справочники.ШаблоныПисем.Согласование,
						Основание.Ответственный, Контекст);
		
	КонецЕсли;	
	
КонецПроцедуры	
	
Процедура ДоработкаКВПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если Основание.Отклонена Тогда
		Результат = Ложь;
	    Возврат;
	КонецЕсли;
	
	Если Основание.НаДоработку Тогда
		Результат = Истина;
	    Возврат;
	КонецЕсли;	
		
КонецПроцедуры

Процедура СогласованоКВПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)

	Результат = НЕ Основание.Отклонена;
	Если НЕ Результат Тогда
		
		Контекст = Новый Структура("Номер", Основание.Номер);
		СообщенияПользователямКлиентСервер.СоздатьСообщение(Справочники.ШаблоныПисем.ЗаявкаОтклонена,
						Основание.Ответственный, Контекст);
	КонецЕсли;	
		
КонецПроцедуры

Процедура СогласованиеПередСозданиемВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	
	Для каждого ФормируемыйПроцесс Из ФормируемыеБизнесПроцессы Цикл
	
		
	
	КонецЦикла;
	
КонецПроцедуры

Процедура СогласованиеПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	
	Для каждого ФормируемыйПроцесс Из ФормируемыеБизнесПроцессы Цикл
	
		ФормируемыйПроцесс.Основание = Основание;
	
	КонецЦикла;

КонецПроцедуры

Процедура СогласованиеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ЗаявкаВРаботеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)

	Доработка = Ложь;
	
	Если Основание.НаДоработку Тогда
		
		ОснованиеОбъект = Основание.ПолучитьОбъект();
		ОснованиеОбъект.ЗаявкаНаСогласовании = Ложь;
		ОснованиеОбъект.Записать(РежимЗаписиДокумента.Запись);
		Доработка = Истина;
		
	КонецЕсли;	
	
	
	Для каждого ЗадачаПользователя Из ФормируемыеЗадачи Цикл
	
		ЗаполнитьЗначенияСвойств(ЗадачаПользователя, ЭтотОбъект);
	    ЗадачаПользователя.Номер 	= Неопределено;
		ЗадачаПользователя.Процесс 	= Справочники.Процессы.СогласованиеЗаявкиОИзмененииАД;
		
		Если Доработка Тогда
			
			ЗадачаПользователя.Исполнитель = Основание.Ответственный;
			ЗадачаПользователя.Наименование = "Требуется доработка " + ОснованиеОбъект;
			
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры

Процедура ВРаботеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Контекст = Новый Структура("Номер", Основание.Номер);
	СообщенияПользователямКлиентСервер.СоздатьСообщение(Справочники.ШаблоныПисем.СогласованоКВ,
						Основание.Ответственный, Контекст);
	
	Для каждого ЗадачаПользователя Из ФормируемыеЗадачи Цикл
	
		
	КонецЦикла;
	
	ИзменениеКВ = Документы.AMS_ИзменениеКВИндивидуальное.СоздатьДокумент();
	ИзменениеКВ.Заполнить(Основание);
	ИзменениеКВ.Дата = ТекущаяДата();
	ИзменениеКВ.Записать(РежимЗаписиДокумента.Проведение);
	
	РегистрыСведений.СостояниеЗаявокНаИзменениеАД.УстановитьСтатус(Основание, Справочники.СтатусыЗаявок.Согласована);
	
КонецПроцедуры
