
Процедура ПередЗаписью(Отказ, Замещение)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ГУИД <> "" и Запись.Период<= ТекущаяДата() и НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
			
		Отказ = Истина; 
		 ОбщегоНазначения.СообщитьПользователю("Только пользователи с полными правами могут изменять текущие действующие записи!",, "РегистрСведений.AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий",, Отказ);

		//ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Только пользователи с полными правами могут изменять текущие действующие записи!", "РегистрСведений.AMS_НаборыДополнительныхУсловий");
		//ВызватьИсключение ТекстИсключения;
     			
		КонецЕсли;
	
		
		
		Если Запись.ГУИД = "" Тогда
			Запись.ГУИД = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.Ответственный)  Тогда
			Запись.Ответственный = ТекущийПользователь;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры
