#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(УзелИнформационнойБазы, 
								ВидСообщения, 
								Сообщение, Ошибка = Ложь) Экспорт
								
	Менеджер = РегистрыСведений.AMS_ЖурналСообщений.СоздатьМенеджерЗаписи();					
	Менеджер.Идентификатор = XMLСтрока(Новый УникальныйИдентификатор);
	Менеджер.Сообщение 	   = Сообщение;
	Менеджер.ВидСообщения  = ВидСообщения;
	Менеджер.ПланОбмена	   = УзелИнформационнойБазы;
	Менеджер.ДатаСообщения = ТекущаяДатаСеанса();
	Менеджер.ОбработаноСОшибкой = Ошибка;
		
	Менеджер.Записать();
	
КонецПроцедуры								

Процедура ЗафиксироватьОбработку(Идентификатор) Экспорт
	
	Менеджер = РегистрыСведений.AMS_ЖурналСообщений.СоздатьМенеджерЗаписи();
	Менеджер.Идентификатор = Идентификатор;
	
	Менеджер.Прочитать();
	
	Если ЗначениеЗаполнено(Менеджер.Сообщение) Тогда
		
		Менеджер.Обработано = Истина;
	    Менеджер.ДатаОбработки = ТекущаяДатаСеанса();
		Менеджер.Записать(Истина);
		
	КонецЕсли;	
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли