#Область ПрограммныйИнтерфейс

Процедура СоздатьСообщение(Шаблон, Пользователь, Контекст) Экспорт

	АдресЭлектроннойПочты = ПолучитьАдресЭлектроннойПочты(Пользователь);
	
	Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УчетнаяЗаписьДляОтправки = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	ТекстПисьма = Шаблон.ТекстПисьма;
	
	Для каждого КлючЗначение Из Контекст Цикл
	
		ТекстПисьма = СтрЗаменить(ТекстПисьма, КлючЗначение.Ключ, КлючЗначение.Значение);
	
	КонецЦикла;
	Тема = Шаблон.ПолноеНаименование;
	
	Письмо = Справочники.ЭлектронноеПисьмоИсходящее.СоздатьЭлемент();
	Письмо.Отправитель = УчетнаяЗаписьДляОтправки;
	Письмо.Получатель  = АдресЭлектроннойПочты;
	Письмо.Тема = Тема;
	Письмо.Сообщение = ТекстПисьма;
	Письмо.Записать();
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьАдресЭлектроннойПочты(Пользователь)
	
	Результат = "";
	ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	Таблица = "Пользователи.КонтактнаяИнформация";
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.AMS_Агенты") Тогда
		
		ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailАгенты;
		Таблица = "AMS_Агенты.КонтактнаяИнформация";
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Представление КАК Представление
		|ИЗ
		|	Справочник." + Таблица + " КАК Т
		|ГДЕ
		|	Т.Вид = &Вид
		|	И Т.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Вид", ВидКИ);
	Запрос.УстановитьПараметр("Ссылка", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Представление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Процедура ОтправкаЭлектронныхПисем() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлектронноеПисьмоИсходящее.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
		|ГДЕ
		|	НЕ ЭлектронноеПисьмоИсходящее.Отправлено";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭПОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЭПОбъект.ОтправитьПисьмо();
		ЭПОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


