#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедуры
// Первая версия модуля 29.08.2024
Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Если Не ИсходныеДанные.Свойство("ГУИД") Тогда
		
		Комментарий = "Для справочника не заполнен обязательный реквизит ГУИД";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Внешние системы", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		
		Возврат;
		
	КонецЕсли;	
		
	ИсходныеДанные			  = СериализацияИсходныхДанных(ИсходныеДанные);
		
	СсылкаНаОбъект 			  = Справочники.AMS_ВнешниеСистемы.ПолучитьСсылку(ИсходныеДанные.УИД);
	
	ВнешниеСистемыОбъект 	  = СсылкаНаОбъект.ПолучитьОбъект(); 
	
	Если ВнешниеСистемыОбъект = Неопределено Тогда 
		
		ВнешниеСистемыОбъект = Справочники.AMS_ВнешниеСистемы.СоздатьЭлемент();
		
		ВнешниеСистемыОбъект.УстановитьСсылкуНового(СсылкаНаОбъект); 
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ВнешниеСистемыОбъект, ИсходныеДанные);
	
	Попытка 
		
		ВнешниеСистемыОбъект.Записать();
		
		Комментарий = СтрШаблон("Успешно записана внешняя система с УИД %1", ИсходныеДанные.УИД);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Внешние системы", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_ВнешниеСистемы, ВнешниеСистемыОбъект.Ссылка, Комментарий);
			
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Виды страхования", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_ВнешниеСистемы, ВнешниеСистемыОбъект.Ссылка, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры  

Функция СериализацияИсходныхДанных(Данные)
	
	Попытка
		
		СодержимоеСтруктуры = "УИД, Комментарий, Наименование, НаименованиеПолное, ПометкаУдаления, ТипСправочника, ЭтоГруппа";
		
		Результат = Новый Структура(СодержимоеСтруктуры);
		
		Результат.УИД = Новый УникальныйИдентификатор(Данные.ГУИД);
		
		Результат.Наименование		 = Данные.Наименование;
		Результат.НаименованиеПолное = Данные.НаименованиеПолное;
		Результат.ПометкаУдаления	 = Булево(Данные.ПометкаУдаления);
		Результат.ТипСправочника	 = Данные.ТипСправочника;
		Результат.ЭтоГруппа			 = Булево(Данные.ЭтоГруппа);
		
	Исключение
		
		Результат = Неопределено;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Внешние системы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_ВнешниеСистемы,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли