#Область ПрограммныйИнтерфейс

//Входная точка для нетиповых обменов в подсистеме "Обмен данными" БСП
Процедура ВыгрузкаЗагрузкаДанных(СтандартнаяОбработка,
								ПланОбмена,
								ИмяФайлаСообщения,
								ДанныеСообщения,
								КоличествоЭлементовВТранзакции,
								ИмяСобытияЖурналаРегистрации,
								КоличествоОтправленныхОбъектов,
								НаименованиеПланаОбмена,
								ВидПроцедуры,
								Отладка = Ложь,
								ОтладочноеСообщение = Неопределено) Экспорт
								
	СтандартнаяОбработка = Ложь;
	
	ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзлаСОРВ(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение);
	
КонецПроцедуры

#КонецОбласти

#Область ВариантыОбмена

Процедура ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзлаСОРВ(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,
														   КоличествоЭлементовВТранзакции = 0, КлючСообщенияЖурналаРегистрации = "",
														   КоличествоОбъектовОбработано = 0, ВидПроцедуры, Отладка, ОтладочноеСообщение)
							
	Если ВидПроцедуры = "Выгрузка" Тогда
		ВыполнитьВыгрузкуИзмененийДляУзлаСОРВ(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,
							КоличествоЭлементовВТранзакции, КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры);
	Иначе
		//ВыполнитьЗагрузкуИзмененийДляУзлаМонолит(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,
		//					КоличествоЭлементовВТранзакции, КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры);					
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыполнитьВыгрузкуИзмененийДляУзлаСОРВ(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,
							КоличествоЭлементовВТранзакции, КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры)

	ОбработаноСообщений			= 0;
	ПереданоСОшибкой			= 0;
	ЗарегистрированныеОбъекты	= ПолучитьЗарегистрированныеКОтправкеОбъекты(ИмяФайла, УзелИнформационнойБазы);
	ОбъектыОбработанныеСОшибкой	= Новый Массив();
	СтруктураСообщения			= ПолучитьСтруктуруСообщения();
	ИменаПолейВСообщении		= ПолучитьСоответствиеПолейСообщения();
	ГУИДыВидовСравнения			= ПолучитьСоответствиеГУИДыВидовСравнения();
	СоответствиеТипов			= ПолучитьСоответствиеТиповСОРВ();
	
	РезультатОтправки = Новый Структура("Успех, Сообщение", Истина, Неопределено);
	
	Для Каждого Пакет Из ЗарегистрированныеОбъекты Цикл
		
		ВыборкаИзменений = Пакет.Выбрать();
		
		Пока ВыборкаИзменений.Следующий() Цикл
			
			СтруктураСообщения			= ПолучитьСтруктуруСообщения();
			ДобавитьТекущийЭлементВСтруктуруСообщения(ВыборкаИзменений, СтруктураСообщения, ИменаПолейВСообщении, ГУИДыВидовСравнения,
														СоответствиеТипов);
			ТекстСообщения = СформироватьТекстСообщения(СтруктураСообщения);
			
			ЗаписьЖурналаРегистрации("СОРВ.СообщенияИнтеграции." + ВыборкаИзменений.Тип, УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
			
			РезультатОтправки = ОтправитьСообщениеВСОРВ(ТекстСообщения, УзелИнформационнойБазы);											
			
		КонецЦикла;
		
	КонецЦикла; 
		
	Если РезультатОтправки.Успех Тогда
		
		ОбработаноСообщений = ОбработаноСообщений + 1;
		ОчиститьСписокИзменений(УзелИнформационнойБазы);
		СоздатьФайлВыгрузкиЗаглушкуДляОбменаНаБСП(ИмяФайла);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обмен данными.СОРВ.Отправка данных"
			, УровеньЖурналаРегистрации.Информация, Метаданные.ПланыОбмена.СОРВ, "", "Выгрузка проведена успешно");
		
	Иначе
		ПереданоСОшибкой = ПереданоСОшибкой + 1;
		ТекстЗаписиЖурнала = "Данное сообщение не обработано:
							|" + РезультатОтправки.Сообщение;
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обмен данными.СОРВ.Отправка данных"
			, УровеньЖурналаРегистрации.Ошибка, Метаданные.ПланыОбмена.СОРВ, "", ТекстЗаписиЖурнала);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СформироватьСообщение

//Чтобы типовой механизм понял, что выгрузка данных произошла,
//надо заполнить типовой файл выгрузки содержимым.
Процедура СоздатьФайлВыгрузкиЗаглушкуДляОбменаНаБСП(ИмяФайлаСообщения)

	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайлаСообщения);
	ТекстЗаглушка = "Этот файл создаётся типовым механизмом обмена БСП. Его следует игнорировать. Можно удалять.";
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Данные");
	ЗаписьХМЛ.ЗаписатьТекст(ТекстЗаглушка);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.Закрыть();
	
КонецПроцедуры

//Получение зарегистрированных изменений объектов
Функция ПолучитьЗарегистрированныеКОтправкеОбъекты(ИмяФайла, УзелИнформационнойБазы)

	МетаДанныеОбмена		= УзелИнформационнойБазы.МетаДанные();
	СоставПланаОбмена		= МетаДанныеОбмена.Состав;
	УчаствуютВОбмене		= Новый Массив();
	НаименованиеПланаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелИнформационнойБазы, "Наименование");
	
	Для Каждого Элемент Из СоставПланаОбмена Цикл
		УчаствуютВОбмене.Добавить(Элемент.Метаданные.ПолноеИмя());
	КонецЦикла;
	
	// Получаем выборку измененных данных.
	Запрос = Новый Запрос;
	Запрос.Текст = ОбменДаннымиAMS.ТекстЗапросаИзмененийПланаОбмена(УчаствуютВОбмене, НаименованиеПланаОбмена);
	Запрос.УстановитьПараметр("Узел", УзелИнформационнойБазы);
	
	ВыборкаИзменений = Запрос.ВыполнитьПакет();
	
	Возврат ВыборкаИзменений;
	
КонецФункции

//Текстовое представление реквизитов отправляемых данных
Функция СписокРеквизитовОбъекта(Данные)

	Результат = "";
	МетаданныеОбъекта = Данные.Метаданные();
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		ИмяРеквизита = Реквизит.Имя; 
		Результат 	 = Результат + ИмяРеквизита + ", ";
	КонецЦикла;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(Результат, 2);
	
	Возврат Результат;
	
КонецФункции

//Формирует структуру отправляемого сообщения
Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура();
	
	Результат.Вставить("systems"						, Новый Массив());
	Результат.Вставить("sellerOptions"					, Новый Массив());
	Результат.Вставить("remunerationKinds"				, Новый Массив());
	Результат.Вставить("products"						, Новый Массив());
	Результат.Вставить("remunerationConstraints"		, Новый Массив());
	Результат.Вставить("additionalConditionParameters"	, Новый Массив());
	Результат.Вставить("additionalConditionSets"		, Новый Массив());
	Результат.Вставить("calculationRules"				, Новый Массив());
	Результат.Вставить("bonusProgramRules"				, Новый Массив());
	Результат.Вставить("Banks"							, Новый Массив());
	Результат.Вставить("BankAgentMaxKVS"				, Новый Массив());
	
	Возврат Результат;
	
КонецФункции

//Формирует соответствие обрабатываемых элементов отправляемого сообщения
Функция ПолучитьСоответствиеПолейСообщения()

	Результат = Новый Соответствие();
	
	Результат.Вставить("Системы"														, "systems");
	Результат.Вставить("Продавцы"														, "sellerOptions");
	Результат.Вставить("Виды вознаграждений партнерам"									, "remunerationKinds");
	Результат.Вставить("Страховые продукты"												, "products");
	Результат.Вставить("AMS_ПереработатьИлиУдалитьОграниченияВознагражденийПоПродукту"	, "remunerationConstraints");
	Результат.Вставить("Параметры дополнительных условий"								, "additionalConditionParameters");
	Результат.Вставить("AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий"			, "additionalConditionSets");
	Результат.Вставить("Правила расчета вознаграждений"									, "calculationRules");
	Результат.Вставить("Результат расчета вознаграждений"								, "calculation");
	Результат.Вставить("МотивационныеПрограммы"											, "bonusProgramRules");
	Результат.Вставить("Банки"															, "Banks");
	Результат.Вставить("СпрБанки"														, "Banks");
	Результат.Вставить("КВБанка"														, "calculationRules");
	Результат.Вставить("Лимиты КВ банков и агентов"										, "BankAgentMaxKVS");
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТипыЭлементов(Элемент)
	
	ТипыЭлементов = Новый Соответствие();
	ТипыЭлементов.Вставить(Тип("СправочникСсылка.AMS_Системы")						, "Системы");
	ТипыЭлементов.Вставить(Тип("СправочникСсылка.AMS_АгентскиеДоговоры")			, "Договор агента");
	ТипыЭлементов.Вставить(Тип("СправочникСсылка.AMS_ВидыВознаграждений")			, "Виды вознаграждений партнерам");
	ТипыЭлементов.Вставить(Тип("СправочникСсылка.AMS_СтраховыеПродукты")			, "Страховые продукты");
	ТипыЭлементов.Вставить(Тип("ДокументСсылка.AMS_ИзменениеУсловийМотивационнойПрограммы")			, "Мотивационные программы");
	ТипыЭлементов.Вставить("AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий"	, "AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий");
	ТипыЭлементов.Вставить("AMS_ОграниченияВознагражденийПоПродукту"				, "AMS_ПереработатьИлиУдалитьОграниченияВознагражденийПоПродукту");
	ТипыЭлементов.Вставить("AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ"		, "Правила расчета вознаграждений");
	ТипыЭлементов.Вставить("AMS_ИндивидуальныеПравилаРасчетаКВ"						, "Правила расчета вознаграждений");
	ТипыЭлементов.Вставить("AMS_ОбщиеПравилаРасчетаДополнительногоКВ"				, "Правила расчета вознаграждений");
	ТипыЭлементов.Вставить("AMS_ОбщиеПравилаРасчетаКВ"								, "Правила расчета вознаграждений");
	ТипыЭлементов.Вставить(Тип("ПланВидовХарактеристикСсылка.AMS_ПараметрыДополнительныхУсловий")	, "Параметры дополнительных условий");
	ТипыЭлементов.Вставить(Тип("СправочникСсылка.AMS_Продавцы")						, "Продавцы");
	ТипыЭлементов.Вставить(Тип("ДокументСсылка.AMS_ИзменениеУсловийМотивационнойПрограммы"), "МотивационныеПрограммы");
	ТипыЭлементов.Вставить("AMS_СоответствиеАгентовИБанков", "Банки");
	ТипыЭлементов.Вставить(Тип("ДокументСсылка.AMS_ИзменениеКВБанка")				, "КВБанка");
	ТипыЭлементов.Вставить(Тип("СправочникСсылка.AMS_Банки")						, "СпрБанки");
	ТипыЭлементов.Вставить("AMS_ЛимитыКВБанковИАгентов"								, "Лимиты КВ банков и агентов");
	
	Возврат ТипыЭлементов;
	
КонецФункции

//Формирует соответствие обрабатываемых типов параметров доп характеристик отправляемого сообщения
Функция ПолучитьСоответствиеТиповСОРВ()

	Результат = Новый Соответствие();
	
	Результат.Вставить(Тип("Число")					 , "a7166d6e-ffd9-4f84-8598-994a05d59c6b");
	Результат.Вставить(Тип("Булево")				 , "eafdc1b8-1d5a-45c2-902c-df29a5d98bae");
	Результат.Вставить(Тип("Строка")				 , "7c1461c9-9cfa-4bb9-9cfe-4e6d6cdf560a");
	Результат.Вставить(Тип("Дата")					 , "26edea1a-a16c-42a2-b57d-a4592bd6569f");
	Результат.Вставить(Тип("УникальныйИдентификатор"), "d1dfcc87-1214-4c1d-bf39-c118d9cca002");
	
	Возврат Результат;
	
КонецФункции

//Формирует соответствие ГУИДов видов сравнений
Функция ПолучитьСоответствиеГУИДыВидовСравнения()

	Результат = Новый Соответствие();
	
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.Больше		, "11512b17-3226-482b-8fe9-e6bf9d16dfed");
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.БольшеИлиРавно, "fb270718-9ba1-4964-8740-5f1ec9bd6ab2");
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.ВСписке		, "aa161c66-f912-4121-82b5-e25d84f772d0");
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.Заполнено		, "9d1c4e32-7e8b-4aed-bb38-4bce44978134");
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.Меньше		, "2b4fb433-92e5-429b-ae61-fc598ca7c904");
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.МеньшеИлиРавно, "9292d0b4-9120-4cf1-b6d5-647b34bc01a7");
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.НеВСписке		, "44b7b02a-271c-4302-89e7-d61ab282f0d8");
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.НеЗаполнено	, "ee7b28b7-4f44-43fc-82eb-c6ceb6d24e5d");
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.НеРавно		, "ba2ff6a3-084f-4f17-9f28-160f6a06af73");
	Результат.Вставить(Перечисления.AMS_ВидыСравнения.Равно			, "9821d79b-0d62-4543-84cd-4a4da5430173");

	Возврат Результат;
	
КонецФункции

//Определяет тип дополнительного параметра
Функция ОпределитьТипПараметра(ОписаниеТипа)

	Если НЕ ЗначениеЗаполнено(ОписаниеТипа) Тогда
		Возврат Тип("УникальныйИдентификатор");
	КонецЕсли;	
	
	Если ОписаниеТипа.СодержитТип(Тип("Число")) Тогда
		Результат = Тип("Число");
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Булево")) Тогда
		Результат = Тип("Булево");
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Дата")) Тогда
		Результат = Тип("Дата");
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Строка")) Тогда
		Результат = Тип("Строка");
	Иначе
		Результат = Тип("УникальныйИдентификатор");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Массивы сообщения заполняются соответствующими элементами
Функция ДобавитьТекущийЭлементВСтруктуруСообщения(Элемент, СтруктураСообщения, СоответствиеПолей, ГУИДыВидовСравнения, СоответствиеТипов)

	СоответствиеТиповЭлементов = СформироватьТипыЭлементов(Элемент);
	
	ТипЭлемента = СоответствиеТиповЭлементов.Получить(Элемент.Тип);
	
	Если ТипЭлемента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивКЗаполнению = СоответствиеПолей[ТипЭлемента];
	ПараметрыЭлемента = Новый Структура();
	
	Если ТипЭлемента = "Системы" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_Системы(ПараметрыЭлемента, Элемент);
		СтруктураСообщения[МассивКЗаполнению].Добавить(ПараметрыЭлемента);
		
	ИначеЕсли ТипЭлемента = "Договор агента" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ДоговорАгента(СтруктураСообщения[МассивКЗаполнению], Элемент);
		
	ИначеЕсли ТипЭлемента = "Виды вознаграждений партнерам" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ВидыВознаграждений(ПараметрыЭлемента, Элемент);
		Если ПараметрыЭлемента.Свойство("id") Тогда
			СтруктураСообщения[МассивКЗаполнению].Добавить(ПараметрыЭлемента);		
		КонецЕсли;
		
	ИначеЕсли ТипЭлемента = "Страховые продукты" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_СтраховыеПродукты(ПараметрыЭлемента, Элемент);
		СтруктураСообщения[МассивКЗаполнению].Добавить(ПараметрыЭлемента);
		
	ИначеЕсли ТипЭлемента = "AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_НаборыДополнительныхУсловий(СтруктураСообщения[МассивКЗаполнению], Элемент);
		
	ИначеЕсли ТипЭлемента = "AMS_ПереработатьИлиУдалитьОграниченияВознагражденийПоПродукту" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ОграниченияВознагражденийПоПродукту(СтруктураСообщения[МассивКЗаполнению], Элемент);
		
	ИначеЕсли ТипЭлемента = "Правила расчета вознаграждений" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ПравилаРасчетаВознаграждений(СтруктураСообщения[МассивКЗаполнению], 
																				Элемент, ГУИДыВидовСравнения);
																				
	ИначеЕсли ТипЭлемента = "МотивационныеПрограммы" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ИзменениеУсловийМотивационнойПрограммы(СтруктураСообщения[МассивКЗаполнению], 
																					Элемент, ГУИДыВидовСравнения);																			
																					
	ИначеЕсли ТипЭлемента = "Банки" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_Банки(ПараметрыЭлемента, Элемент);																				
		СтруктураСообщения[МассивКЗаполнению].Добавить(ПараметрыЭлемента);
		
	ИначеЕсли ТипЭлемента = "СпрБанки" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_СпрБанки(СтруктураСообщения[МассивКЗаполнению], Элемент);																					
		
	ИначеЕсли ТипЭлемента = "КВБанка" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_КВБанка(СтруктураСообщения[МассивКЗаполнению], Элемент);																					
		
		
	ИначеЕсли ТипЭлемента = "Параметры дополнительных условий" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ПараметрыДополнительныхУсловий(ПараметрыЭлемента, Элемент, СоответствиеТипов);
		СтруктураСообщения[МассивКЗаполнению].Добавить(ПараметрыЭлемента);
		
	ИначеЕсли ТипЭлемента = "Продавцы" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_Продавцы(ПараметрыЭлемента, Элемент);
		
		Если ПараметрыЭлемента.Свойство("id") Тогда 
			СтруктураСообщения[МассивКЗаполнению].Добавить(ПараметрыЭлемента);
		КонецЕсли;	
		
	ИначеЕсли ТипЭлемента = "Лимиты КВ банков и агентов" Тогда
		
		ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ЛимитыКВБанковИАгентов(СтруктураСообщения[МассивКЗаполнению], Элемент);
		
	Иначе
		
	КонецЕсли;
	
КонецФункции

//Отправка сообщения в очередь RabbitMQ
Функция ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения)
	Результат = ОбменДаннымиAMS.ОтправитьСообщениеСервер(ПараметрыСообщения);	
	Возврат Результат;	
КонецФункции

//Отправка сообщения в очередь RabbitMQ
Функция ПолучитьСообщенияИзRabbitMQ(ПараметрыСообщения)
	Результат = ОбменДаннымиAMS.ПолучитьСообщениеСервер(ПараметрыСообщения);	
	Возврат Результат;	
КонецФункции

#Область ПолучениеДанныхОбъектовВыгрузки

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_Продавцы(ПараметрыЭлемента, Элемент)
		
	РеквизитыЭлемента = Справочники.AMS_Продавцы.ДанныеПродавцаПоСсылке(Элемент.Ссылка);
	
	Если ЗначениеЗаполнено(РеквизитыЭлемента.ГУИД) Тогда
		
		ПараметрыЭлемента.Вставить("Id"							, XMLСтрока(РеквизитыЭлемента.ГУИД));
		ПараметрыЭлемента.Вставить("PartnerId"					, XMLСтрока(РеквизитыЭлемента.АгентГУИД));
		ПараметрыЭлемента.Вставить("PartnerType"				, XMLСтрока(Строка(РеквизитыЭлемента.ТипАгента)));
		ПараметрыЭлемента.Вставить("firstLevelFilialId		"	, XMLСтрока(РеквизитыЭлемента.ФилиалГУИД));
		ПараметрыЭлемента.Вставить("secondLevelFilialId		"	, "");
		ПараметрыЭлемента.Вставить("SaleChannelId"				, XMLСтрока(РеквизитыЭлемента.КаналПродажГУИД));
		ПараметрыЭлемента.Вставить("SaleSubchannelId"			, XMLСтрока(РеквизитыЭлемента.ПодканалПродажГУИД));
		ПараметрыЭлемента.Вставить("Disabled"					, XMLСтрока(РеквизитыЭлемента.Уволен));
		ПараметрыЭлемента.Вставить("SellerCategory"				, XMLСтрока(РеквизитыЭлемента.КатегорияАгента));
		
	КонецЕсли;

КонецПроцедуры

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_Системы(ПараметрыЭлемента, Элемент)
	
	//Сделать через переменную ГУИД, Код, Наименование, ПолноеНаименование, ПометкаУдаления,
	//| Отключен, СОРВКлючДляApi, СОРВРасчетВознаграждений, СОРВПолучениеПравилРасчета, СОРВАдминистрирование
	
	РеквизитыЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент.Ссылка, "ГУИД, Код, Наименование, ПолноеНаименование, ПометкаУдаления,
	| Отключен, СОРВКлючДляApi, СОРВРасчетВознаграждений, СОРВПолучениеПравилРасчета, СОРВАдминистрирование");
	
	ПараметрыЭлемента.Вставить("Id"							, РеквизитыЭлемента.ГУИД);
	ПараметрыЭлемента.Вставить("AdditionalId"				, РеквизитыЭлемента.Код);
	ПараметрыЭлемента.Вставить("Name"						, РеквизитыЭлемента.Наименование);
	ПараметрыЭлемента.Вставить("FullName"					, РеквизитыЭлемента.ПолноеНаименование);
	ПараметрыЭлемента.Вставить("Disabled"					, ?(РеквизитыЭлемента.ПометкаУдаления, Истина, РеквизитыЭлемента.Отключен));
	ПараметрыЭлемента.Вставить("ApiKey"						, РеквизитыЭлемента.СОРВКлючДляApi);
	ПараметрыЭлемента.Вставить("AllowCalculateRemuneration"	, РеквизитыЭлемента.СОРВРасчетВознаграждений);
	ПараметрыЭлемента.Вставить("AllowGetCalculationRules"	, РеквизитыЭлемента.СОРВПолучениеПравилРасчета);
	ПараметрыЭлемента.Вставить("AllowAdmin"					, РеквизитыЭлемента.СОРВАдминистрирование);
	
КонецПроцедуры

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_КВБанка(ПараметрыЭлемента, Элемент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_РазмерыКВБанков.Банк.ГУИД КАК bankId,
		|	AMS_РазмерыКВБанков.Риск.ГУИД КАК Risk,
		|	AMS_РазмерыКВБанков.РазмерКВ КАК Percentage,
		|   ""659f59af-787c-4e53-90aa-394593e95218"" КАК RemunerationKindId,
		|	AMS_РазмерыКВБанков.ДатаОкончанияДействия КАК DateEnd,
		|	AMS_РазмерыКВБанков.ДатаНачалаДействия КАК DateBegin,
		|	AMS_РазмерыКВБанков.ГУИД КАК ID
		|ИЗ
		|	РегистрСведений.AMS_РазмерыКВБанков КАК AMS_РазмерыКВБанков
		|ГДЕ
		|	AMS_РазмерыКВБанков.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Элемент.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПравилоКВ = ИнициализироватьСтруктуруПравила();
		ЗаполнитьЗначенияСвойств(ПравилоКВ, ВыборкаДетальныеЗаписи);
		
		ПравилоКВ.DateEnd = ?(ЗначениеЗаполнено(ПравилоКВ.DateEnd), ПравилоКВ.DateEnd, Неопределено);
		
		ПараметрыЭлемента.Добавить(ПравилоКВ);
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_СпрБанки(ПараметрыЭлемента, Элемент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_Банки.ГУИД КАК id,
		|	AMS_Банки.ИНН КАК inn,
		|	AMS_Банки.ИдентификаторКИАС КАК additionalAgentId
		|ИЗ
		|	Справочник.AMS_Банки КАК AMS_Банки
		|ГДЕ
		|	AMS_Банки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Элемент.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПравилоКВ = Новый Структура;
		ПравилоКВ.Вставить("id");
		ПравилоКВ.Вставить("inn");
		ПравилоКВ.Вставить("additionalAgentId");		
		
		ЗаполнитьЗначенияСвойств(ПравилоКВ, ВыборкаДетальныеЗаписи);
		ПараметрыЭлемента.Добавить(ПравилоКВ);
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_Банки(ПараметрыЭлемента, Элемент)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_СоответствиеАгентовИБанков.Банк.ИНН КАК inn,
		|	AMS_СоответствиеАгентовИБанков.Филиал.ГУИДФилиалаВЮПро КАК filialId,
		|	AMS_СоответствиеАгентовИБанков.Агент.ГУИД КАК agentID,
		|	AMS_СоответствиеАгентовИБанков.GUID КАК id
		|ИЗ
		|	РегистрСведений.AMS_СоответствиеАгентовИБанков КАК AMS_СоответствиеАгентовИБанков
		|ГДЕ
		|	AMS_СоответствиеАгентовИБанков.GUID = &GUID";
	
	Запрос.УстановитьПараметр("GUID", Элемент.GUID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ПараметрыЭлемента.Вставить("inn");
		ПараметрыЭлемента.Вставить("filialId");
		ПараметрыЭлемента.Вставить("agentID");
		ПараметрыЭлемента.Вставить("id");
		
		ЗаполнитьЗначенияСвойств(ПараметрыЭлемента, ВыборкаДетальныеЗаписи); 
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ДоговорАгента(ПараметрыЭлемента, Элемент)
	
	Источник = Элемент.Ссылка;
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "ЭтоДопСоглашение, АгентскийДоговор");	
	ДоговорАгента	  = ?(ДанныеДокумента.ЭтоДопСоглашение, ДанныеДокумента.АгентскийДоговор, Источник);
	ДанныеПоПродавцам = РегистрыСведений.AMS_ИнформацияОПродавце.ПолучитьДанныеПродавца(ТекущаяДатаСеанса(),, ДоговорАгента);
	
	Пока ДанныеПоПродавцам.Следующий() Цикл
		
		РеквизитыСправочникаПродавец = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПоПродавцам.Продавец, "ГУИД, ПометкаУдаления, Владелец");
		ДанныеВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыСправочникаПродавец.Владелец, "ГУИД, ТипКонтрагента,");
		Отключен = НЕ (ДанныеПоПродавцам.Действует И НЕ ДанныеПоПродавцам.Уволен И НЕ РеквизитыСправочникаПродавец.ПометкаУдаления);
		ГУИД_КаналПродаж = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПоПродавцам.КаналПродаж, "ГУИД");
		ГУИД_ПодКаналПродаж = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПоПродавцам.ПодканалПродаж, "ГУИД");
		ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПоПродавцам.ДокументОснование, "КатегорияКонтрагента, ГУИД");
		ДанныеФилиала = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПоПродавцам.Филиал, "УровеньФилиала, ГУИД, Родитель");
		
		Если ДанныеФилиала.УровеньФилиала = 1 Тогда
			ГУИД_ФилиалПервогоУровня = ДанныеФилиала.ГУИД;
			ГУИД_ФилиалВторогоУровня = "";
		Иначе
			ГУИД_ФилиалПервогоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеФилиала.Родитель, "ГУИД");
			ГУИД_ФилиалВторогоУровня = ДанныеФилиала.ГУИД;
		КонецЕсли;
		
		ДанныеПродавца = Новый Структура();

		ДанныеПродавца.Вставить("id"				 , РеквизитыСправочникаПродавец.ГУИД);
		ДанныеПродавца.Вставить("disabled"			 , Отключен);  
		ДанныеПродавца.Вставить("partnerId"			 , ДанныеВладельца.ГУИД);
		ДанныеПродавца.Вставить("agencyAgreement"	 , ДанныеОснования.ГУИД);
		ДанныеПродавца.Вставить("partnerType"		 , Строка(ДанныеВладельца.ТипКонтрагента));
		ДанныеПродавца.Вставить("sellerCategory"	 , Строка(ДанныеОснования.КатегорияКонтрагента));
		ДанныеПродавца.Вставить("firstLevelFilialId" , ГУИД_ФилиалПервогоУровня);
		ДанныеПродавца.Вставить("secondLevelFilialId", ГУИД_ФилиалВторогоУровня);
		ДанныеПродавца.Вставить("saleChannelId"		 , ГУИД_КаналПродаж);
		ДанныеПродавца.Вставить("saleSubchannelId"	 , ГУИД_ПодКаналПродаж);
		
		ПараметрыЭлемента.Добавить(ДанныеПродавца);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ВидыВознаграждений(ПараметрыЭлемента, Элемент)
	
	РеквизитыЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент.Ссылка, "ГУИД, Код, Наименование, ПометкаУдаления, Отключен, 
	| НаименованиеПолное, ЭтоГруппа");
	
	Если РеквизитыЭлемента.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	

	ПараметрыЭлемента.Вставить("Id"				, РеквизитыЭлемента.ГУИД);
	ПараметрыЭлемента.Вставить("AdditionalID"	, РеквизитыЭлемента.Код);
	ПараметрыЭлемента.Вставить("Name"			, РеквизитыЭлемента.Наименование);
	ПараметрыЭлемента.Вставить("FullName"		, РеквизитыЭлемента.НаименованиеПолное);
	ПараметрыЭлемента.Вставить("Disabled"		, ?(РеквизитыЭлемента.ПометкаУдаления, Истина, РеквизитыЭлемента.Отключен));
	
КонецПроцедуры

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_СтраховыеПродукты(ПараметрыЭлемента, Элемент)
	
	РеквизитыЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент.Ссылка, "ГУИД, Код, Наименование, ПометкаУдаления, Отключен, 
	| НаименованиеПолное, ТребуетсяДополнительныйАгент");

	ПараметрыЭлемента.Вставить("Id"						, РеквизитыЭлемента.ГУИД);
	ПараметрыЭлемента.Вставить("AdditionalID"			, РеквизитыЭлемента.Код);
	ПараметрыЭлемента.Вставить("Name"					, РеквизитыЭлемента.Наименование);
	ПараметрыЭлемента.Вставить("FullName"				, РеквизитыЭлемента.НаименованиеПолное);
	ПараметрыЭлемента.Вставить("Disabled"				, ?(РеквизитыЭлемента.ПометкаУдаления, Истина, РеквизитыЭлемента.Отключен));
	ПараметрыЭлемента.Вставить("AdditionalAgentRequired", РеквизитыЭлемента.ТребуетсяДополнительныйАгент);
	
КонецПроцедуры

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_НаборыДополнительныхУсловий(ПараметрыЭлемента, Элемент)
	
	НаборЗаписей = РегистрыСведений.AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.СтраховойПродукт.Установить(Элемент.СтраховойПродукт);
	НаборЗаписей.Отбор.ВидВознаграждения.Установить(Элемент.ВидВознаграждения);
	НаборЗаписей.Отбор.Параметр.Установить(Элемент.Параметр);
	
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		ДанныеНабора = Новый Структура();
		
		ВидВознаграждения_ГУИД	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидВознаграждения, "ГУИД");
		СтраховойПродукт_ГУИД	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СтраховойПродукт	, "ГУИД");
		Параметр_ГУИД			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Параметр			, "ГУИД");
		
		ДанныеНабора.Вставить("id"					, Запись.ГУИД);
		ДанныеНабора.Вставить("DateBegin"			, Запись.Период);
		ДанныеНабора.Вставить("RemunerationKindId"	, ВидВознаграждения_ГУИД);
		ДанныеНабора.Вставить("ProductId"			, СтраховойПродукт_ГУИД);
		ДанныеНабора.Вставить("Parameter"			, Параметр_ГУИД);
		ДанныеНабора.Вставить("Required"			, Запись.Обязательный);
		ДанныеНабора.Вставить("priority"			, Запись.Приоритет);		
		
		ПараметрыЭлемента.Добавить(ДанныеНабора);
		
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ОграниченияВознагражденийПоПродукту(ПараметрыЭлемента, Элемент)
	
	НаборЗаписей = РегистрыСведений.AMS_ОграниченияВознагражденийПоПродукту.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.СтраховойПродукт.Установить(Элемент.СтраховойПродукт);
	НаборЗаписей.Отбор.ВидВознаграждения.Установить(Элемент.ВидВознаграждения);
	НаборЗаписей.Отбор.СтраховойРиск.Установить(Элемент.СтраховойРиск);
	
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		ДанныеНабора = Новый Структура();
		
		ВидВознаграждения_ГУИД	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидВознаграждения, "ГУИД");
		СтраховойПродукт_ГУИД	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СтраховойПродукт	, "ГУИД");
		СтраховойРиск_ГУИД		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СтраховойРиск	, "ГУИД");
		
		
		ДанныеНабора.Вставить("Id"					 , Запись.ГУИД);
		ДанныеНабора.Вставить("DateBegin"			 , Запись.Период);
		ДанныеНабора.Вставить("ProductId"			 , СтраховойПродукт_ГУИД);
		ДанныеНабора.Вставить("RemunerationKindId"	 , ВидВознаграждения_ГУИД);
		ДанныеНабора.Вставить("Risk"				 , СтраховойРиск_ГУИД);
		ДанныеНабора.Вставить("CalculationPercentage", Запись.МаксимальныПроцент);
		ДанныеНабора.Вставить("RemunerationAmount"	 , ?(Запись.МаксимальноеВознаграждение = 0, null, Запись.МаксимальноеВознаграждение));
		
		ПараметрыЭлемента.Добавить(ДанныеНабора);
		
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ПравилаРасчетаВознаграждений(МассивПравил, Элемент, ГУИДыВидовСравнения)
	
	Настройки = Новый Структура();	
	
	Если (ТипЗнч(Элемент.Регистратор) = Тип("ДокументСсылка.AMS_ИзменениеДополнительногоКВИндивидуальное")
		ИЛИ ТипЗнч(Элемент.Регистратор) = Тип("ДокументСсылка.AMS_ИзменениеДополнительногоКВОбщее"))
		И ЗначениеЗаполнено(Элемент.Регистратор.ГУИДЦССУ) Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	ЗапросИзмененияПравилКВ(Элемент, Настройки);
	СформироватьПакетПравил(МассивПравил, Настройки);

КонецПроцедуры

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ЛимитыКВБанковИАгентов(ПараметрыЭлемента, Элемент)
	
	НаборЗаписей = РегистрыСведений.AMS_ЛимитыКВБанковИАгентов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Идентификатор.Установить(Элемент.Идентификатор);
	
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		ДанныеНабора = Новый Структура();
		
		БанкГУИД				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Банк		, "ГУИД");
		АгентГУИД				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Агент	, "ГУИД");
		СтраховойРиск_ГУИД		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Риск		, "ГУИД");
		
		ДанныеНабора.Вставить("id"					, Число(Запись.Идентификатор));
		ДанныеНабора.Вставить("from"				, Формат(Запись.ДатаНачала, "ДФ=yyyy-MM-dd"));
		ДанныеНабора.Вставить("to"					, Формат(Запись.ДатаОкончания, "ДФ=yyyy-MM-dd"));
		ДанныеНабора.Вставить("bankId"	 			, БанкГУИД);
		ДанныеНабора.Вставить("agentId"				, АгентГУИД);
		ДанныеНабора.Вставить("riskId" 				, СтраховойРиск_ГУИД);
		ДанныеНабора.Вставить("maxKv"				, Запись.МаксимальноеКВ);
		
		ПараметрыЭлемента.Добавить(ДанныеНабора);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработкаПравил

Процедура СформироватьПакетПравил(МассивПравил, Настройки)

	Данные  = Настройки.ДанныеВыгрузки;
	
	Если Данные.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого Правило Из Данные Цикл
	
		ДополнитьПравилом(МассивПравил, Правило);
	
	КонецЦикла;
	
	
КонецПроцедуры	

Процедура ДополнитьПравилом(МассивПравил, Правило)
			
	СтраховойПродукт 	 = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойПродукт;
	КатегорияДоговора	 = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КатегорияДоговора;
	СтраховойРиск     	 = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойРиск;
	ТипАгента		  	 = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипАгента;
	ДополнительныйАгент  = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк;
	
	Если Правило.ЭтоКВБанка Тогда
		ГУИДПравила = Справочники.AMS_ВидыВознаграждений.КВБ.ГУИД;
	ИначеЕсли ТипЗнч(Правило.Регистратор) = Тип("ДокументСсылка.AMS_ИзменениеКВИндивидуальное") 
		ИЛИ ТипЗнч(Правило.Регистратор) = Тип("ДокументСсылка.AMS_ИзменениеКВОбщее") Тогда
		ГУИДПравила = Справочники.AMS_ВидыВознаграждений.БКВ.ГУИД;
	ИначеЕсли ТипЗнч(Правило.Регистратор) = Тип("ДокументСсылка.AMS_ИзменениеДополнительногоКВИндивидуальное") 
		ИЛИ ТипЗнч(Правило.Регистратор) = Тип("ДокументСсылка.AMS_ИзменениеДополнительногоКВОбщее") Тогда
		ГУИДПравила = Справочники.AMS_ВидыВознаграждений.ДКВ.ГУИД; 	
	КонецЕсли;	 
	
	СтруктураПравила = ИнициализироватьСтруктуруПравила();
	СтруктураПравила.ID 		= Правило.ГУИД;
	СтруктураПравила.DateBegin 	= Правило.Период;
	СтруктураПравила.DateEnd 	= ?(ЗначениеЗаполнено(Правило.ДатаОкончанияДействия), Правило.ДатаОкончанияДействия, null);
	СтруктураПравила.RemunerationKindId 	= ГУИДПравила;
	СтруктураПравила.ProductId 			= Правило.СтраховойПродукт;
	СтруктураПравила.Percentage 		= Правило.Процент;
	СтруктураПравила.PartnerId 			= Правило.Агент;
	СтруктураПравила.PartnerType 		= null;
	СтруктураПравила.SellerCategory 	= Правило.КатегорияПродавца;
	СтруктураПравила.SaleChannel 	 	= Правило.КаналПродаж;
	СтруктураПравила.SaleSubchannel 	= Правило.ПодканалПродаж;
	СтруктураПравила.FirstLevelFilial 	= Правило.Филиал;
	
	Для каждого Условие  Из Правило.КлючУсловий.НаборУсловий Цикл
		
		Если Условие.Параметр = СтраховойПродукт ИЛИ НЕ ЗначениеЗаполнено(Условие.Параметр) Тогда
			Продолжить;
		КонецЕсли;	
		
		Если Условие.Параметр = СтраховойРиск Тогда
			
			СтруктураПравила.Risk = ПолучитьЗначение(Условие, Условие.ОператорСравнения);;
			Продолжить;
			
		КонецЕсли;	
		
		Если Условие.Параметр = ТипАгента Тогда
			
			 СтруктураПравила.PartnerType = ПолучитьЗначение(Условие, Условие.ОператорСравнения);
			 Продолжить;

		КонецЕсли;	 
		
		Если Условие.Параметр = ДополнительныйАгент Тогда
			
			 СтруктураПравила.AdditionalAgent = ПолучитьЗначение(Условие, Условие.ОператорСравнения);
			 
			 // AGENTS-2863
			 Если НетБанкаПоИНН(СтруктураПравила.AdditionalAgent) Тогда
				 СтруктураПравила.AdditionalAgent = null;
			 КонецЕсли;
			 
			 //Продолжить;
			 // AGENTS-2863
			 
		КонецЕсли;
				
		СтруктураСтрокиУсловий = ИнициализироватьСтрокуУсловийКВ();	   	
		СтруктураСтрокиУсловий.Path = Условие.Параметр.ПутьКДанным;
		СтруктураСтрокиУсловий.dataTypeId = Условие.Параметр.ТипДанныхСОРВ.ГУИД;
		
		Если Условие.Параметр = КатегорияДоговора Тогда
			
			СтруктураСтрокиУсловий.Value = ПолучитьЗначение(Условие, Условие.ОператорСравнения);
			
		Иначе
			
			ТипЗначения = ТипЗнч(Условие.Значение);	
			
			Если ТипЗначения = Тип("ПеречислениеСсылка.Удалить_AMS_КатегорииТС")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.AMS_ВидТерриторииКонтрагента")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.AMS_ВидыСтраховыхПродуктов")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.AMS_КатегорииДоговораСтрахования")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.AMS_КатегорииПродавца")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.AMS_ПолФизическогоЛица")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.AMS_ТипыАгентовПоСпособуПродаж")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.AMS_ТипыКонтрагентов")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.AMS_ТипыСтраховыхПродуктовПоНС")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.Удалить_AMS_ЦелиИспользованияТС")
				ИЛИ ТипЗначения = Тип("ПеречислениеСсылка.Удалить_AMS_ФормыВыплат") Тогда
		
			    СтруктураСтрокиУсловий.Value = ПолучитьЗначение(Условие, Условие.ОператорСравнения);				
			ИначеЕсли ТипЗначения = Тип("СправочникСсылка.AMS_ЦелиИспользованияТС")
				ИЛИ ТипЗначения = Тип("СправочникСсылка.AMS_КатегорииТС")
				ИЛИ ТипЗначения = Тип("СправочникСсылка.AMS_ФормыВыплат") Тогда	
				
				СтруктураСтрокиУсловий.Value = ПолучитьЗначение(Условие, Условие.ОператорСравнения);	
				
			ИначеЕсли ТипЗначения = Тип("Булево") Тогда 	
				
				СтруктураСтрокиУсловий.Value = ПолучитьЗначение(Условие, Условие.ОператорСравнения);
				
			ИначеЕсли ТипЗначения = Тип("СправочникСсылка.AMS_ТерриторииСтрахования") Тогда 
				
				КодКладрБезПробела = Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Условие.Значение, "КодКЛАДР"), "ЧГ=0");
				СтруктураСтрокиУсловий.Value = XMLСтрока(Лев(КодКладрБезПробела,8));
				
			Иначе
				
				СтруктураСтрокиУсловий.Value = ПолучитьЗначение(Условие, Условие.ОператорСравнения);
				
			КонецЕсли;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Условие.ОператорСравнения) Тогда
			
			СтруктураСтрокиУсловий.ConditionKindId = Условие.ОператорСравнения.ГУИД;
			
		КонецЕсли;	
		
		СтруктураПравила.AdditionalConditions.Добавить(СтруктураСтрокиУсловий);
		
	КонецЦикла;
	МассивПравил.Добавить(СтруктураПравила);
	
КонецПроцедуры	

Функция ИнициализироватьСтрокуУсловийКВ()
	
	 Результат = Новый Структура;
	 Результат.Вставить("ConditionKindId", "9821d79b-0d62-4543-84cd-4a4da5430173");
	 Результат.Вставить("Value");
	 Результат.Вставить("Path");
	 Результат.Вставить("dataTypeId");
	 
	 Возврат Результат;
	
КонецФункции	

Функция ИнициализироватьСтруктуруПравила()
	
	 Результат = Новый Структура();
	 Результат.Вставить("ID");
	 Результат.Вставить("DateBegin");
	 Результат.Вставить("DateEnd");
	 Результат.Вставить("RemunerationKindId");
	 Результат.Вставить("ProductId");
	 Результат.Вставить("Comment", "");
	 Результат.Вставить("Percentage");
	 Результат.Вставить("Performance");
	 Результат.Вставить("PartnerId");
	 Результат.Вставить("PartnerType");
	 Результат.Вставить("SellerCategory");
	 Результат.Вставить("FirstLevelFilial");
	 Результат.Вставить("SaleChannel");
	 Результат.Вставить("SaleSubchannel");
	 Результат.Вставить("AdditionalAgent");
	 Результат.Вставить("bankId");
	 Результат.Вставить("Risk");
	 Результат.Вставить("AdditionalConditions", Новый Массив);
	 
	 Возврат Результат;	 
	
КонецФункции	

Процедура ЗапросИзмененияПравилКВ(Элемент, Настройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Агент.ГУИД КАК Агент,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Филиал.ГУИДФилиалаВЮПро КАК Филиал,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.СтраховойПродукт.ГУИД КАК СтраховойПродукт,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.КлючУсловий КАК КлючУсловий,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Процент КАК Процент,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Отменен КАК Отменен,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.ГУИД КАК ГУИД,
		|	"""" КАК КаналПродаж,
		|	"""" КАК ПодканалПродаж,
		|	"""" КАК КатегорияПродавца,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Период КАК Период,
		|	ВЫБОР
		|		КОГДА AMS_СоответствиеАгентовИБанков.Банк ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоКВБанка,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.AMS_ИндивидуальныеПравилаРасчетаКВ КАК AMS_ИндивидуальныеПравилаРасчетаКВ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_СоответствиеАгентовИБанков КАК AMS_СоответствиеАгентовИБанков
		|		ПО AMS_ИндивидуальныеПравилаРасчетаКВ.Агент = AMS_СоответствиеАгентовИБанков.Агент
		|ГДЕ
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Регистратор = &Регистратор
		|	И НЕ AMS_ИндивидуальныеПравилаРасчетаКВ.СтраховойПродукт.Наименование = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	AMS_ОбщиеПравилаРасчетаКВ.Филиал.ГУИДФилиалаВЮПро,
		|	AMS_ОбщиеПравилаРасчетаКВ.СтраховойПродукт.ГУИД,
		|	AMS_ОбщиеПравилаРасчетаКВ.КлючУсловий,
		|	AMS_ОбщиеПравилаРасчетаКВ.Процент,
		|	AMS_ОбщиеПравилаРасчетаКВ.Отменен,
		|	AMS_ОбщиеПравилаРасчетаКВ.ДатаОкончанияДействия,
		|	AMS_ОбщиеПравилаРасчетаКВ.ГУИД,
		|	AMS_ОбщиеПравилаРасчетаКВ.КаналПродаж.ГУИД,
		|	AMS_ОбщиеПравилаРасчетаКВ.ПодканалПродаж.ГУИД,
		|	AMS_ОбщиеПравилаРасчетаКВ.КатегорияПродавца,
		|	AMS_ОбщиеПравилаРасчетаКВ.Период,
		|	ЛОЖЬ,
		|	AMS_ОбщиеПравилаРасчетаКВ.Регистратор
		|ИЗ
		|	РегистрСведений.AMS_ОбщиеПравилаРасчетаКВ КАК AMS_ОбщиеПравилаРасчетаКВ
		|ГДЕ
		|	AMS_ОбщиеПравилаРасчетаКВ.Регистратор = &Регистратор
		|	И НЕ AMS_ОбщиеПравилаРасчетаКВ.СтраховойПродукт.Наименование = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Агент.ГУИД,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Филиал.ГУИДФилиалаВЮПро,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.СтраховойПродукт.ГУИД,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.КлючУсловий,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Процент,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Отменен,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ДатаОкончанияДействия,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ГУИД,
		|	"""",
		|	"""",
		|	"""",
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ДатаНачалаДействия,
		|	ВЫБОР
		|		КОГДА AMS_СоответствиеАгентовИБанков.Банк ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Регистратор
		|ИЗ
		|	РегистрСведений.AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ КАК AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_СоответствиеАгентовИБанков КАК AMS_СоответствиеАгентовИБанков
		|		ПО AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Агент = AMS_СоответствиеАгентовИБанков.Агент
		|ГДЕ
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Регистратор = &Регистратор
		|	И НЕ AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.СтраховойПродукт.Наименование = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Филиал.ГУИДФилиалаВЮПро,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.СтраховойПродукт.ГУИД,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.КлючУсловий,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Процент,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Отменен,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ДатаОкончанияДействия,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ГУИД,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.КаналПродаж.ГУИД,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ПодканалПродаж.ГУИД,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.КатегорияПродавца,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ДатаНачалаДействия,
		|	ЛОЖЬ,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Регистратор
		|ИЗ
		|	РегистрСведений.AMS_ОбщиеПравилаРасчетаДополнительногоКВ КАК AMS_ОбщиеПравилаРасчетаДополнительногоКВ
		|ГДЕ
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Регистратор = &Регистратор
		|	И НЕ AMS_ОбщиеПравилаРасчетаДополнительногоКВ.СтраховойПродукт.Наименование = """"";
	
	Запрос.УстановитьПараметр("Регистратор", Элемент.Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Настройки.Вставить("ДанныеВыгрузки", РезультатЗапроса);

КонецПроцедуры	

Функция НетБанкаПоИНН(ИНН)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_Банки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AMS_Банки КАК AMS_Банки
		|ГДЕ
		|	AMS_Банки.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область МотивационныеПрограммы

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ИзменениеУсловийМотивационнойПрограммы(МассивСообщений, 
																					Элемент, ГУИДыВидовСравнения);
																					
	ПрограммаОбъект = Элемент.Ссылка;																					
	Данные = ЗапросПравилИзмененияМП(ПрограммаОбъект);																				
	СформироватьПакетПравилМП(МассивСообщений, Данные);																				

КонецПроцедуры

Процедура СформироватьПакетПравилМП(МассивСообщений, Данные)
	
	ПМИсключение = Константы.AMS_МТСистемаЛояльности.Получить();
	
	Для каждого Правило Из Данные Цикл
		
		Если ПМИсключение = Правило.МотивационнаяПрограмма Тогда
			
			Продолжить;
			
		КонецЕсли;	
	
		ДополнитьПравиломМП(МассивСообщений, Правило);
	
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ДополнитьПравиломМП(МассивПравил, Правило)
	
	СтруктураПравила = ИнициализироватьСтруктуруПравилаМП();
	СтруктураПравила.id                 = AMS_ИнтеграцияМАМССервер.ПобитовоеXORСтрок(Правило.ИдентификаторПравила, Правило.Агент);
	СтруктураПравила.programGuid		= Правило.МотивационнаяПрограмма.ГУИД;
	СтруктураПравила.additionalId       = Правило.ИдентификаторПравила;
	СтруктураПравила.name		        = Правило.МотивационнаяПрограмма.Наименование;
	СтруктураПравила.fullName 			= Правило.МотивационнаяПрограмма.Наименование;
	СтруктураПравила.startDate 			= Правило.ДатаНачалаДействия;
	СтруктураПравила.percent 			= Правило.Процент;
	СтруктураПравила.disabled 			= Правило.Отменен;
	СтруктураПравила.partner 			= Правило.Агент;
	
	Если ЗначениеЗаполнено(Правило.ДатаОкончанияДействия) Тогда
		СтруктураПравила.endDate = КонецДня(Правило.ДатаОкончанияДействия);
	ИначеЕсли ЗначениеЗаполнено(Правило.ДатаИсключения) Тогда
		СтруктураПравила.endDate = КонецДня(Правило.ДатаИсключения);
	Иначе
		СтруктураПравила.endDate = null;
	КонецЕсли;
	
	Если Правило.КлючУсловий.НаборУсловий.Количество() > 0 Тогда
		
		ЗаполнитьМППоУсловиям(СтруктураПравила, Правило.КлючУсловий.НаборУсловий);
		
	КонецЕсли;	
	
	Если Правило.КлючУсловий.НаборКлючей.Количество() > 0 Тогда
		
		Для каждого Ключ Из Правило.КлючУсловий.НаборКлючей Цикл
		
			КлючУсловий = Ключ.КлючУсловий;
			ОсновнойКлюч   = Ключ.ОсновнойКлюч;
			
			Если ОсновнойКлюч Тогда
				
				ЗаполнитьМППоУсловиям(СтруктураПравила, КлючУсловий.НаборУсловий);
				
			Иначе
				
				ЗаполнитьКраткоеУсловиеМП(СтруктураПравила, КлючУсловий.НаборУсловий, КлючУсловий.ИмяПеременной);
				
			КонецЕсли;	
		
		КонецЦикла;
		
	КонецЕсли;	
	
	МассивПравил.Добавить(СтруктураПравила);
	
КонецПроцедуры	

Процедура ЗаполнитьМППоУсловиям(СтруктураПравила, НаборУсловий) 

	Для каждого Условие  Из НаборУсловий Цикл
		
		// delete
		Если Условие.Параметр = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность Тогда
			
			Продолжить;
			
		КонецЕсли;	
		// delete end		
		
		СтруктураСтрокиУсловий = ИнициализироватьСтрокуУсловийКВ();
		СтруктураСтрокиУсловий.Value = ПолучитьЗначение(Условие, Условие.ОператорСравнения);
		
		СтруктураСтрокиУсловий.Path = Условие.Параметр.ПутьКДанным;
		СтруктураСтрокиУсловий.dataTypeId = AMS_ИнтеграцияМАМССервер.СериализоватьЗначение(Условие.Параметр.ТипДанныхСОРВ);
		СтруктураСтрокиУсловий.ConditionKindId = AMS_ИнтеграцияМАМССервер.СериализоватьЗначение(Условие.ОператорСравнения);
		
		СтруктураПравила.AdditionalConditions.Добавить(СтруктураСтрокиУсловий);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКраткоеУсловиеМП(СтруктураПравила, НаборУсловий, Переменная) 

	Для каждого Условие  Из НаборУсловий Цикл
		
		Если Условие.Параметр <> ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		// delete
		Если Условие.Параметр = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность Тогда
			
			Продолжить;
			
		КонецЕсли;	
		// delete end
		
		СтруктураСтрокиУсловий = ИнициализироватьСтрокуУсловийКВ();
	   	СтруктураСтрокиУсловий.Value = ПолучитьЗначение(Условие, Условие.ОператорСравнения);
		СтруктураСтрокиУсловий.Path = Переменная;
		СтруктураСтрокиУсловий.dataTypeId 		= AMS_ИнтеграцияМАМССервер.СериализоватьЗначение(Условие.Параметр.ТипДанныхСОРВ);
		СтруктураСтрокиУсловий.ConditionKindId  = AMS_ИнтеграцияМАМССервер.СериализоватьЗначение(Условие.ОператорСравнения);
		
		СтруктураПравила.AdditionalConditions.Добавить(СтруктураСтрокиУсловий);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИнициализироватьСтруктуруПравилаМП()
	
	 Результат = Новый Структура();
	 Результат.Вставить("id");
	 Результат.Вставить("programGuid");
	 Результат.Вставить("additionalId");
	 Результат.Вставить("name");
	 Результат.Вставить("disabled");
	 Результат.Вставить("fullName");
	 Результат.Вставить("startDate");
	 Результат.Вставить("endDate");
	 Результат.Вставить("partner");
	 Результат.Вставить("filial");
	 Результат.Вставить("percent");
	 Результат.Вставить("SaleChannel");
	 Результат.Вставить("SaleSubchannel");

	 Результат.Вставить("AdditionalConditions", Новый Массив);
	 
	 Возврат Результат;	 
	
КонецФункции

Функция ЗапросПравилИзмененияМП(ПрограммаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.МотивационнаяПрограмма КАК МотивационнаяПрограмма,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.КлючУсловий КАК КлючУсловий,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.Агент.ГУИД КАК Агент,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.Процент КАК Процент,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.Отменен КАК Отменен,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.ГУИД КАК ИдентификаторПравила,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.АгентИсключен КАК АгентИсключен,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.ДатаИсключения КАК ДатаИсключения
		|ИЗ
		|	РегистрСведений.AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам КАК AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам
		|ГДЕ
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ПрограммаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти
																				
Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции	

Процедура ПолучитьНеобходимыеРеквизитыЭлемента_AMS_ПараметрыДополнительныхУсловий(ПараметрыЭлемента, Элемент, СоответствиеТипов)
	
	РеквизитыЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент.Ссылка, "ГУИД, Наименование, ПометкаУдаления, ПутьКДанным, ТипЗначения");
	ТипПараметра = ОпределитьТипПараметра(РеквизитыЭлемента.ТипЗначения);
	
	ПараметрыЭлемента.Вставить("id"				, РеквизитыЭлемента.ГУИД);
	ПараметрыЭлемента.Вставить("AdditionalID"	, "");
	ПараметрыЭлемента.Вставить("Name"			, РеквизитыЭлемента.Наименование);
	ПараметрыЭлемента.Вставить("FullName"		, РеквизитыЭлемента.Наименование);
	ПараметрыЭлемента.Вставить("Disabled"		, РеквизитыЭлемента.ПометкаУдаления);
	ПараметрыЭлемента.Вставить("Path"			, РеквизитыЭлемента.ПутьКДанным);
	ПараметрыЭлемента.Вставить("DataTypeId"		, СоответствиеТипов[ТипПараметра]);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОтправкаJSON

Функция СформироватьТекстСообщения(СтруктураСообщения)
	
	Результат = ОбменДаннымиAMS.СформироватьСтрокуJSON(СтруктураСообщения, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	Результат = СтрЗаменить(Результат, """""", "null");
	Возврат Результат;

КонецФункции

Функция ОтправитьСообщениеВСОРВ(ТекстСообщения, Узел)
	
	Результат = Новый Структура("Успех, Сообщение", Ложь, ТекстСообщения);
	
	ПараметрыПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Узел, "Адрес, Токен, Запрос, ТипЗапроса");

	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес,,,,,30, ЗащищенноеСоединение);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	
	СтрокаЗапроса = ПараметрыПодключения.Запрос + "?api-key=" + ПараметрыПодключения.Токен;
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТекстСообщения);
	
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод(ПараметрыПодключения.ТипЗапроса, Запрос);
	Исключение
		
		ЗаписьЖурналаРегистрации("СОРВ.ОбменДанными", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		ЗаписьЖурналаРегистрации("СОРВ.ОбменДанными.Сообщения", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		
		Возврат Результат;
		
	КонецПопытки;
	
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОчисткаСпискаИзменений

Процедура ОчиститьСписокИзменений(Узел)
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
	
КонецПроцедуры

Функция ПолучитьЗначение(Значение, ВидСравнения)
	
	Если ВидСравнения <> Справочники.AMS_ВидыСравнения.ВСписке
		И ВидСравнения <> Справочники.AMS_ВидыСравнения.НеВСписке Тогда
		
		Возврат AMS_ИнтеграцияМАМССервер.СериализоватьЗначение(Значение.Значение);
		
	КонецЕсли;
	
	СписокЗначений = Значение.ЗначениеПроизвольногоТипа.Получить();
	Результат = "";
	
	Для каждого СтрокаСписка Из СписокЗначений Цикл
	
		Результат = Результат + AMS_ИнтеграцияМАМССервер.СериализоватьЗначение(СтрокаСписка.Значение) + ";";
	
	КонецЦикла;
	
	Результат = Сред(Результат, 1, СтрДлина(Результат) - 1);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

