Функция НомерВерсии() Экспорт
	
	Возврат "1.0.0.1"; 
	
КонецФункции

Функция СведенияОВнешнейОбработке() Экспорт
	
	Вид 			= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	Использование 	= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Назначение 		= "Подсистема.AMS_Агенты";
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.БезопасныйРежим 	= Истина;
	ПараметрыРегистрации.Версия 			= НомерВерсии();
	ПараметрыРегистрации.Вид 				= Вид;
	ПараметрыРегистрации.Информация 		= ЭтотОбъект.Метаданные().Комментарий;
	ПараметрыРегистрации.Наименование 		= ЭтотОбъект.Метаданные().Синоним;
	
	ПараметрыРегистрации.Назначение.Добавить(Назначение);
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Идентификатор 			= "ГрупповаяОбработкаПродавцов";
	Команда.Использование 			= Использование;
	Команда.ПоказыватьОповещение 	= Истина;
	Команда.Представление 			= ЭтотОбъект.Метаданные().Синоним;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

