#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ВидимостьЭлементовФормы();
	ВидимостьФилиаловПоПользователю();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

//
Процедура ВидимостьЭлементовФормы()

	Если Пользователи.РолиДоступны("ЧтениеГуидОбъекта", ПользователиКлиентСервер.ТекущийПользователь(), Ложь) Тогда
		Элементы.ГУИД.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьФилиаловПоПользователю()
	
	ФилиалПользователя = ПользователиКлиентСервер.ТекущийПользователь().AMS_Филиал.ГУИД;
	
	Если НЕ ФилиалПользователя = "" Тогда
		
		ВидРавно = ВидСравненияКомпоновкиДанных.Равно;
		Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ГУИД", ФилиалПользователя, ВидРавно, Неопределено, Истина, Режим);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


