#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоискНайтиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНовыйВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокНовый.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;				
	
	ДокументСсылка = СсылкаНаДокументПоГУИД(ТекущиеДанные.ГУИД);	
	ПоказатьЗначение(, ДокументСсылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Согласовать(Команда)
	
	ПодготовитьДанныеСогласования();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРеестры(Команда)
	
	ДанныеВФайл = ПодготовитьДанныеКВыгрузке(Команда.Действие);
	СохранитьФайл(ДанныеВФайл, "Реестры");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВознаграждения(Команда)
	
	ДанныеВФайл = ПодготовитьДанныеКВыгрузке(Команда.Действие);
	СохранитьФайл(ДанныеВФайл, "Вознаграждения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискУстановитьМетку(Команда)
	
	Для Каждого Строка Из СписокНовый Цикл
		
		Строка.Метка = Истина;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПоискУбратьМетку(Команда)
	
	Для Каждого Строка Из СписокНовый Цикл
		
		Строка.Метка = Ложь;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПоискНайти(Команда)
	ПоискНайтиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	ПоискАгент = Неопределено;
	ПоискФилиал = Неопределено;
	ПоискСтатус = Неопределено;
	ПоискПериод = Неопределено;
	ПоискДоговор = Неопределено;
	ПоискДоговоры = Неопределено;
	
	ПоискНайтиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОткрыть(Команда)
	
	ТекущиеДанные = Элементы.СписокНовый.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;				
	
	ДокументСсылка = СсылкаНаДокументПоГУИД(ТекущиеДанные.ГУИД);	
	ПоказатьЗначение(, ДокументСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодготовитьДанныеКВыгрузке(СоставДанных)

	Результат = Новый ТабличныйДокумент;
	ПараметрыОтбора = Новый Структура("Метка", Истина);
	МассивГУИД = СписокНовый.Выгрузить(ПараметрыОтбора, "ГУИД").ВыгрузитьКолонку("ГУИД");
	
	Если СоставДанных = "ВыгрузитьРеестры" Тогда
		Результат = AMS_ВыгрузкаРеестров.ТабличныйДокументРеестра(МассивГУИД);
	ИначеЕсли СоставДанных = "ВыгрузитьВознаграждения" Тогда
		Результат = AMS_ВыгрузкаРеестров.ТабличныйДокументВознагражденияРеестра(МассивГУИД);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПоискНайтиНаСервере()
	
	ПараметрыСписка = Документы.AMS_РеестрПоПремиальнымПрограммам.ИнициализироватьПараметрыСписка();
	ПараметрыСписка.ПоискАгент = ПоискАгент;
	ПараметрыСписка.ПоискФилиал = ПоискФилиал;
	ПараметрыСписка.ПоискСтатус = ПоискСтатус;
	ПараметрыСписка.ПоискПериод = ПоискПериод;
	ПараметрыСписка.ПоискДоговор = ПоискДоговор;
	ПараметрыСписка.ПоискДоговоры = ПоискДоговоры;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.AMS_РеестрПоПремиальнымПрограммам.ТекстЗапросаСписокОтбора(ПараметрыСписка);
	
	Запрос.УстановитьПараметр("Агент", 				ПоискАгент);
	Запрос.УстановитьПараметр("Филиал", 			ПоискФилиал);
	Запрос.УстановитьПараметр("Статус", 			ПоискСтатус);
	Запрос.УстановитьПараметр("ПериодНачала", 		ПоискПериод.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончания", 	ПоискПериод.ДатаОкончания);
	Запрос.УстановитьПараметр("ДоговорСтрахования", ПоискДоговор);
	Запрос.УстановитьПараметр("ДоговорыСтрахования", ПоискДоговоры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокНовый.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СсылкаНаДокументПоГУИД(ГУИД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_РеестрПоПремиальнымПрограммам.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.AMS_РеестрПоПремиальнымПрограммам КАК AMS_РеестрПоПремиальнымПрограммам
		|ГДЕ
		|	AMS_РеестрПоПремиальнымПрограммам.ГУИД = &ГУИД";
	
	Запрос.УстановитьПараметр("ГУИД", ГУИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура СохранитьФайл(ТабличныйДокумент, ИмяДокумента)
	
	ИмяФайла = "";
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяДокумента + " " + Формат(ТекущаяДата(), "ДФ='дд ММММ гггг ЧЧ мм'");
	Фильтр = НСтр("ru = 'Документ Excel'; en = 'Excel'")
					+ "(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
	Иначе
		Предупреждение(НСтр("ru = 'Файл не выбран!'; en = 'File not selected!'"));
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеСогласования()
	
	МассивОтмеченныхСтрок = СтрокиСМеткой();
	
	ИзменитьСтатусДокумента(МассивОтмеченныхСтрок);
	
	ПоискНайтиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусДокумента(МассивГУИД)

	Запрос = Новый Запрос;
	Запрос.Текст = AMS_ВыгрузкаРеестров.СсылкаНаДокументПоГУИД();
	Запрос.УстановитьПараметр("ГУИД", МассивГУИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект			 = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Статус	 = Перечисления.AMS_СтатусыРеестра.Согласован;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СтрокиСМеткой()
	
	Результат = Новый Массив;
	
	ПараметрыОтбора = Новый Структура("Метка", Истина);
	Результат = СписокНовый.Выгрузить(ПараметрыОтбора, "ГУИД").ВыгрузитьКолонку("ГУИД");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

