Функция ПолучитьГУИД(Значение) Экспорт
	
	Результат = "";
	
	Если Значение = Перечисления.AMS_ТипыКонтрагентов.ИП Тогда
		
		Результат = "7e200308-9f9b-4c1d-ad9c-c805e9865c19";
		
	ИначеЕсли Значение = Перечисления.AMS_ТипыКонтрагентов.ФизическоеЛицо Тогда
		
		Результат = "d6dd23ff-b4d4-405b-ba55-06c0168fdde7";
		
	ИначеЕсли Значение = Перечисления.AMS_ТипыКонтрагентов.ЮридическоеЛицо Тогда
		
		Результат = "5467e5aa-d1e0-4452-8ad3-7ed313788cee";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	