#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	Идентификаторы								 = ИдентификаторыПредопределенныхДанныхГУИД();
	ИдентификаторыДополнительноеНаименование	 = ИдентификаторыПредопределенныхДанныхДополнительноеНаименование();
	ИдентификаторыПериодОхлаждения				 = ИдентификаторыПредопределенныхДанныхПериодОхлаждения();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		ВидыСтраховыхПродуктовОбъект							 = КлючЗначение.Ключ.ПолучитьОбъект();
		ВидыСтраховыхПродуктовОбъект.ГУИД						 = КлючЗначение.Значение;
		ВидыСтраховыхПродуктовОбъект.ДополнительноеНаименование	 = ИдентификаторыДополнительноеНаименование.Получить(КлючЗначение.Ключ);
		ВидыСтраховыхПродуктовОбъект.ПериодОхлаждения			 = ИдентификаторыПериодОхлаждения.Получить(КлючЗначение.Ключ);
		ВидыСтраховыхПродуктовОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыПредопределенныхДанныхДополнительноеНаименование()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ОСАГО,						 "ОСАГО");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.КАСКО,						 "Классическое КАСКО");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.МиниКАСКО,					 "Мини-продукты КАСКО");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ОСГОП,						 "ОСГОП");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ОСОПО,						 "ОСОПО");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Ответственность,				 "Страхование ответственности");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.НС,							 "Страхование от несчастных случаев");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ПредпринимательскиеРиски,		 "Страхование предпринимательских рисков");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ДГО,							 "Добровольное страхование гражданской ответственности");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ЗКАСКО,						 "ЗКАСКО");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Грузы,						 "Страхование грузов");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.КУГИ,							 "Страхование нежилого фонда");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Прочее,						 "Произвольный");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ЗК,							 "Зеленая карта");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ЛичноеCтрахование,			 "Личное страхование");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Имущество,					 "Страхование имущества");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Ипотека,						 "Ипотека");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ВЗР,							 "ВЗР");
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ОСАГО,						 "ba58a0ca-a1a2-49b0-81e9-c51f8f8c52f8");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.КАСКО,						 "c980186c-42e1-4c27-83bd-4d42673ec566");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.МиниКАСКО,					 "4e9f5337-f3e0-4d0d-b439-96bd9d21d835");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ОСГОП,						 "e2c7901a-041f-45ad-a7ed-a92a4850461b");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ОСОПО,						 "54dcfb39-9a44-4931-ae25-65b48787a203");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Ответственность,				 "62b1842d-91d3-4918-a84e-00a79f59d88d");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.НС,							 "f3088a74-19cb-4d58-83f0-cb3b37a73787");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ПредпринимательскиеРиски,		 "a2769f9c-c746-45d9-9c78-8bfa688acc10");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ДГО,							 "cfff2fbf-7f92-4c15-a696-66db6a639c87");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ЗКАСКО,						 "80adfb0e-f5ad-441c-a816-18d2135c253b");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Грузы,						 "fb72cbc7-ef03-45ae-8ea1-d8b9a998a66a");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.КУГИ,							 "8563b909-2bc0-48ed-9937-1a87700ec7a9");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Прочее,						 "0d627fae-cb98-407e-9a3d-d5cb1f5eb4b3");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ЗК,							 "0eafe768-da62-4a8c-8ee7-87609736c0c4");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ЛичноеCтрахование,			 "3c68a376-ea64-4495-b1ad-a75e238dee26");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Имущество,					 "613b8003-133f-4a89-bb8b-b57d4f83013c");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Ипотека,						 "2cbc07e8-1b26-4338-8b0d-4ee781e294c4");
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ВЗР,							 "f23743c3-30ff-4ca2-8793-70aabb7cdbb3");
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхПериодОхлаждения()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ОСАГО,						 0);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.КАСКО,						 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.МиниКАСКО,					 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ОСГОП,						 0);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ОСОПО,						 0);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Ответственность,				 0);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.НС,							 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ПредпринимательскиеРиски,		 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ДГО,							 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ЗКАСКО,						 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Грузы,						 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.КУГИ,							 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Прочее,						 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ЗК,							 0);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ЛичноеCтрахование,			 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Имущество,					 14);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.Ипотека,						 30);
	Результат.Вставить(Справочники.AMS_ВидыСтраховыхПродуктов.ВЗР,							 14);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт

	Результат = ПолучитьСтруктуруСообщения();
	
	ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);	 	 
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	//Данные = СтрЗаменить(Данные, """""", "null");
	 
	Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)
	
	Реквизиты = "ГУИД, Наименование, ПериодОхлаждения";
	ДанныеКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты);	
	
	Результат.guid					 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ГУИД);
	Результат.name 					 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Наименование);
	Результат.coolingPeriod 		 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ПериодОхлаждения);
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "ProductType");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	Результат.Вставить("coolingPeriod");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#КонецЕсли