#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеПоАгентскомуДоговору(АгентскийДоговор, ДатаСреза = Неопределено) Экспорт	
	ДанныеПоАгентскомуДоговору = Новый Структура;
		
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AMS_АгентскиеДоговоры.Организация КАК Организация,
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
	|	AMS_АгентскиеДоговоры.Пролонгация КАК Пролонгация,
	|	AMS_АгентскиеДоговоры.НеТиповойДоговор КАК НеТиповойДоговор,
	|	AMS_АгентскиеДоговоры.УдержаниеКомиссии КАК УдержаниеКомиссии,
	|	AMS_АгентскиеДоговоры.ПериодичностьВыплатыКВ КАК ПериодичностьВыплатыКВ,
	|	AMS_АгентскиеДоговоры.КатегорияАгента КАК КатегорияАгента,
	|	AMS_АгентскиеДоговоры.УдерживаетПВ КАК УдерживаетПВ,
	|	AMS_АгентскиеДоговоры.ПВПоДопCоглашениям КАК ПВПоДопCоглашениям,
	|	AMS_АгентскиеДоговоры.ПодписантСоСтороныАгента КАК ПодписантСоСтороныАгента,
	|	AMS_АгентскиеДоговоры.ДолжностьПодписантаАгента КАК ДолжностьПодписантаАгента,
	|	AMS_АгентскиеДоговоры.ДокументПодписанта КАК ДокументПодписанта,
	|	AMS_АгентскиеДоговоры.ФедеральныйАгентскийДоговор КАК ФедеральныйАгентскийДоговор,
	|	AMS_АгентскиеДоговоры.СрокаОплатыОА КАК СрокаОплатыОА,
	|	AMS_АгентскиеДоговоры.КоличествоДнейОборотаБСООСАГО КАК КоличествоДнейОборотаБСООСАГО,
	|	AMS_АгентскиеДоговоры.КоличествоДнейОборотаБСОПрочие КАК КоличествоДнейОборотаБСОПрочие,
	|	AMS_АгентскиеДоговоры.МегаБрокер КАК МегаБрокер,
	|	AMS_АгентскиеДоговоры.КатегорияАгентаДляKPI КАК КатегорияАгентаДляKPI
	|ИЗ
	|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|ГДЕ
	|	AMS_АгентскиеДоговоры.Ссылка = &АгентскийДоговор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.Агент КАК Агент,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.АгентскийДоговор КАК АгентскийДоговор,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.Организация КАК Организация,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.Филиал КАК Филиал,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.КатегорияКонтрагента КАК КатегорияАгента,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.ТипАгентаПоСпособуПродаж КАК ТипАгента,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.ПериодичностьВыплатыКВ КАК ПериодичностьВыплатыКВ,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.МегаБрокер КАК МегаБрокер,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.НеТиповойДоговор КАК НеТиповойДоговор,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.ФедеральныйАгентскийДоговор КАК ФедеральныйАгентскийДоговор,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.УдержаниеКомиссии КАК УдержаниеКомиссии,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.УдерживаетПВ КАК УдерживаетПВ,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.ПВПоДопсоглашениям КАК ПВПоДопCоглашениям,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.СрокОплатыОА КАК СрокОплатыОА,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.КоличествоДнейОборотаБСООСАГО КАК КоличествоДнейОборотаБСООСАГО,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.КоличествоДнейОборотаБСОПрочие КАК КоличествоДнейОборотаБСОПрочие,
	|	AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних.ДатаПодписания КАК ДатаПодписания
	|ИЗ
	|	РегистрСведений.AMS_УсловияДоговораАгента.СрезПоследних(&ДатаСреза, АгентскийДоговор = &АгентскийДоговор) КАК AMS_ДанныеДоговораАгентаИзЦССУСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("АгентскийДоговор", АгентскийДоговор);
	
	ПакетДанных = Запрос.ВыполнитьПакет();
	
	ДанныеПоАгентскомуСпр = ПакетДанных[0].Выгрузить();
	ДанныеПоАгентскомуРег = ПакетДанных[1].Выгрузить();
	
	Если ДанныеПоАгентскомуРег.Количество() > 0 Тогда
		ДанныеПоАгентскомуДоговору = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеПоАгентскомуРег[0]);
	Иначе
		ДанныеПоАгентскомуДоговору = ОбщегоНазначения.ДанныеПоАгентскомуСпр(ДанныеПоАгентскомуРег[0]);
	КонецЕсли;
	
	Возврат ДанныеПоАгентскомуДоговору;	
	
КонецФункции

#КонецОбласти

#КонецЕсли