#Область ПрограммныйИнтерфейс

Функция ОперативныйРасчетВознаграждения(Узел, СтруктураСообщения) Экспорт 
	
	Запрос = "/sorv/remuneration/calculate";
	ТипЗапроса = "POST";
	
	Результат = СформироватьИОтправитьСОРВ(Узел, СтруктураСообщения, Запрос, ТипЗапроса);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРасчетыВознаграждений(Узел, СтруктураСообщения) Экспорт 
	
	Запрос = "/sorv/remuneration/results/search";
	ТипЗапроса = "POST";
	
	Результат = СформироватьИОтправитьСОРВ(Узел, СтруктураСообщения, Запрос, ТипЗапроса);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПравилаРасчета(Узел, СтруктураСообщения) Экспорт 
	
	Запрос = "/sorv/remuneration/rules/search";
	ТипЗапроса = "POST";
	
	Результат = СформироватьИОтправитьСОРВ(Узел, СтруктураСообщения, Запрос, ТипЗапроса);
	
	Возврат Результат;
	
КонецФункции

Функция УдалениеДанныхВСОРВ(Узел, СтруктураСообщения) Экспорт 
	
	//Запрос = "/sorv/remuneration/delete";
	//ТипЗапроса = "POST";
	//
	//Результат = СформироватьИОтправитьСОРВ(Узел, СтруктураСообщения, Запрос, ТипЗапроса);
	//
	//Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПредставлениеПеречисления(ЗначениеПеречисления) Экспорт
	
	ИмяЗначенияПеречисления = "";
	
	Если ЗначениеЗаполнено(ЗначениеПеречисления) Тогда
		
		ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
		
		ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
		
		ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		
	КонецЕсли;
	
	Возврат ИмяЗначенияПеречисления;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПреобразованиеДанных 

Функция ПрочитатьОтветВСтруктуру(Ответ)
	
	ЧтениеJSON = Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	Структура = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть(); 
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти

#Область ОтправкаДанных

Функция СформироватьИОтправитьСОРВ(Узел, СтруктураСообщения, Запрос, ТипЗапроса)
	
	ТекстСообщения = СформироватьТекстСообщения(СтруктураСообщения);
	
	Результат = ОтправитьСообщениеВСОРВ(ТекстСообщения, Узел, Запрос, ТипЗапроса);
	
	Возврат Результат;
		
КонецФункции

Функция СформироватьТекстСообщения(СтруктураСообщения) 
	
	Результат = ОбменДаннымиAMS.СформироватьСтрокуJSON(СтруктураСообщения);
	Результат = СтрЗаменить(Результат, """""", "null");
	Возврат Результат; 
	
КонецФункции

Функция ОтправитьСообщениеВСОРВ(ТекстСообщения, Узел, Запрос = Неопределено, ТипЗапроса = Неопределено)
	
	Результат = Новый Структура("Успех, Сообщение, ОписаниеОтвета", Ложь, ТекстСообщения);
	
	ПараметрыПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Узел, "Адрес, Токен, ТипЗапроса");
	
	Если Не ПараметрыПодключения.Свойство("Запрос") Тогда
		ПараметрыПодключения.Вставить("Запрос", Запрос);
	КонецЕсли;	

	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес, , , , , 30, ЗащищенноеСоединение);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	
	СтрокаЗапроса = ПараметрыПодключения.Запрос + "?api-key=" + ПараметрыПодключения.Токен;
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТекстСообщения);
	
	Попытка 
		
		Ответ = Соединение.ВызватьHTTPМетод(ПараметрыПодключения.ТипЗапроса, Запрос);
				
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обмен данными.СОРВ.Отправка данных"
			, УровеньЖурналаРегистрации.Ошибка, Метаданные.ПланыОбмена.СОРВ, "", "Произошла сетевая ошибка");
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОписаниеОтвета = ПрочитатьОтветВСтруктуру(Ответ); 	
	
	Если Ответ.КодСостояния >= 400 и Ответ.КодСостояния < 500  Тогда
		
		Результат.ОписаниеОтвета = ОписаниеОтвета;
		
		ТекстСообщения = СтрШаблон("Код статуса больше 4XX, ошибка запроса.  Код статуса:%1. ОписаниеОшибки: %2", Ответ.КодСостояния, ОписаниеОтвета.comment);
		
		Результат.Сообщение = ТекстСообщения;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обмен данными.СОРВ.Отправка данных"
		, УровеньЖурналаРегистрации.Ошибка, Метаданные.ПланыОбмена.СОРВ, "", ТекстСообщения);
		
	КонецЕсли;
	
	Если Ответ.КодСостояния >= 500 и Ответ.КодСостояния < 600  Тогда 
		
		ТекстСообщения = СтрШаблон("Код статуса больше 5XX, ошибка сервера. Код статуса:%1. ОписаниеОшибки: %2", Ответ.КодСостояния, ОписаниеОтвета.value);
		
		Результат.Сообщение = ТекстСообщения;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обмен данными.СОРВ.Отправка данных"
		 , УровеньЖурналаРегистрации.Ошибка, Метаданные.ПланыОбмена.СОРВ, "", ТекстСообщения);
		 
	КонецЕсли;
	
	Если Ответ.КодСостояния = 200 Тогда 
		
		Результат.Успех = Истина;
		Результат.ОписаниеОтвета = ОписаниеОтвета;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обмен данными.СОРВ.Отправка данных"
			, УровеньЖурналаРегистрации.Информация, Метаданные.ПланыОбмена.СОРВ, "", "Обмен с СОРВ прошел успешно");
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти