Процедура ПодготовитьНаборыЗаписейКПроведению(Объект, ВыборочноОчищатьРегистры = Ложь) Экспорт
	
	Для каждого НаборЗаписей Из Объект.Движения Цикл
	
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;				
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеПоРегистрам(Объект, ПараметрыПроведения) Экспорт
	
	ТаблицыДляПроведения = ПараметрыПроведения.СтруктураТаблицДокумента;
	
	Движения = Объект.Движения;
	
	Для каждого ТаблицаДляПроведения Из ТаблицыДляПроведения Цикл
	
		Если Движения.Найти(ТаблицаДляПроведения.Ключ) <> Неопределено Тогда
			
			Движения[ТаблицаДляПроведения.Ключ].Загрузить(ТаблицаДляПроведения.Значение);
			
		КонецЕсли;	
	
	КонецЦикла;
	
КонецПроцедуры	
	