#Область ПрограммныйИнтерфейс 

Функция ПолучитьСредуЗапускаИБ() Экспорт 
	
	Возврат ПараметрыСеанса.AMS_СредаЗапуска; 
	
КонецФункции	

Функция ЗаполнитьСредуЗапускаИБ() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СредаЗапуска = Перечисления.AMS_СредыЗапуска.Дев;
	
	ОписаниеБД = ПолучитьПредставлениеИнформационнойБазы();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнформацияОИБ.СредаЗапуска КАК СредаЗапуска
	|ИЗ
	|	РегистрСведений.AMS_ИнформацияОИБ КАК ИнформацияОИБ
	|ГДЕ
	|	ИнформацияОИБ.ИмяСервера = &ИмяСервера
	|	И ИнформацияОИБ.ИмяБазы = &ИмяБазы";
	
	Запрос.УстановитьПараметр("ИмяСервера", ОписаниеБД.ИмяСервера);
	Запрос.УстановитьПараметр("ИмяБазы", ОписаниеБД.ИмяБазы);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СредаЗапуска = Выборка.СредаЗапуска;
	Иначе
		РегистрыСведений.AMS_ИнформацияОИБ.СоздатьИнформациюОИБ(ОписаниеБД, СредаЗапуска);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СредаЗапуска;
	
КонецФункции

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске.
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры, Отказ, ЭтоВызовПередНачаломРаботыСистемы) Экспорт
			
	Если ЭтоВызовПередНачаломРаботыСистемы  Тогда
		ПолучитьСредуЗапускаИБ();		
	КонецЕсли;
		
КонецПроцедуры
 
Процедура СобытияЖурнала() Экспорт 
	
	ОписаниеБД = ПолучитьПредставлениеИнформационнойБазы();
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор; 
	
	НоваяЗапись = РегистрыСведений.AMS_ИнформацияОИБ.СоздатьМенеджерЗаписи(); 
	
	НоваяЗапись.ИмяСервера = ОписаниеБД.ИмяСервера;
	НоваяЗапись.ИмяБазы = ОписаниеБД.ИмяБазы;
		
	ПараметрыОтчета = ПараметрыОтчета(НоваяЗапись.ДатаПоследнейЗаписи);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор); 
	
	ПараметрыВыполнения.ОжидатьЗавершение = 0;  
	
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление журнала регистрации'"); 
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне("ЖурналРегистрации.ПрочитатьСобытияЖурналаРегистрации", ПараметрыОтчета, ПараметрыВыполнения);
	
	СтруктураЗаписейЖурнала = ПолучитьИЗВременногоХранилища(РезультатВыполнения.АдресРезультата);
	
	ДатаПоследнегоСобытия = СтруктураЗаписейЖурнала[СтруктураЗаписейЖурнала.Количество() - 1].ДатаНаСервере;
	
	НоваяЗапись.ДатаПоследнейЗаписи = ДатаПоследнегоСобытия;
	
	НоваяЗапись.Записать();
	
	Если СтруктураЗаписейЖурнала.Количество() = 10000 Тогда
		СобытияЖурнала();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

Функция ПолучитьПредставлениеИнформационнойБазы() 
	
	ОписаниеБД = Новый Структура("ИмяСервера, ИмяБазы", "", "");
	
	СтрокаСоединенияСБД = СтрокаСоединенияИнформационнойБазы();
		
	ЭтоФайловаяИБ = Найти(ВРег(СтрокаСоединенияСБД), "FILE=") = 1;
	
	Если ЭтоФайловаяИБ Тогда
		
		ПутьКБД = Сред(СтрокаСоединенияСБД, 6, СтрДлина(СтрокаСоединенияСБД) - 6);
		
		ОписаниеБД.ИмяБазы = ПутьКБД;
		
	Иначе
			
		// надо к имени сервера прибавить имя пути информационной базы
			
		ПозицияПоиска = Найти(ВРег(СтрокаСоединенияСБД), "SRVR=");
		
		Если ПозицияПоиска <> 1 Тогда
			
			Возврат Неопределено;
				
		КонецЕсли;
		
		ПозицияТочкиСЗапятой = Найти(СтрокаСоединенияСБД, ";");
		
		НачальнаяПозицияКопирования = 6 + 1;
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2; 
		ИмяСервера = Сред(СтрокаСоединенияСБД, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования - НачальнаяПозицияКопирования + 1);
		СтрокаСоединенияСБД = Сред(СтрокаСоединенияСБД, ПозицияТочкиСЗапятой + 1);
		// позиция имени сервера
		ПозицияПоиска = Найти(ВРег(СтрокаСоединенияСБД), "REF="); 
		
		Если ПозицияПоиска <> 1 Тогда
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		НачальнаяПозицияКопирования = 6;
		
		ПозицияТочкиСЗапятой = Найти(СтрокаСоединенияСБД, ";");
		
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2;
		
		ИмяИБНаСервере = Сред(СтрокаСоединенияСБД, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования - НачальнаяПозицияКопирования + 1);
		
		ОписаниеБД.ИмяСервера = ИмяСервера;
		ОписаниеБД.ИмяБазы = ИмяИБНаСервере;
		
	КонецЕсли;
	
	Возврат ОписаниеБД;
	
КонецФункции

Функция ПараметрыОтчета(ДатаНачала) 
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	
	// конструктор отбора для выполнения процедуры 
	ОтборЖурналаРегистрации = Новый Структура("ДатаНачала, ДатаОкончания");
	
	ОтборЖурналаРегистрации.ДатаНачала = НачалоДня(ДатаНачала + 1); 
	ОтборЖурналаРегистрации.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	
	ПараметрыОтчета = Новый Структура; 
	ПараметрыОтчета.Вставить("ОтборЖурналаРегистрации", ОтборЖурналаРегистрации);
	ПараметрыОтчета.Вставить("КоличествоПоказываемыхСобытий", 10000);
	ПараметрыОтчета.Вставить("УникальныйИдентификатор", УникальныйИдентификатор); 
	ПараметрыОтчета.Вставить("МенеджерВладельца", Обработки.ЖурналРегистрации); 
	ПараметрыОтчета.Вставить("ДобавлятьДополнительныеКолонки", Ложь);
	//ПараметрыОтчета.Вставить("Журнал", РеквизитФормыВЗначение("Журнал")); 
	
	Возврат ПараметрыОтчета;
	
КонецФункции

#КонецОбласти