#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс  

#Область ПроведениеДокумента

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТаблицыДокумента();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
	МаксимальныеРазмерыКВПоПриказу = Запрос.Выполнить().Выгрузить();	
	
	СтруктураТаблицДокумента = Новый Структура;
	СтруктураТаблицДокумента.Вставить("МаксимальныеРазмерыКВПоПриказу", МаксимальныеРазмерыКВПоПриказу);
	
	ПараметрыПроведения.Вставить("СтруктураТаблицДокумента", СтруктураТаблицДокумента);
	
	Возврат ПараметрыПроведения;
	
КонецФункции	

Функция ТекстЗапросаТаблицыДокумента()
	
	Результат = 
	"ВЫБРАТЬ
	|	ПриказОМаксимальномРазмереКВСтраховыеПродукты.СтраховойПродукт КАК СтраховойПродукт,
	|	ПриказОМаксимальномРазмереКВСтраховыеПродукты.ВознаграждениеФЛ КАК ВознаграждениеФЛ,
	|	ПриказОМаксимальномРазмереКВСтраховыеПродукты.ВознаграждениеЮЛ КАК ВознаграждениеЮЛ,
	|	ПриказОМаксимальномРазмереКВСтраховыеПродукты.ВознаграждениеКО КАК ВознаграждениеКО,
	|	ПриказОМаксимальномРазмереКВСтраховыеПродукты.ВознаграждениеЛК КАК ВознаграждениеЛК,
	|	ПриказОМаксимальномРазмереКВСтраховыеПродукты.ЕстьДополнительныйАгент КАК ЕстьДополнительныйАгент,
	|	ПриказОМаксимальномРазмереКВСтраховыеПродукты.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.ПриказОМаксимальномРазмереКВ.СтраховыеПродукты КАК ПриказОМаксимальномРазмереКВСтраховыеПродукты
	|ГДЕ
	|	ПриказОМаксимальномРазмереКВСтраховыеПродукты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

Функция ПроверитьОграниченияМаксимальногоКВ(Параметры) Экспорт

	СтраховойПродукт = Параметры.СтраховойПродукт;
	Агент 			 = Параметры.Агент;
	Период 			 = Параметры.Период;
	Посредник 		 = Параметры.Посредник;
	РазмерКВ 		 = Параметры.РазмерКВ;
	НаличиеДополнительногоАгента = Параметры.ДополнительныйАгент;
	
	ОграниченияПоКВПоПродукту 		= ОграниченияПоСтраховомуПродукту(СтраховойПродукт, НаличиеДополнительногоАгента, Период);
	КонтролируемоеЗначениеРазмераКВ = ПолучитьКонтролируемоеЗначениеКВ(ОграниченияПоКВПоПродукту, Агент);
	
	Если НЕ КонтролируемоеЗначениеРазмераКВ = Неопределено
		И КонтролируемоеЗначениеРазмераКВ < РазмерКВ Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
			
КонецФункции	

Функция ПараметрыПроверкиОграничений() Экспорт

	Результат = Новый Структура();
	Результат.Вставить("СтраховойПродукт");
	Результат.Вставить("Агент");
	Результат.Вставить("Период");
	Результат.Вставить("Посредник");
	Результат.Вставить("РазмерКВ");
	Результат.Вставить("ДополнительныйАгент", Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

функция ПолучитьКонтролируемоеЗначениеКВ(ОграниченияПоКВПоПродукту, Агент)
	
	НеобходимыеРеквизиты = "ТипКонтрагента";
	ДанныеАгента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Агент, НеобходимыеРеквизиты);
	
	// Планируется использовать данные из ПеречислениеСсылка.AMS_ТипыАгентовПоСпособуПродаж.
	
	//Если ДанныеАгента.ЭтоКредитнаяОрганизация Тогда
	//	
	//	Возврат ОграниченияПоКВПоПродукту.ВознаграждениеКО;
	//	
	//ИначеЕсли ДанныеАгента.ЭтоАвтопроизводитель Тогда
	//	
	//	Возврат ОграниченияПоКВПоПродукту.ВознаграждениеЛК;
		
	Если ДанныеАгента.ТипКонтрагента = Перечисления.AMS_ТипыКонтрагентов.ФизическоеЛицо Тогда
		
		Возврат ОграниченияПоКВПоПродукту.ВознаграждениеФЛ;
		
	Иначе
		
		Возврат ОграниченияПоКВПоПродукту.ВознаграждениеЮЛ;
		
	КонецЕсли;	
	
КонецФункции	

Функция ОграниченияПоСтраховомуПродукту(СтраховойПродукт, ДополнительныйАгент, Период)
	
	Результат = СтруктураПараметровОграничений();	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаксимальныеРазмерыКВПоПриказуСрезПоследних.ВознаграждениеФЛ КАК ВознаграждениеФЛ,
		|	МаксимальныеРазмерыКВПоПриказуСрезПоследних.ВознаграждениеЮЛ КАК ВознаграждениеЮЛ,
		|	МаксимальныеРазмерыКВПоПриказуСрезПоследних.ВознаграждениеКО КАК ВознаграждениеКО,
		|	МаксимальныеРазмерыКВПоПриказуСрезПоследних.ВознаграждениеЛК КАК ВознаграждениеЛК,
		|	МаксимальныеРазмерыКВПоПриказуСрезПоследних.ЕстьДополнительныйАгент КАК ЕстьДополнительныйАгент
		|ИЗ
		|	РегистрСведений.МаксимальныеРазмерыКВПоПриказу.СрезПоследних(&Период, СтраховойПродукт = &СтраховойПродукт) КАК МаксимальныеРазмерыКВПоПриказуСрезПоследних
		|ГДЕ
		|	МаксимальныеРазмерыКВПоПриказуСрезПоследних.ЕстьДополнительныйАгент = &ДополнительныйАгент";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СтраховойПродукт", СтраховойПродукт);
	Запрос.УстановитьПараметр("ДополнительныйАгент", ДополнительныйАгент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция СтруктураПараметровОграничений()

	Результат = Новый Структура;
	Результат.Вставить("ВознаграждениеФЛ");
	Результат.Вставить("ВознаграждениеЮЛ");
	Результат.Вставить("ВознаграждениеКО");
	Результат.Вставить("ВознаграждениеЛК");
	Результат.Вставить("ЕстьДополнительныйАгент");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли