
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		
		Ответственный = Пользователи.АвторизованныйПользователь();
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.МаксимальныеРазмерыКВПоПриказу.Записывать = Истина;
	
	AMS_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ПараметрыПроведедения = Документы.ПриказОМаксимальномРазмереКВ.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	AMS_ПроведениеСервер.ПроведениеПоРегистрам(ЭтотОбъект, ПараметрыПроведедения);

КонецПроцедуры

#КонецОбласти