#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс  

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииИсточниковДанныхПечати
Процедура ПриОпределенииИсточниковДанныхПечати(Объект, ИсточникиДанныхПечати) Экспорт
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
				
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//  Параметры                  - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ОтзывСогласияНаОбработкуПерсональныхДанных.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
//  Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.AMS_ИзмененияДанныхПродавцов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#Область ПроведениеДокумента

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТаблицыДокумента();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	AMS_ИндивидуальныеПравилаРасчетаКВ = Запрос.Выполнить().Выгрузить();
	
	УдалитьДублиЗаписейПравил(AMS_ИндивидуальныеПравилаРасчетаКВ);
	
	СтруктураТаблицДокумента = Новый Структура;
	СтруктураТаблицДокумента.Вставить("AMS_ИндивидуальныеПравилаРасчетаКВ", AMS_ИндивидуальныеПравилаРасчетаКВ);
	
	ПараметрыПроведения.Вставить("СтруктураТаблицДокумента", СтруктураТаблицДокумента);
	
	Возврат ПараметрыПроведения;
	
КонецФункции	

Функция ТекстЗапросаТаблицыДокумента()
	
	Результат = 
	"ВЫБРАТЬ
	|	AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты.СтраховойПродукт КАК СтраховойПродукт,
	|	AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты.Ссылка КАК Ссылка,
	|	AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты.Процент КАК Процент,
	|	AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты.Отменен КАК Отменен,
	|	AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	AMS_ИзменениеКВИндивидуальноеПоказатели.КлючУсловий КАК КлючУсловий,
	|	AMS_ИзменениеКВИндивидуальноеПоказатели.КлючСвязи КАК ГУИД,
	|	AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты.СтраховойРиск КАК СтраховойРиск,
	|	AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты.ДатаНачалаДействия КАК ДатаНачалаДействия
	|ПОМЕСТИТЬ ВТ_ДанныеПоСтраховымПродуктам
	|ИЗ
	|	Документ.AMS_ИзменениеКВИндивидуальное.СтраховыеПродукты КАК AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ИзменениеКВИндивидуальное.Показатели КАК AMS_ИзменениеКВИндивидуальноеПоказатели
	|		ПО AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты.КлючСвязи = AMS_ИзменениеКВИндивидуальноеПоказатели.КлючСвязи
	|ГДЕ
	|	AMS_ИзменениеКВИндивидуальноеПоказатели.Ссылка = &Ссылка
	|	И AMS_ИзменениеКВИндивидуальноеСтраховыеПродукты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AMS_ИзменениеКВИндивидуальное.Филиал КАК Филиал,
	|	ВТ_ДанныеПоСтраховымПродуктам.СтраховойПродукт КАК СтраховойПродукт,
	|	ВТ_ДанныеПоСтраховымПродуктам.СтраховойРиск КАК СтраховойРиск,
	|	МИНИМУМ(ВТ_ДанныеПоСтраховымПродуктам.Процент) КАК Процент,
	|	МАКСИМУМ(ВТ_ДанныеПоСтраховымПродуктам.Отменен) КАК Отменен,
	|	МАКСИМУМ(ВТ_ДанныеПоСтраховымПродуктам.ДатаОкончанияДействия) КАК ДатаОкончанияДействия,
	|	ВТ_ДанныеПоСтраховымПродуктам.КлючУсловий КАК КлючУсловий,
	|	AMS_ИзменениеКВИндивидуальное.Агент КАК Агент,
	|	МАКСИМУМ(AMS_ИзменениеКВИндивидуальное.Дата) КАК Период,
	|	МАКСИМУМ(ВТ_ДанныеПоСтраховымПродуктам.ГУИД) КАК ГУИД,
	|	МАКСИМУМ(ВТ_ДанныеПоСтраховымПродуктам.ДатаНачалаДействия) КАК ДатаНачалаДействия
	|ИЗ
	|	ВТ_ДанныеПоСтраховымПродуктам КАК ВТ_ДанныеПоСтраховымПродуктам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ИзменениеКВИндивидуальное КАК AMS_ИзменениеКВИндивидуальное
	|		ПО ВТ_ДанныеПоСтраховымПродуктам.Ссылка = AMS_ИзменениеКВИндивидуальное.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	AMS_ИзменениеКВИндивидуальное.Филиал,
	|	ВТ_ДанныеПоСтраховымПродуктам.СтраховойПродукт,
	|	ВТ_ДанныеПоСтраховымПродуктам.СтраховойРиск,
	|	ВТ_ДанныеПоСтраховымПродуктам.КлючУсловий,
	|	AMS_ИзменениеКВИндивидуальное.Агент";
	
	Возврат Результат;
	
КонецФункции	

Процедура УдалитьДублиЗаписейПравил(AMS_ИндивидуальныеПравилаРасчетаКВ)
	
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли