#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Движения.AMS_ИндивидуальныеПравилаРасчетаКВ.Записывать = Истина;
	
	AMS_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ПараметрыПроведедения = Документы.AMS_ИзменениеКВИндивидуальное.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	AMS_ПроведениеСервер.ПроведениеПоРегистрам(ЭтотОбъект, ПараметрыПроведедения);
	AMS_АктуализацияКВПоИпотеке.СформироватьЗаписиАктуальногоКВ(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Очистить();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаИзменениеАД") Тогда
		// Заполнение шапки
		Агент = ДанныеЗаполнения.Агент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Основание = ДанныеЗаполнения.Ссылка;
		Филиал = ДанныеЗаполнения.Филиал;
		Для Каждого ТекСтрокаПоказатели Из ДанныеЗаполнения.Показатели Цикл
			НоваяСтрока = Показатели.Добавить();
			НоваяСтрока.КлючСвязи = ТекСтрокаПоказатели.КлючСвязи;
			НоваяСтрока.КлючУсловий = ТекСтрокаПоказатели.КлючУсловий;
		КонецЦикла;
		Для Каждого ТекСтрокаСтраховыеПродукты Из ДанныеЗаполнения.СтраховыеПродукты Цикл
			НоваяСтрока = СтраховыеПродукты.Добавить();
			НоваяСтрока.ДатаНачалаДействия = ТекСтрокаСтраховыеПродукты.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия = ТекСтрокаСтраховыеПродукты.ДатаОкончанияДействия;
			НоваяСтрока.КлючСвязи = ТекСтрокаСтраховыеПродукты.КлючСвязи;
			НоваяСтрока.Отменен = ТекСтрокаСтраховыеПродукты.Отменен;
			НоваяСтрока.Процент = ТекСтрокаСтраховыеПродукты.Процент;
			НоваяСтрока.СтраховойПродукт = ТекСтрокаСтраховыеПродукты.СтраховойПродукт;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
		|	AMS_АгентскиеДоговоры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Агенты КАК AMS_Агенты
		|		ПО AMS_АгентскиеДоговоры.Владелец = AMS_Агенты.Ссылка
		|ГДЕ
		|	AMS_АгентскиеДоговоры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Агент);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	АгентскийДоговор = РезультатЗапроса.Ссылка;
	
КонецПроцедуры

#КонецОбласти   

