#Область ОбработчикиСобытий

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьТЧВознаграждениеБанков();
КонецПроцедуры

&НаКлиенте
Процедура ВознаграждениеБанковПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущаяСтрока = Элементы.ВознаграждениеБанков.ТекущиеДанные;
	ТекущаяСтрока.НачалоДействияРазмераКВ = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ВознаграждениеБанковРискОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Отбор = Новый Структура("Риск", ВыбранноеЗначение);
	СтрокаТЧ = ВознаграждениеБанков.НайтиСтроки(Отбор);
	
	Если СтрокаТЧ.Количество() > 0 Тогда
		ТекстСообщения	 = "Риск """ + ВыбранноеЗначение + """ уже добавлен в список";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Истина);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ДополнительныеПараметры = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтактнаяИнформация");
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация 
	
	ЗаполнитьТЧВознаграждениеБанков();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	ОчиститьПустыеСтроки();                         
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОчиститьПустыеСтроки()
	
	СтрокаТЧ = ВознаграждениеБанков.Количество();
	Пока СтрокаТЧ > 0 Цикл
		СтрокаТЧ = СтрокаТЧ - 1;
		Строка = ВознаграждениеБанков[СтрокаТЧ];
		Если Строка.Риск = Справочники.AMS_СтраховыеРиски.ПустаяСсылка()
			И Строка.РазмерКВ = 0
			И Строка.НачалоДействияРазмераКВ = Дата(1,1,1) Тогда
			ВознаграждениеБанков.Удалить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧВознаграждениеБанков()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТаблицыДокумента();
	Запрос.УстановитьПараметр("Банк", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаОкончания", Дата(1, 1, 1));
	
	AMS_РазмерыКВБанков = Запрос.Выполнить().Выгрузить();
	
	ВознаграждениеБанков.Загрузить(AMS_РазмерыКВБанков);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаТаблицыДокумента()
	
	Результат = 
	"ВЫБРАТЬ
	|	AMS_РазмерыКВБанковСрезПоследних.Риск КАК Риск,
	|	AMS_РазмерыКВБанковСрезПоследних.РазмерКВ КАК РазмерКВ,
	|	AMS_РазмерыКВБанковСрезПоследних.ДатаНачалаДействия КАК НачалоДействияРазмераКВ
	|ИЗ
	|	РегистрСведений.AMS_РазмерыКВБанков.СрезПоследних(
	|			,
	|			Банк = &Банк
	|				И ДатаОкончанияДействия = &ДатаОкончания) КАК AMS_РазмерыКВБанковСрезПоследних";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СтандартныеПодсистемы  

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.НачатьИзменение(ЭтотОбъект, Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьОчистку(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    
    УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
    
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
    
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьОбработкуНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
    ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры
&НаСервере
Процедура ОбновитьКонтактнуюИнформацию(Результат)
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.AMS_Банки.СоздатьПровестиДокуметКВБанка(ТекущийОбъект, ВознаграждениеБанков);

КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация   

#КонецОбласти
