
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика. 
	Если Не ЗначениеЗаполнено(Объект.Ссылка) тогда
		
		Объект.ТипЗначения = Неопределено; 
		
	Конецесли;
	
	УстановитьДоступностьРеквизитов();
	ОпределитьПараметрыЗначенияДополнительныхУсловий();
	ЗаполнитьДоступныеУсловияСравнения();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Объект.ПутьКДанным 	
	
	Объект.ПутьКДанным = СокрЛП(Объект.ПутьКДанным);
	
	
	Если Объект.ПутьКДанным<>"" тогда
		
		СписокЗапрещенныхСимволов = ПроверитьПутьКДанным(Объект.ПутьКДанным);
		
		Если СписокЗапрещенныхСимволов<>"" тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Путь к данным содержит запрещенные символы: " + СписокЗапрещенныхСимволов;
			Сообщение.Поле = "Объект.ПутьКДанным";
			Сообщение.Сообщить();
			Отказ=Истина;
		Конецесли;
		
	Конецесли;
	
	//сворачиваем 
	//Если  Объект.ДоступныеУсловияСравнения.Количество()>1 тогда
	//	 		  
	//	  
	//	  СписокЗапрещенныхСимволов = ПроверитьПутьКДанным(Объект.ПутьКДанным);
	//	
	//	Если СписокЗапрещенныхСимволов<>"" тогда
	//		
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Путь к данным содержит запрещенные символы: " + СписокЗапрещенныхСимволов;
	//		Сообщение.Поле = "Объект.ПутьКДанным";
	//		Сообщение.Сообщить();
	//		Отказ=Истина;
	//	Конецесли;
	//	
	//Конецесли;

	
КонецПроцедуры

&НаСервере
Функция ПроверитьПутьКДанным(Путь)
	//Объект.ПутьКДанным 	
	СтрокаПроверки ="абвгдеёжзийклмнопрстуфхцчшщыъьэюяabcdefghijklmnopqrstuvwxyz"
	+"АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЫЪЬЭЮЯABCDEFGHIJKLMNOPQRSTUVWXYZ"
	+ "01234567890" 
	+ "_-.";
	
	
	СписокЗапрещенныхСимволов = "";
	
	СтрокаДляПроверкиЛокальная =Путь;
	
	Для С=1 По СтрДлина(СтрокаДляПроверкиЛокальная) Цикл   
		
		Символ = Сред(СтрокаДляПроверкиЛокальная, С, 1);   
		
		Если (СтрНайти(СтрокаПроверки, Символ) = 0) Тогда
			// Найден неразрешенный символ, добавить в список.
			Если СтрНайти(СписокЗапрещенныхСимволов, Символ) = 0 Тогда
				
				СписокЗапрещенныхСимволов = СписокЗапрещенныхСимволов + Символ;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	
	Возврат СписокЗапрещенныхСимволов;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Вставить содержимое обработчика. 
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

//Устанавливаем доступность реквизитов для нового элемента
&НаКлиенте
Процедура УстановитьДоступностьРеквизитов()
	
	ОбъектСохранен = ЗначениеЗаполнено(Объект.Ссылка);
	
	Элементы.ТипЗначения.ТолькоПросмотр =  ?(СокрЛП(Объект.ТипЗначения)="",Ложь, ОбъектСохранен);
	Элементы.ПутьКДанным.ТолькоПросмотр =  ?(СокрЛП(Объект.ПутьКДанным)="",Ложь, ОбъектСохранен);
	
	Элементы.ДоступныеЗначения.ТолькоПросмотр =   Не ЗначениеЗаполнено(Объект.ТипЗначения);
	Элементы.ДоступныеУсловияСравнения.ТолькоПросмотр =  Не ЗначениеЗаполнено(Объект.ТипЗначения);
   
                     
КонецПроцедуры

&НаСервере
Процедура ОпределитьПараметрыЗначенияДополнительныхУсловий()
	
	Элементы.ДоступныеЗначенияЗначение.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
	
	Если Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.AMS_ЗначенияДополнительныхУсловий")) тогда
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Ссылка");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		Элементы.ДоступныеЗначенияЗначение.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеУсловияСравнения()
	
	Элементы.ДоступныеУсловияСравненияУсловиеСравнения.СписокВыбора.Очистить();

	
	Если Объект.ТипЗначения.Типы().Количество()=1 тогда
		
		//ДоступныеУсловияСравнения 
		УсловиеСравнения = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПолучитьДоступныеУсловияСравнения(Объект.ТипЗначения);
		
		Элементы.ДоступныеУсловияСравненияУсловиеСравнения.СписокВыбора.ЗагрузитьЗначения(УсловиеСравнения);		
		
		//Объект.ТипЗначения = Неопределено;
		
	Конецесли;
	
КонецПроцедуры

//Запрет на использование составных типов
&НаСервере
Процедура ТипЗначенияПриИзмененииНаСервере()
	
	Если Объект.ТипЗначения.Типы().Количество()>1 тогда
		
		Объект.ТипЗначения = Неопределено;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя использовать составной тип значений. Тип очищен.";
		Сообщение.Поле = "Объект.ТипЗначения";
		Сообщение.Сообщить();
		
	Иначе
		
		
	Конецесли;
	
	Объект.ДоступныеЗначения.Очистить();
	Объект.ДоступныеУсловияСравнения.Очистить();
	
	ЗаполнитьДоступныеУсловияСравнения() ;
	
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	ТипЗначенияПриИзмененииНаСервере();
	
	УстановитьДоступностьРеквизитов();
	ОпределитьПараметрыЗначенияДополнительныхУсловий();
	//Очищает тип что бы пользователь сам указывал тип для нового элемента
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеУсловияСравненияУсловиеСравненияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Отбор = Новый Структура;
        Отбор.Вставить("УсловиеСравнения", ВыбранноеЗначение);
	  
	  НайденныеСтроки = Объект.ДоступныеУсловияСравнения.НайтиСтроки(Отбор);
	  
	  Если НайденныеСтроки.Количество()>0 тогда
		  
		     СтандартнаяОбработка = Ложь;
			 	Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Значение уже используется";
		
		//Сообщение.Поле = "Объект.ДоступныеУсловияСравнения.УсловиеСравнения";
		Сообщение.Сообщить();

			 
	  Конецесли;
	  
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЗначенияЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	// Вставить содержимое обработчика.  
	Отбор = Новый Структура;
	Отбор.Вставить("Значение", ВыбранноеЗначение);
	
	НайденныеСтроки = Объект.ДоступныеЗначения.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество()>0 тогда
		
		СтандартнаяОбработка = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Значение уже используется";
		
		//Сообщение.Поле = "Объект.ДоступныеУсловияСравнения.УсловиеСравнения";
		Сообщение.Сообщить();
		
		
	Конецесли;
	
КонецПроцедуры
