Процедура ОпределитьПараметрыСеансаПользователя() Экспорт
	
	ПараметрыПользователя = Новый Структура();
	Ограничения = Новый Массив;
	ПользовательБазы = ПользователиКлиентСервер.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.AMS_КаналПродаж КАК AMS_КаналПродаж,
		|	Пользователи.AMS_Филиал КАК AMS_Филиал,
		|	Пользователи.AMS_РегиональнаяГруппа КАК AMS_РегиональнаяГруппа,
		|	Пользователи.Подразделение КАК Подразделение,
		|	ПользователиДоступныеВидыСтраховыхПродуктов.ВидыСтраховыхПродуктов КАК ВидыСтраховыхПродуктов
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.ДоступныеВидыСтраховыхПродуктов КАК ПользователиДоступныеВидыСтраховыхПродуктов
		|		ПО Пользователи.Ссылка = ПользователиДоступныеВидыСтраховыхПродуктов.Ссылка
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПользовательБазы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыПользователя.Вставить("КаналПродаж", Выборка.AMS_КаналПродаж);
		ПараметрыПользователя.Вставить("Филиал", Выборка.AMS_Филиал);
		ПараметрыПользователя.Вставить("РегиональнаяГруппа", Выборка.AMS_РегиональнаяГруппа);
		ПараметрыПользователя.Вставить("Подразделение", Выборка.Подразделение);
		
		Ограничения.Добавить(Выборка.ВидыСтраховыхПродуктов);
		
	КонецЦикла;
	
	ОграниченияФикс = Новый ФиксированныйМассив(Ограничения);
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь(ПользовательБазы,Истина,Ложь);
	
	ПараметрыПользователя.Вставить("ДоступныеСтраховыеПродукты", ОграниченияФикс);
	ПараметрыПользователя.Вставить("ЭтоПолноправныйПользователь", ЭтоПолноправныйПользователь);
	
	ПараметрыСеанса.AMS_ПараметрыПользователя = Новый ФиксированнаяСтруктура(ПараметрыПользователя);
	
КонецПроцедуры
