#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт

	Для Каждого Строка Из ИсходныеДанные Цикл
						
		СправочникЭлемент = Справочники.AMS_ТерриторииСтрахования.НайтиПоРеквизиту("ГУИДЦССУ", Строка.ТерриторииПоОсаго); 
		
		Если СправочникЭлемент.Пустая() Тогда 
			
			СправочникОбъект = Справочники.AMS_ТерриторииСтрахования.СоздатьЭлемент();
			
		Иначе
			
			СправочникОбъект = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка);
		СправочникОбъект.Наименование = Строка.НаименованиеПолное;
		СправочникОбъект.ГУИДЦССУ = Строка.ТерриторииПоОсаго;
		
		Попытка
			
			СправочникОбъект.Записать();
			
			Комментарий = СтрШаблон("Успешно записано ТО с УИД %1", Строка.Контрагент);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника ТО", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_ТерриторииСтрахования, СправочникОбъект.Ссылка, Комментарий);
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника ТО", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_ТерриторииСтрахования, СправочникОбъект.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли