
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Условие")
		ИЛИ НЕ Параметры.Свойство("КлючСвязиСложногоУсловия")
		ИЛИ НЕ Параметры.Свойство("КлючСвязи") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	КлючСвязиСложногоУсловия = Параметры.КлючСвязиСложногоУсловия;
	КлючСвязи = Параметры.КлючСвязи;
	ОсновноеУсловие = Параметры.ОсновноеУсловие;
	
	Для каждого Условие Из Параметры.Условие Цикл
	
		СтрокаУсловий = Условия.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУсловий, Условие);
	
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Функция СтруктураПростыхУсловий(ТолькоУсловия = Ложь)
	
	Возврат AMS_КлючиУсловийСервер.СтруктураПростыхУсловий();
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ДанныеТекущихУсловий = Новый Массив;
	
	Для каждого СтрокаПростыхУсловий Из Условия Цикл
	
		СтруктураУсловия = СтруктураПростыхУсловий();
		ЗаполнитьЗначенияСвойств(СтруктураУсловия, СтрокаПростыхУсловий);
		СтруктураУсловия.КлючСвязи = КлючСвязи;
		СтруктураУсловия.КлючСвязиСложногоУсловия = КлючСвязиСложногоУсловия;
		СтруктураУсловия.ОсновноеУсловие = ОсновноеУсловие;
		
		ДанныеТекущихУсловий.Добавить(СтруктураУсловия);
	
	КонецЦикла;
    ПараметрыВыбораУсловий = Новый Структура("Условие", ДанныеТекущихУсловий); 
	ПараметрыВыбораУсловий.Вставить("КлючСвязиСложногоУсловия", КлючСвязиСложногоУсловия);
	ПараметрыВыбораУсловий.Вставить("КлючСвязи", КлючСвязи);
	ПараметрыВыбораУсловий.Вставить("ОсновноеУсловие", ОсновноеУсловие);
	
	ЭтаФорма.Закрыть(ПараметрыВыбораУсловий);
	
КонецПроцедуры
