
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьФилиаловПоПользователю();
КонецПроцедуры

&НаСервере
Процедура ВидимостьФилиаловПоПользователю()
	
	СписокДоговор = ОпределитьСписокДоговоровПоФилиалуПользователя();
	
	Если ЗначениеЗаполнено(СписокДоговор) Тогда
		
		ВидВСписке = ВидСравненияКомпоновкиДанных.ВСписке;
		Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ГУИД", СписокДоговор, ВидВСписке,
																									Неопределено, Истина, Режим);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьСписокДоговоровПоФилиалуПользователя()
	
	ГУИДФилиал = ПользователиКлиентСервер.ТекущийПользователь().AMS_Филиал.ГУИД;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ИзменениеУсловийАгентскогоДоговора.ГУИД КАК ГУИД
		|ИЗ
		|	Документ.AMS_ИзменениеУсловийАгентскогоДоговора КАК AMS_ИзменениеУсловийАгентскогоДоговора
		|ГДЕ
		|	AMS_ИзменениеУсловийАгентскогоДоговора.Филиал.ГУИД = &ГУИД";
	
	Запрос.УстановитьПараметр("ГУИД", ГУИДФилиал);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГУИД");
	
	Возврат РезультатЗапроса;
	
КонецФункции
