#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфей

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	Идентификаторы				 = ИдентификаторыПредопределенныхДанныхГУИД();
	Классификация 				= ИдентификаторыПредопределенныхДанныхКлассификацияСотрудника();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		МотивационныеРолиОбъект					 = КлючЗначение.Ключ.ПолучитьОбъект();
		МотивационныеРолиОбъект.Гуид			 = КлючЗначение.Значение;
		МотивационныеРолиОбъект.Классификация	 = Классификация.Получить(КлючЗначение.Ключ);
		МотивационныеРолиОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ИдентификаторыПредопределенныхДанныхГУИД()

	Результат = Новый Соответствие;
	Результат.Вставить(Справочники.МотивационныеРоли.ДиректорФилиала1Уровня,						 "18de6b79-5540-4622-95b2-fb4395163468");
	Результат.Вставить(Справочники.МотивационныеРоли.ДиректорФилиала1УровняБезДФ2Уровня,			 "b332a3f1-dbc2-4691-aff0-b9b5b26175d3");
	Результат.Вставить(Справочники.МотивационныеРоли.ДиректорФилиала2Уровня,						 "82f07d65-c36e-42a3-8b9f-51b627385393");
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаАОКП,				 "a5aec03d-fa2b-423e-b8a5-fdb541ec08e0");
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаДКП,				 "410e5843-7d96-4e39-93f5-f5397eb15c7d");
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаККП,				 "b061ef09-5831-40fe-a7e2-8550e1224c05");
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаЛВС,				 "71588bc4-1376-4440-b334-4f8ba7db4259");
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаПКП,				 "ed32a13e-3ddc-41b2-aeff-00d01f785f25");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамАКП,							 "afd59d12-fcbf-41ac-9ee6-63c319232977");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамДКП,							 "02c997da-e62f-4176-847c-49154c7f5fd8");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамИПКП,						 "0ebe8cc0-860f-466c-9879-3be789ff2f13");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамККП,							 "611b7870-6a45-48f0-8a3a-6fe731338c99");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамККПВИП,						 "40f7ed45-37f1-4c4f-b066-8af8746c31d0");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамЛВС,							 "6ac6b02d-326c-47c7-a145-eaf7eb7a4632");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамЛККП,						 "39481de9-2da2-4dfb-a82c-59c760854824");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамЛПКП,						 "d751bfe3-7884-42a4-8fe6-44d1c29e8754");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамНПКП,						 "b383da10-71cc-42ba-8c4e-1510410b8e22");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамОКП,							 "93de53cc-091a-4ad9-8306-f1641b9b4293");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамПКП,							 "cc37e023-d740-4e2c-8287-2fbd973083da");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПролонгации,							 "c649e2ae-9b1d-4f00-90b6-aea9eb024b2b");
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоСопровождениюПродажЛВС,				 "384b259d-0f0d-4705-8a04-51390a8cf72f");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПоПролонгации,					 "71bdc532-4a37-4e30-aa32-2a02bcfb0fe6");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажАКП,						 "5a88cf2c-84a2-4069-8eda-a0be60469cff");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажАКПКвартал,				 "51ad5a05-b1e3-42bd-b4d9-5953356e432f");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажДКП,						 "f1ee68f3-9671-41de-817e-a2639c7e939e");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажИПКП,						 "5dd0d51f-c9f4-4e9f-b79d-b0409ea86760");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажИПКПКвартал,				 "f5f61428-9e27-4f11-b75f-e6354dc7427f");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажККП,						 "6f364ece-20af-4984-9667-cf43094d8c0f");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажККПКвартал,				 "4fd814ef-c2d9-471e-868d-723c80c699d8");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажЛВС,						 "afdd2dbf-1d04-4b12-bb4f-2df8fdddb27f");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажЛПКП,						 "d46d7e9b-b12a-476e-8cfb-e658f9d9ccd5");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажНПКП,						 "f438b60d-5dc6-4e79-a584-841e869a5c68");
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажОКП,						 "3a7414b2-6872-4fa5-8719-120b06066ec7");
	Результат.Вставить(Справочники.МотивационныеРоли.РуководительССК,								 "b81a6b14-afe9-4445-b2f3-62525d2af2d0");
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистССК,									 "e2ed49f2-b50e-43f9-9c4e-f8a982fa5c37");
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистССКИУчета,							 "	81557f3e-f91f-4018-95b9-1d825d0f8754");
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистССКИЮридическогоСопровождения,		 "1c7c84de-df69-417c-8899-00cfd79dd6dd");
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистСтраховогоУчета,						 "c6a93b6f-9d4b-4ead-9839-fceadfd3f7c5");
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистСтраховогоУчетаСопровожденияПродаж,	 "ec68ee81-b99b-4edd-a75d-b778b4471b0c");
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистСтраховогоУчетаИСопровожденияПродаж,	 "462ae436-8fc9-443a-a221-108af68904e4");
	Результат.Вставить(Справочники.МотивационныеРоли.УниверсальныйЗаместительДиректораФилиала,		 "e6688ebd-7f0e-4180-963b-a32dc2dae01c");
	Результат.Вставить(Справочники.МотивационныеРоли.УниверсальныйКлиентскийМенеджер,				 "ef0bd8ea-e5bc-4cf9-8942-0f38f2117ced");
	
	Возврат Результат;
	
КонецФункции	

Функция ИдентификаторыПредопределенныхДанныхКлассификацияСотрудника()

	Продающий = Перечисления.КлассификацияСотрудника.Продающий;
	НеПродающй = Перечисления.КлассификацияСотрудника.НеПродающий;
	
	Результат = Новый Соответствие;
	Результат.Вставить(Справочники.МотивационныеРоли.ДиректорФилиала1Уровня,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.ДиректорФилиала1УровняБезДФ2Уровня,			 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.ДиректорФилиала2Уровня,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаАОКП,				 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаДКП,				 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаККП,				 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаЛВС,				 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.ЗаместительДиректораФилиалаПКП,				 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамАКП,							 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамДКП,							 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамИПКП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамККП,							 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамККПВИП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамЛВС,							 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамЛККП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамЛПКП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамНПКП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамОКП,							 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПродажамПКП,							 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоПролонгации,							 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.МенеджерПоСопровождениюПродажЛВС,				 НеПродающй);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПоПролонгации,					 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажАКП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажАКПКвартал,				 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажДКП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажИПКП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажИПКПКвартал,				 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажККП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажККПКвартал,				 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажЛВС,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажЛПКП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажНПКП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.НачальникОтделаПродажОКП,						 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.РуководительССК,								 НеПродающй);
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистССК,									 НеПродающй);
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистССКИУчета,							 НеПродающй);
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистССКИЮридическогоСопровождения,		 НеПродающй);
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистСтраховогоУчета,						 НеПродающй);
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистСтраховогоУчетаСопровожденияПродаж,	 НеПродающй);
	Результат.Вставить(Справочники.МотивационныеРоли.СпециалистСтраховогоУчетаИСопровожденияПродаж,	 НеПродающй);
	Результат.Вставить(Справочники.МотивационныеРоли.УниверсальныйЗаместительДиректораФилиала,		 Продающий);
	Результат.Вставить(Справочники.МотивационныеРоли.УниверсальныйКлиентскийМенеджер,				 Продающий);
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли