#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Для Каждого Строка Из ИсходныеДанные Цикл
		
		Если Не Строка.Свойство("СтраховойРиск") Тогда
			
			Комментарий = "Для справочника не заполнен обязательный реквизит СтраховойРиск";
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Страховые Риски", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			
			Возврат;
			
		КонецЕсли;	
		
		СправочникЭлемент = Справочники.AMS_СтраховыеРиски.НайтиПоРеквизиту("ГУИДЦССУ", Строка.СтраховойРиск); 
		
		Если СправочникЭлемент.Пустая() Тогда 
			
			Если Строка.ЭтоГруппа Тогда
				
				СправочникОбъект = Справочники.AMS_СтраховыеРиски.СоздатьГруппу();
				
			Иначе
				
				СправочникОбъект = Справочники.AMS_СтраховыеРиски.СоздатьЭлемент();
				
			КонецЕсли;	
			
		Иначе
			
			СправочникОбъект = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка, "Наименование");
		
		Если Не Строка.ЭтоГруппа Тогда 
			
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка);
			
		КонецЕсли;
		
		ДозаполнитьОбъектФизЛица(СправочникОбъект, Строка, Строка.ЭтоГруппа);
		
		Попытка
			
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Записать();
			
			Комментарий = СтрШаблон("Успешно записано физические лицо с УИД %1", Строка.СтраховойРиск);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Страховые Риски", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_СтраховыеРиски, СправочникОбъект.Ссылка, Комментарий);
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Страховые Риски", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_СтраховыеРиски, СправочникОбъект.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
		
		Если Строка.ВидыСтрахования.Количество() > 0 Тогда
			
			Справочники.AMS_ВидыСтрахования.ДобавитьРиск(Строка.ВидыСтрахования, СправочникОбъект.Ссылка);
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДозаполнитьОбъектФизЛица(СправочникОбъект, Строка, ЭтоГруппа) 
	
	СправочникОбъект.Родитель = Справочники.AMS_СтраховыеРиски.НайтиПоРеквизиту("ГУИДЦССУ", Строка.Родитель);
	СправочникОбъект.ГУИДЦССУ = Строка.СтраховойРиск;
	СправочникОбъект.ГУИД = Строка.ГУИД;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СправочникОбъект.ВидСтрахования 	= ЭлементСправочникаПоЦССУ("AMS_ВидыСтрахования", Строка.ВидСтрахования);
	СправочникОбъект.ПравилоСтрахования = ЭлементСправочникаПоЦССУ("AMS_ПравилаСтрахования", Строка.ПравилоСтрахования); 
	
	СправочникОбъект.ЭлементарныеРиски.Очистить();
	
	Для Каждого СтрокаЭР Из Строка.ЭлементарныеРиски Цикл
		
		НоваяСтрока = СправочникОбъект.ЭлементарныеРиски.Добавить();
		НоваяСтрока.Риск = ЭлементСправочникаПоЦССУ("AMS_СтраховыеРиски", СтрокаЭР.Риск);
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт

	Результат = ПолучитьСтруктуруСообщения();
	
	ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);	 	 
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	//Данные = СтрЗаменить(Данные, """""", "null");
	 
	Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)
	
	Реквизиты = "ГУИД, Наименование, ПакетРисков";
	ДанныеКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты);	
	
	Результат.guid					 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ГУИД);
	Результат.name 				 	 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Наименование);
	Результат.isElementary 			 = ПреобразоватьЗначениеДляJSON(НЕ ДанныеКП.ПакетРисков);
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "Risk");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	Результат.Вставить("isElementary");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#КонецЕсли