#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТаблицыДокумента();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам = Запрос.Выполнить().Выгрузить();	
	
	СтруктураТаблицДокумента = Новый Структура;
	СтруктураТаблицДокумента.Вставить("AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам", AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам);
	
	ПараметрыПроведения.Вставить("СтруктураТаблицДокумента", СтруктураТаблицДокумента);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаТаблицыДокумента()
	
	Результат = 
	"ВЫБРАТЬ
	|	AMS_ИзменениеУсловийМотивационнойПрограммыВознаграждения.Вознаграждение КАК Процент,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыВознаграждения.Отменено КАК Отменен,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыПоказатели.КлючУсловий КАК КлючУсловий,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыВознаграждения.Ссылка.МотивационнаяПрограмма КАК МотивационнаяПрограмма,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыВознаграждения.КлючСвязи КАК ИдентификаторПравила,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыВознаграждения.ДатаОтмены КАК ДатаОтмены
	|ПОМЕСТИТЬ ВТ_ДанныеПоВознаграждениям
	|ИЗ
	|	Документ.AMS_ИзменениеУсловийМотивационнойПрограммы.Вознаграждения КАК AMS_ИзменениеУсловийМотивационнойПрограммыВознаграждения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ИзменениеУсловийМотивационнойПрограммы.Показатели КАК AMS_ИзменениеУсловийМотивационнойПрограммыПоказатели
	|		ПО AMS_ИзменениеУсловийМотивационнойПрограммыВознаграждения.КлючСвязи = AMS_ИзменениеУсловийМотивационнойПрограммыПоказатели.КлючСвязи
	|ГДЕ
	|	AMS_ИзменениеУсловийМотивационнойПрограммыВознаграждения.Ссылка = &Ссылка
	|	И AMS_ИзменениеУсловийМотивационнойПрограммыПоказатели.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоВознаграждениям.КлючУсловий КАК КлючУсловий,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы.Агент КАК Агент,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы.ДатаНачалаДействия КАК Период,
	|	ВТ_ДанныеПоВознаграждениям.Процент КАК Процент,
	|	ВТ_ДанныеПоВознаграждениям.Отменен КАК Отменен,
	|	ВТ_ДанныеПоВознаграждениям.МотивационнаяПрограмма КАК МотивационнаяПрограмма,
	|	ВТ_ДанныеПоВознаграждениям.ДатаОтмены КАК ДатаОкончанияДействия,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ВТ_ДанныеПоВознаграждениям.ИдентификаторПравила КАК ГУИД,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы.Исключен КАК АгентИсключен,
	|	AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы.ДатаИсключения КАК ДатаИсключения
	|ИЗ
	|	Документ.AMS_ИзменениеУсловийМотивационнойПрограммы.УчастникиПрограммы КАК AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоВознаграждениям КАК ВТ_ДанныеПоВознаграждениям
	|		ПО (ИСТИНА)
	|ГДЕ
	|	AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт

	Результат = Новый Массив;		
	ЗаполнитьСтруктуруСообщенияМАМСУчастники(ОбъектСсылка, Результат);
	ЗаполнитьСтруктуруСообщенияМАМСУсловия(ОбъектСсылка, Результат);
	
	Данные = Новый Массив;
	
	Для каждого СтрокаРезультата Из Результат Цикл
	
		СтрокаДанных = ОбменДаннымиAMS.СформироватьСтрокуJSON(СтрокаРезультата, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	    // СтрокаДанных = СтрЗаменить(СтрокаДанных, """""", "null");
		Данные.Добавить(СтрокаДанных);
		
	КонецЦикла;
		 
	Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМСУчастники(ОбъектСсылка, Результат)
	
	МотивационнаяПрограмма = ОбъектСсылка.МотивационнаяПрограмма.ГУИД;
	Реквизиты = "ГУИД";
	
	Для каждого Участник Из ОбъектСсылка.УчастникиПрограммы Цикл
	
		Сообщение = ПолучитьСтруктуруСообщенияУчастник();
	    ДанныеКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Участник.Агент, Реквизиты);
		
		Сообщение.bonusGuid    = ПреобразоватьЗначениеДляJSON(МотивационнаяПрограмма);
		Сообщение.partnerGuid  = ПреобразоватьЗначениеДляJSON(ДанныеКП.ГУИД);
		Сообщение.excluded	   = ПреобразоватьЗначениеДляJSON(Участник.Исключен);
		
		Результат.Добавить(Сообщение);	
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ЗаполнитьСтруктуруСообщенияМАМСУсловия(ОбъектСсылка, Результат)
	
	МассивУсловий = ПолучитьУсловияМП(ОбъектСсылка);
	ПМИсключение = Константы.AMS_МТСистемаЛояльности.Получить();

	Для каждого Условие Из МассивУсловий Цикл

		Сообщение = ПолучитьСтруктуруСообщенияУсловие();

		Сообщение.bonusGuid      = ПреобразоватьЗначениеДляJSON(Условие.МотивационнаяПрограммаГУИД);
		Сообщение.bonusRuleGuid  = ПреобразоватьЗначениеДляJSON(XMLСтрока(Условие.ГУИД));

		Если ПМИсключение = ОбъектСсылка.МотивационнаяПрограмма Тогда
			Продолжить;
		КонецЕсли;

		Если Условие.КлючУсловий.НаборКлючей.Количество() = 0 Тогда

			//Простое условие
			Для каждого УсловиеКлюча Из Условие.КлючУсловий.НаборУсловий Цикл

				Если УсловиеКлюча.Параметр = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия Тогда

					Продолжить;

				КонецЕсли;

				Если УсловиеКлюча.Параметр = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность Тогда

					Продолжить;

				КонецЕсли;	

				СтруктураОдиночногоУсловия = ПолучитьСтруктуруОдиночногоУсловия();
				СтруктураОдиночногоУсловия.parameterGuid = УсловиеКлюча.Параметр.ГУИД;
				СтруктураОдиночногоУсловия.value		 = ПолучитьЗначение(УсловиеКлюча, УсловиеКлюча.ОператорСравнения);

				Сообщение.basicCondition.Добавить(СтруктураОдиночногоУсловия);

			КонецЦикла;			

		Иначе

			Для каждого Ключ Из Условие.КлючУсловий.НаборКлючей Цикл

				Если Ключ.ОсновнойКлюч Тогда
					Для каждого ЛокальноеУсловие Из Ключ.КлючУсловий.НаборУсловий Цикл

						Если ЛокальноеУсловие.Параметр = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия Тогда

							Продолжить;

						КонецЕсли;
						
						Если ЛокальноеУсловие.Параметр = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						СтруктураОдиночногоУсловия = ПолучитьСтруктуруОдиночногоУсловия();
						СтруктураОдиночногоУсловия.parameterGuid = ЛокальноеУсловие.Параметр.ГУИД;
						СтруктураОдиночногоУсловия.value		 = ПолучитьЗначение(ЛокальноеУсловие, ЛокальноеУсловие.ОператорСравнения);

						Сообщение.basicCondition.Добавить(СтруктураОдиночногоУсловия);

					КонецЦикла;
				Иначе

					СтруктураДополнительногоУсловия = Новый Структура;
					СтруктураДополнительногоУсловия.Вставить("varName", Ключ.КлючУсловий.ИмяПеременной);
					СтруктураДополнительногоУсловия.Вставить("condition", Новый Массив);

					Для каждого ЛокальноеУсловие Из Ключ.КлючУсловий.НаборУсловий Цикл

						Если ЛокальноеУсловие.Параметр = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия Тогда

							Продолжить;

						КонецЕсли;	
						
						Если ЛокальноеУсловие.Параметр = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						СтруктураОдиночногоУсловия = ПолучитьСтруктуруОдиночногоУсловия();
						СтруктураОдиночногоУсловия.parameterGuid = ЛокальноеУсловие.Параметр.ГУИД;
						СтруктураОдиночногоУсловия.value		 = ПолучитьЗначение(ЛокальноеУсловие, ЛокальноеУсловие.ОператорСравнения);

						СтруктураДополнительногоУсловия.condition.Добавить(СтруктураОдиночногоУсловия);

					КонецЦикла;

					Сообщение.additionalCondition.Добавить(СтруктураДополнительногоУсловия);

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;	

		Результат.Добавить(Сообщение);	

	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтруктуруОдиночногоУсловия()
	
	Результат = Новый Структура;
	Результат.Вставить("parameterGuid");
	Результат.Вставить("value");
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьСтруктуруСообщенияУчастник()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "BonusParticipant");
	Результат.Вставить("bonusGuid");
	Результат.Вставить("partnerGuid");
	Результат.Вставить("excluded");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСообщенияУсловие()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "ConditionSets");
	Результат.Вставить("bonusGuid");
	Результат.Вставить("bonusRuleGuid");
	Результат.Вставить("basicCondition", Новый Массив);
	Результат.Вставить("additionalCondition", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьУсловияМП(ОбъектСсылка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.МотивационнаяПрограмма.ГУИД КАК МотивационнаяПрограммаГУИД,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.КлючУсловий КАК КлючУсловий,
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.ГУИД КАК ГУИД
		|ИЗ
		|	РегистрСведений.AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам КАК AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам
		|ГДЕ
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции	

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Возврат AMS_ИнтеграцияМАМССервер.СериализоватьЗначение(Значение);
	
КонецФункции

Функция ПолучитьЗначение(Значение, ВидСравнения)
	
	Если ВидСравнения <> Справочники.AMS_ВидыСравнения.ВСписке
		И ВидСравнения <> Справочники.AMS_ВидыСравнения.НеВСписке Тогда
		
		Возврат AMS_ИнтеграцияМАМССервер.СериализоватьЗначение(Значение.Значение);
		
	КонецЕсли;
	
	СписокЗначений = Значение.ЗначениеПроизвольногоТипа.Получить();
	Результат = "";
	
	Для каждого СтрокаСписка Из СписокЗначений Цикл
	
		Результат = Результат + AMS_ИнтеграцияМАМССервер.СериализоватьЗначение(СтрокаСписка.Значение) + ";";
	
	КонецЦикла;
	
	Результат = Сред(Результат, 1, СтрДлина(Результат) - 1);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли