#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.Записывать = Истина;
	
	AMS_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ПараметрыПроведедения = Документы.AMS_ИзменениеУсловийМотивационнойПрограммы.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	AMS_ПроведениеСервер.ПроведениеПоРегистрам(ЭтотОбъект, ПараметрыПроведедения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти
