#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСогласующихПоЗаявке(Объект) Экспорт
	
	ЗаполнитьСогласующихПоПроцессуСогласования(Объект);
		
КонецПроцедуры	

Процедура СоздатьЗадачиСогласующим(Основание, Согласующий, ВедущаяЗадача) Экспорт
		
	Шаблон = "Задача на согласование Заявки на изменение АД %1 от %2";
	Наименование = СтрШаблон(Шаблон, Основание.Номер, Формат(Основание.Дата, "ДФ=dd.MM.yyyy"));
	
	ОснованиеОбъект = Основание.ПолучитьОбъект();
	
	Для каждого СтрокаСогласующиеЛица Из ОснованиеОбъект.СогласующиеЛица Цикл
		
		Если СтрокаСогласующиеЛица.Роль <> Согласующий Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтрокаСогласующиеЛица.ЗадачаПользователю) Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		ЗадачаОбъект.Исполнитель = СтрокаСогласующиеЛица.Исполнитель;
		ЗадачаОбъект.Дата        = ТекущаяДатаСеанса();
		ЗадачаОбъект.Основание   = Основание;
		ЗадачаОбъект.Наименование = Наименование;
		ЗадачаОбъект.Описание	  = Наименование;
		ЗадачаОбъект.Процесс		   = Справочники.Процессы.УтверждениеЗаявкиНаИзменениеАД;
		ЗадачаОбъект.Записать();
		
		СтрокаСогласующиеЛица.ЗадачаПользователю = ЗадачаОбъект.Ссылка;
		СтрокаСогласующиеЛица.ВедущаяЗадачаПроцесса = ВедущаяЗадача;
		
		СоздатьОповещениеСогласующему(Согласующий, Основание, СтрокаСогласующиеЛица.Исполнитель); 
		
	КонецЦикла;
	ОснованиеОбъект.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьОповещениеСогласующему(Согласующий, Основание, Исполнитель)
	
	Если Согласующий = Справочники.РолиСогласующихЛиц.КураторКаналаПродаж Тогда
		
		Шаблон = Справочники.ШаблоныПисем.СогласованиеКураторомКаналаПродаж;
		
	ИначеЕсли Согласующий = Справочники.РолиСогласующихЛиц.ДиректорФилиала Тогда
		
		Шаблон = Справочники.ШаблоныПисем.СогласованиеДиректоромФилиала;
		
	ИначеЕсли Согласующий = Справочники.РолиСогласующихЛиц.Андеррайтер Тогда
		
		Шаблон = Справочники.ШаблоныПисем.СогласованиеАндеррайтером;	
		
	ИначеЕсли Согласующий = Справочники.РолиСогласующихЛиц.РуководительРегиональнойДирекции Тогда
		
		Шаблон = Справочники.ШаблоныПисем.СогласованиеРуководителемРегиональнойДирекции;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Контекст = Новый Структура("Номер", Основание.Номер);
	СообщенияПользователямКлиентСервер.СоздатьСообщение(Шаблон,
						Исполнитель, Контекст);
		
		
КонецПроцедуры	

Процедура ЗаполнитьСогласующихПоПроцессуСогласования(Объект);
	
	Процесс = Справочники.Процессы.УтверждениеЗаявкиНаИзменениеАД;	
	Если ИсполнителиОпределены(Объект, Процесс) Тогда
		
		Возврат;
		
	КонецЕсли;	
	// Этап Куратор канала продаж
	КураторыКаналаПродаж = КураторыКаналаПродаж(Объект, Процесс);
	ДополнитьСогласующих(Объект, Процесс, Справочники.РолиСогласующихЛиц.КураторКаналаПродаж, КураторыКаналаПродаж);
	
	//Андерайтер
	Андерайтеры = АндерайтерыДляСогласования(Объект, Процесс);
	ДополнитьСогласующих(Объект, Процесс, Справочники.РолиСогласующихЛиц.Андеррайтер, Андерайтеры);
	
	//Директор филиала
	ДиректорФилиала = ДиректорФилиалаДляСогласования(Объект, Процесс);
	ДополнитьСогласующих(Объект, Процесс, Справочники.РолиСогласующихЛиц.ДиректорФилиала, ДиректорФилиала);

	//Руководитель региональной дирекции
	РРД = РРДДляСогласования(Объект, Процесс);
	ДополнитьСогласующих(Объект, Процесс, Справочники.РолиСогласующихЛиц.РуководительРегиональнойДирекции, РРД);
	
КонецПроцедуры	

Функция ИсполнителиОпределены(Объект, Процесс)

	СтрокиПоПроцессу = Объект.СогласующиеЛица.НайтиСтроки(Новый Структура("Процесс", Процесс));
	Возврат СтрокиПоПроцессу.Количество() > 0;
	
КонецФункции	

Процедура ДополнитьСогласующих(Объект, Процесс, Роль, Согласующие);
	
	ДанныеСогласования = Согласующие;
	
	Если ТипЗнч(Согласующие) <> Тип("Массив") Тогда
		
		ДанныеСогласования = Новый Массив;
		ДанныеСогласования.Добавить(Согласующие);
		
	КонецЕсли;	
	
	Для каждого Согласующий Из ДанныеСогласования Цикл
	
		СтрокаСогласования = Объект.СогласующиеЛица.Добавить();	
	    СтрокаСогласования.Процесс = Процесс;
		СтрокаСогласования.Роль	   = Роль;
		СтрокаСогласования.Исполнитель = Согласующий;
		
	КонецЦикла;
	
КонецПроцедуры	

Функция РРДДляСогласования(Объект, Процесс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МаршрутизацияСогласованияИПодписания.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	МаршрутизацияСогласованияИПодписания.РольИсполнителя = &РольИсполнителя
		|	И МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|	И МаршрутизацияСогласованияИПодписания.РегиональнаяДирекция = &РегиональнаяДирекция";
	
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("РольИсполнителя", Справочники.РолиСогласующихЛиц.РуководительРегиональнойДирекции);
	Запрос.УстановитьПараметр("РегиональнаяДирекция", Объект.Филиал.Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Сотрудник;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();	

КонецФункции

Функция ДиректорФилиалаДляСогласования(Объект, Процесс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МаршрутизацияСогласованияИПодписания.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	МаршрутизацияСогласованияИПодписания.РольИсполнителя = &РольИсполнителя
		|	И МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|	И МаршрутизацияСогласованияИПодписания.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("РольИсполнителя", Справочники.РолиСогласующихЛиц.ДиректорФилиала);
	Запрос.УстановитьПараметр("Филиал", Объект.Филиал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Сотрудник;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();	

КонецФункции	

Функция АндерайтерыДляСогласования(Объект, Процесс)
	
	Результат = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаИзменениеАДСтраховыеПродукты.СтраховойПродукт КАК СтраховойПродукт,
		|	МАКСИМУМ(ЗаявкаНаИзменениеАДСтраховыеПродукты.Процент) КАК Процент
		|ИЗ
		|	Документ.ЗаявкаНаИзменениеАД.СтраховыеПродукты КАК ЗаявкаНаИзменениеАДСтраховыеПродукты
		|ГДЕ
		|	ЗаявкаНаИзменениеАДСтраховыеПродукты.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаИзменениеАДСтраховыеПродукты.СтраховойПродукт";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПроверкаПоЛимитам = БизнесПроцессы
				.СогласованиеУсловийВознаграждения
				.НеобходимостьСогласованияПродукта(ВыборкаДетальныеЗаписи.СтраховойПродукт, ВыборкаДетальныеЗаписи.Процент, Объект.Агент);
				
				Если ПроверкаПоЛимитам Тогда
					
					Продолжить;
					
				КонецЕсли;	
		
		ВидПродукта		 = ВыборкаДетальныеЗаписи.СтраховойПродукт.ВидСтраховогоПродукта;
		Лимит            = ВыборкаДетальныеЗаписи.Процент;
		Исполнитель      = ИсполнительПоВидуПродукта(Объект, Процесс, ВидПродукта, Лимит); 
		
		Если Результат.Найти(Исполнитель) = Неопределено Тогда
			
			Результат.Добавить(Исполнитель);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

Функция ИсполнительПоВидуПродукта(Объект, Процесс, ВидПродукта, Лимит)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутизацияСогласованияИПодписания.Сотрудник КАК Сотрудник,
		|	10 КАК Приоритет
		|ПОМЕСТИТЬ ВТ_Согласующие
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Лимит < МаршрутизацияСогласованияИПодписания.ЛимитСогласования
		|					И МаршрутизацияСогласованияИПодписания.ЛимитСогласования <> 0
		|				ТОГДА МаршрутизацияСогласованияИПодписания.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиСогласующихЛиц.Андеррайтер)
		|			ИНАЧЕ МаршрутизацияСогласованияИПодписания.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиСогласующихЛиц.УправляющийПродуктом)
		|		КОНЕЦ
		|	И МаршрутизацияСогласованияИПодписания.ВидСтраховогоПродукта = &ВидСтраховогоПродукта
		|	И МаршрутизацияСогласованияИПодписания.Филиал = &Филиал
		|	И МаршрутизацияСогласованияИПодписания.РегиональнаяДирекция = &РегиональнаяДирекция
		|	И МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаршрутизацияСогласованияИПодписания.Сотрудник,
		|	20
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Лимит < МаршрутизацияСогласованияИПодписания.ЛимитСогласования
		|					И МаршрутизацияСогласованияИПодписания.ЛимитСогласования <> 0
		|				ТОГДА МаршрутизацияСогласованияИПодписания.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиСогласующихЛиц.Андеррайтер)
		|			ИНАЧЕ МаршрутизацияСогласованияИПодписания.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиСогласующихЛиц.УправляющийПродуктом)
		|		КОНЕЦ
		|	И МаршрутизацияСогласованияИПодписания.ВидСтраховогоПродукта = &ВидСтраховогоПродукта
		|	И МаршрутизацияСогласованияИПодписания.Филиал = &Филиал
		|	И МаршрутизацияСогласованияИПодписания.РегиональнаяДирекция = ЗНАЧЕНИЕ(Справочник.AMS_РегиональныеГруппы.ПУстаяСсылка)
		|	И МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаршрутизацияСогласованияИПодписания.Сотрудник,
		|	30
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Лимит < МаршрутизацияСогласованияИПодписания.ЛимитСогласования
		|					И МаршрутизацияСогласованияИПодписания.ЛимитСогласования <> 0
		|				ТОГДА МаршрутизацияСогласованияИПодписания.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиСогласующихЛиц.Андеррайтер)
		|			ИНАЧЕ МаршрутизацияСогласованияИПодписания.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиСогласующихЛиц.УправляющийПродуктом)
		|		КОНЕЦ
		|	И МаршрутизацияСогласованияИПодписания.ВидСтраховогоПродукта = &ВидСтраховогоПродукта
		|	И МаршрутизацияСогласованияИПодписания.Филиал = ЗНАЧЕНИЕ(Справочник.AMS_Филиалы.ПУстаяСсылка)
		|	И МаршрутизацияСогласованияИПодписания.РегиональнаяДирекция = ЗНАЧЕНИЕ(Справочник.AMS_РегиональныеГруппы.ПУстаяСсылка)
		|	И МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_Согласующие.Сотрудник КАК Сотрудник,
		|	ВТ_Согласующие.Приоритет КАК Приоритет
		|ИЗ
		|	ВТ_Согласующие КАК ВТ_Согласующие
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("ВидСтраховогоПродукта", ВидПродукта);
	Запрос.УстановитьПараметр("Лимит", Лимит);
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("Филиал", Объект.Филиал);
	Запрос.УстановитьПараметр("РегиональнаяДирекция", Объект.Филиал.Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Сотрудник;
	КонецЕсли;;
	
	Возврат Неопределено;

КонецФункции	

Функция КураторыКаналаПродаж(Объект, Процесс)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутизацияСогласованияИПодписания.Сотрудник КАК Сотрудник,
		|	10 КАК Приоритет
		|ПОМЕСТИТЬ ВТ_ВозможныеИсполнители
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|	И МаршрутизацияСогласованияИПодписания.РольИсполнителя = &РольИсполнителя
		|	И МаршрутизацияСогласованияИПодписания.КаналПродаж = &КаналПродаж
		|	И МаршрутизацияСогласованияИПодписания.Филиал = &Филиал
		|	И МаршрутизацияСогласованияИПодписания.РегиональнаяДирекция = &РегиональнаяДирекция
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаршрутизацияСогласованияИПодписания.Сотрудник,
		|	20
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|	И МаршрутизацияСогласованияИПодписания.РольИсполнителя = &РольИсполнителя
		|	И МаршрутизацияСогласованияИПодписания.КаналПродаж = &КаналПродаж
		|	И МаршрутизацияСогласованияИПодписания.Филиал = &Филиал
		|	И МаршрутизацияСогласованияИПодписания.РегиональнаяДирекция = ЗНАЧЕНИЕ(Справочник.AMS_РегиональныеГруппы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаршрутизацияСогласованияИПодписания.Сотрудник,
		|	30
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|	И МаршрутизацияСогласованияИПодписания.РольИсполнителя = &РольИсполнителя
		|	И МаршрутизацияСогласованияИПодписания.КаналПродаж = &КаналПродаж
		|	И МаршрутизацияСогласованияИПодписания.Филиал = ЗНАЧЕНИЕ(Справочник.AMS_Филиалы.ПустаяСсылка)
		|	И МаршрутизацияСогласованияИПодписания.РегиональнаяДирекция = ЗНАЧЕНИЕ(Справочник.AMS_РегиональныеГруппы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаршрутизацияСогласованияИПодписания.Сотрудник,
		|	40
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|	И МаршрутизацияСогласованияИПодписания.РольИсполнителя = &РольИсполнителя
		|	И МаршрутизацияСогласованияИПодписания.КаналПродаж = ЗНАЧЕНИЕ(Справочник.AMS_КаналыПродаж.ПустаяСсылка)
		|	И МаршрутизацияСогласованияИПодписания.Филиал = ЗНАЧЕНИЕ(Справочник.AMS_Филиалы.ПустаяСсылка)
		|	И МаршрутизацияСогласованияИПодписания.РегиональнаяДирекция = ЗНАЧЕНИЕ(Справочник.AMS_РегиональныеГруппы.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ВозможныеИсполнители.Сотрудник КАК Сотрудник,
		|	ВТ_ВозможныеИсполнители.Приоритет КАК Приоритет
		|ИЗ
		|	ВТ_ВозможныеИсполнители КАК ВТ_ВозможныеИсполнители
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("РольИсполнителя", Справочники.РолиСогласующихЛиц.КураторКаналаПродаж);
	Запрос.УстановитьПараметр("КаналПродаж", Объект.КаналПродаж);
	Запрос.УстановитьПараметр("Филиал", Объект.Филиал);
	Запрос.УстановитьПараметр("РегиональнаяДирекция", Объект.Филиал.Владелец);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	Возврат Результат;
		
КонецФункции	

#КонецОбласти


