#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидНеРавно = ВидСравненияКомпоновкиДанных.НеРавно;
	ЗначениеОтбора = Перечисления.СтатусШтатногоСотрудника.Увольнение;
	Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список
																			,"СтатусСотрудника"
																			,ЗначениеОтбора
																			,ВидНеРавно
																			,
																			,Истина
																			,Режим
																			,Неопределено); 

КонецПроцедуры

#КонецОбласти 

