///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при снятии блокировки работы с внешними ресурсами.
// Для включения работы механизмов, отключенных в процедуре ПриЗапретеРаботыСВнешнимиРесурсами.
//
Процедура ПриРазрешенииРаботыСВнешнимиРесурсами() Экспорт
	
КонецПроцедуры

// Вызывается при установке блокировки работы с внешними ресурсами.
// Позволяет отключить произвольные механизмы, работа
// которых в копии информационной базы недопустима.
//
Процедура ПриЗапретеРаботыСВнешнимиРесурсами() Экспорт
	
	Совпадают = СтрокаСоединенияИнформационнойБазы() = Константы.AMS_ЭтоПродуктивнаяБаза.Получить();
	
	Если Не Совпадают Тогда 
		
		ВсеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
		
		Для Каждого РегламентноеЗадание Из ВсеРегламентныеЗадания Цикл
			
			Попытка
				
				РегламентноеЗадание.Использование = Ложь;
				РегламентноеЗадание.Записать();
				
			Исключение;
				Комментарий = РегламентноеЗадание + ": " + ИнформацияОбОшибке();
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("РегламентноеЗадание", УровеньЖурналаРегистрации.Ошибка,,,Комментарий);
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти