#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЭтоПродавецИсключение(Продавец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ПродавцыИсключенияДляВидимостиInsapp.Продавец КАК Продавец
		|ИЗ
		|	РегистрСведений.AMS_ПродавцыИсключенияДляВидимостиInsapp КАК AMS_ПродавцыИсключенияДляВидимостиInsapp
		|ГДЕ
		|	AMS_ПродавцыИсключенияДляВидимостиInsapp.Продавец = &Продавец";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции	

#КонецОбласти

#КонецЕсли