#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфей

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	Идентификаторы				 = ИдентификаторыПредопределенныхДанныхГУИД();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		ВидыСравненияОбъект							 = КлючЗначение.Ключ.ПолучитьОбъект();
		ВидыСравненияОбъект.РеквизитВДругихСистемах	 = КлючЗначение.Значение;
		ВидыСравненияОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ИдентификаторыПредопределенныхДанныхГУИД()

	Результат = Новый Соответствие;
	Результат.Вставить(Справочники.УсловияУчастияВРейтингах.СуммаДоговоровБольшеИлиРавна, "ALL_CRITERIA_COUNT_SUM_MORE_THAN");
	Результат.Вставить(Справочники.УсловияУчастияВРейтингах.СуммаБаловБольшеИлиРавна, "ALL_CRITERIA_EARNED_POINT_SUM_MORE_THAN");
	Результат.Вставить(Справочники.УсловияУчастияВРейтингах.СуммаСборовБольшеИлиРавна, "ALL_CRITERIA_PREMIUM_SUM_MORE_THAN");
	Результат.Вставить(Справочники.УсловияУчастияВРейтингах.КоличествоДоговоровПоКритериюБольшеИлиРавна, "ITEM_CRITERIA_COUNT_MORE_THAN");
	Результат.Вставить(Справочники.УсловияУчастияВРейтингах.КоличествоБаловПоКритериюБольшеИлиРавна, "ITEM_CRITERIA_EARNED_POINTS_MORE_THAN");
	Результат.Вставить(Справочники.УсловияУчастияВРейтингах.СборыПоКритериюБольшеИлиРавно, "ITEM_CRITERIA_PREMIUM_MORE_THAN");
	
	Возврат Результат;
	
КонецФункции	
	
#КонецЕсли