#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииИсточниковДанныхПечати
Процедура ПриОпределенииИсточниковДанныхПечати(Объект, ИсточникиДанныхПечати) Экспорт
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
				
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//  Параметры                  - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ОтзывСогласияНаОбработкуПерсональныхДанных.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
//  Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.AMS_ИзмененияДанныхПродавцов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПроведениеДокумента

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТаблицыДокумента();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	AMS_ОбщиеПравилаРасчетаКВ = Запрос.Выполнить().Выгрузить();	
	
	СтруктураТаблицДокумента = Новый Структура;
	СтруктураТаблицДокумента.Вставить("AMS_ОбщиеПравилаРасчетаКВ", AMS_ОбщиеПравилаРасчетаКВ);
	
	ПараметрыПроведения.Вставить("СтруктураТаблицДокумента", СтруктураТаблицДокумента);
	
	Возврат ПараметрыПроведения;
	
КонецФункции	

Функция ТекстЗапросаТаблицыДокумента()
	
	Результат = 
	"ВЫБРАТЬ
	|	AMS_ИзменениеКВОбщееСтраховыеПродукты.СтраховойПродукт КАК СтраховойПродукт,
	|	AMS_ИзменениеКВОбщееСтраховыеПродукты.СтраховойРиск КАК СтраховойРиск,
	|	AMS_ИзменениеКВОбщееСтраховыеПродукты.Ссылка КАК Ссылка,
	|	AMS_ИзменениеКВОбщееСтраховыеПродукты.Процент КАК Процент,
	|	AMS_ИзменениеКВОбщееСтраховыеПродукты.Отменен КАК Отменен,
	|	AMS_ИзменениеКВОбщееСтраховыеПродукты.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	AMS_ИзменениеКВОбщееПоказатели.КлючУсловий КАК КлючУсловий,
	|	AMS_ИзменениеКВОбщееПоказатели.КлючСвязи КАК ГУИД,
	|	AMS_ИзменениеКВОбщееСтраховыеПродукты.ДатаНачалаДействия КАК ДатаНачалаДействия
	|ПОМЕСТИТЬ ВТ_ДанныеПоСтраховымПродуктам
	|ИЗ
	|	Документ.AMS_ИзменениеКВОбщее.СтраховыеПродукты КАК AMS_ИзменениеКВОбщееСтраховыеПродукты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ИзменениеКВОбщее.Показатели КАК AMS_ИзменениеКВОбщееПоказатели
	|		ПО AMS_ИзменениеКВОбщееСтраховыеПродукты.КлючСвязи = AMS_ИзменениеКВОбщееПоказатели.КлючСвязи
	|ГДЕ
	|	AMS_ИзменениеКВОбщееПоказатели.Ссылка = &Ссылка
	|	И AMS_ИзменениеКВОбщееСтраховыеПродукты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AMS_ИзменениеКВОбщее.Филиал КАК Филиал,
	|	AMS_ИзменениеКВОбщее.КаналПродаж КАК КаналПродаж,
	|	AMS_ИзменениеКВОбщее.ПодканалПродаж КАК ПодканалПродаж,
	|	AMS_ИзменениеКВОбщее.КатегорияПродавца КАК КатегорияПродавца,
	|	AMS_ИзменениеКВОбщее.Дата КАК Период,
	|	ВТ_ДанныеПоСтраховымПродуктам.СтраховойПродукт КАК СтраховойПродукт,
	|	ВТ_ДанныеПоСтраховымПродуктам.СтраховойРиск КАК СтраховойРиск,
	|	ВТ_ДанныеПоСтраховымПродуктам.Процент КАК Процент,
	|	ВТ_ДанныеПоСтраховымПродуктам.Отменен КАК Отменен,
	|	ВТ_ДанныеПоСтраховымПродуктам.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ВТ_ДанныеПоСтраховымПродуктам.КлючУсловий КАК КлючУсловий,
	|	ВТ_ДанныеПоСтраховымПродуктам.ГУИД КАК ГУИД,
	|	ВТ_ДанныеПоСтраховымПродуктам.ДатаНачалаДействия КАК ДатаНачалаДействия
	|ИЗ
	|	ВТ_ДанныеПоСтраховымПродуктам КАК ВТ_ДанныеПоСтраховымПродуктам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ИзменениеКВОбщее КАК AMS_ИзменениеКВОбщее
	|		ПО ВТ_ДанныеПоСтраховымПродуктам.Ссылка = AMS_ИзменениеКВОбщее.Ссылка";
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

Процедура СформироватьИзменитьЭлементСправочника(ОписаниеОбъектов) Экспорт
	
	Если ОписаниеОбъектов.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТаблицаОбъекта = AMS_КомиссионноеВознаграждение.ПреобразоватьСообщениеЦССУВТаблицуЗначений(ОписаниеОбъектов);

	Если ТаблицаОбъекта.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДополнительноеКВ = ТаблицаОбъекта[0].ДополнительноеКВ;
	Если ДополнительноеКВ Тогда
		
		Документы.AMS_ИзменениеДополнительногоКВОбщее.СформироватьИзменитьЭлементСправочника(ОписаниеОбъектов);
		Возврат;
		
	КонецЕсли;	
	
	
	ТаблицаАгентов = ТаблицаОбъекта.Скопировать(, "Агент"); 
	ТаблицаАгентов.Свернуть("Агент");
	
	ЭтоИндивидуальноеКВ = Ложь;
	
	Если ТаблицаАгентов.Количество() >= 1 Тогда
		
		Агент = ЭлементСправочникаПоЦССУ("AMS_Агенты", ТаблицаАгентов[0].Агент);
		Если ЗначениеЗаполнено(Агент) Тогда
			ЭтоИндивидуальноеКВ = Истина;
		КонецЕсли;
		
	КонецЕсли;	 
	
	Если ЭтоИндивидуальноеКВ Тогда
		
		СоздатьДокументИндивидуальногоКВ(ТаблицаОбъекта);
		
	Иначе
		
		СоздатьДокументОбщегоКВ(ТаблицаОбъекта);
		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокументИндивидуальногоКВ(ТаблицаОбъекта)

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаИндивидуальноеКВ();	
	Запрос.УстановитьПараметр("ВходящиеДанные", ТаблицаОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаАгент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаАгент.Следующий() Цикл
		
		 Агент = ЭлементСправочникаПоЦССУ("AMS_Агенты", ВыборкаАгент.Агент);
		 ДокументОбъект = Документы.AMS_ИзменениеКВИндивидуальное.СоздатьДокумент();
		 ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ВыборкаАгент.Дата), ВыборкаАгент.Дата, ТекущаяДатаСеанса());
		 ДокументОбъект.ГУИДЦССУ = ВыборкаАгент.ГУИД;
		 ДокументОбъект.Агент    = Агент;
		 ДокументОбъект.Организация = Константы.AMS_ОрганизацияПоУмолчанию.Получить();
		 ДокументОбъект.ЭтоКВБанка  = ВыборкаАгент.ЭтоБанк;
		 
		 ВыборкаСтраховойПродукт = ВыборкаАгент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		 
		 ЗаполнитьДокументКВ(ВыборкаСтраховойПродукт, ДокументОбъект);
		 Попытка
			 ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		 Исключение
			 ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		 КонецПопытки;	 
	КонецЦикла;	
	
КонецПроцедуры

Процедура СоздатьДокументОбщегоКВ(ТаблицаОбъекта)

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОбщееКВ();	
	Запрос.УстановитьПараметр("ВходящиеДанные", ТаблицаОбъекта);
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаФилиал = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаФилиал.Следующий() Цикл
		Филиал = ЭлементСправочникаПоЦССУ("AMS_Филиалы", ВыборкаФилиал.Филиал);

		ВыборкаКаналПродаж = ВыборкаФилиал.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКаналПродаж.Следующий() Цикл

			КаналПродаж = Справочники.AMS_КаналыПродаж.НайтиПоРеквизиту("ГУИДЦССУ", ВыборкаКаналПродаж.КаналПродаж);

			ВыборкаПодканал = ВыборкаКаналПродаж.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			Пока ВыборкаПодканал.Следующий() Цикл

				ПодканалПродаж = Справочники.AMS_КаналыПродаж.НайтиПоРеквизиту("ГУИДЦССУ", ВыборкаПодканал.ПодканалПродаж);

				ВыборкаКатегория = ВыборкаПодканал.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

				Пока ВыборкаКатегория.Следующий() Цикл

					Категория = ЭлементСправочникаПоЦССУ("AMS_КатегорииПродавца", ВыборкаКатегория.КатегорияПродавца);

					ДокументОбъект = Документы.AMS_ИзменениеКВОбщее.СоздатьДокумент();
					ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ВыборкаФилиал.Дата), ВыборкаФилиал.Дата, ТекущаяДатаСеанса());
					ДокументОбъект.ГУИДЦССУ = ВыборкаФилиал.ГУИД;
					ДокументОбъект.Филиал    			= Филиал;
					ДокументОбъект.КаналПродаж   		= КаналПродаж;
					ДокументОбъект.ПодканалПродаж    	= ПодканалПродаж;
					ДокументОбъект.КатегорияПродавца    = Категория;

					ДокументОбъект.Организация = Константы.AMS_ОрганизацияПоУмолчанию.Получить();

					ВыборкаСтраховойПродукт = ВыборкаКатегория.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

					ЗаполнитьДокументКВ(ВыборкаСтраховойПродукт, ДокументОбъект);
					Попытка
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;

				КонецЦикла; 

			КонецЦикла;	 

		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры	

Процедура ЗаполнитьДокументКВ(ВыборкаСтраховойПродукт, ДокументОбъект)

	Пока ВыборкаСтраховойПродукт.Следующий() Цикл
		
		ВыборкаПроцент = ВыборкаСтраховойПродукт.Выбрать();
		
		Пока ВыборкаПроцент.Следующий() Цикл
			
			Если ВыборкаПроцент.Процент = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;	
			
			ИдентификаторСтроки = XMLСтрока(Новый УникальныйИдентификатор);
			
			// Страховой продукт
			СтрокаСП = ДокументОбъект.СтраховыеПродукты.Добавить();
			СтрокаСП.СтраховойПродукт = ЭлементСправочникаПоЦССУ("AMS_СтраховыеПродукты", ВыборкаПроцент.СтраховойПродукт);
			СтрокаСП.КлючСвязи = ИдентификаторСтроки;
			
						
			СтрокаСП.Процент = ВыборкаПроцент.Процент;
			СтрокаСП.ДатаОкончанияДействия = ВыборкаПроцент.ДатаОкончанияДействия;
			СтрокаСП.ДатаНачалаДействия    = ДокументОбъект.Дата;
			//Условия
			МассивУсловий = Новый Массив;
			ОбработатьУсловие(МассивУсловий, ВыборкаПроцент, "КБМОт", ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КБМ, "Число"); 
			ОбработатьУсловие(МассивУсловий, ВыборкаПроцент, "ПремияОт", ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия, "Число");
			ОбработатьУсловие(МассивУсловий, ВыборкаПроцент, "ГодСтрахования", ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ГодСтрахования, "Число");
			ОбработатьУсловие(МассивУсловий, ВыборкаПроцент, "КатегорияДоговора", ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КатегорияДоговора, "AMS_КатегорииДоговоров");
			// ОбработатьУсловие(МассивУсловий, ВыборкаПроцент, "СтраховойПродукт", ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойПродукт, "AMS_СтраховыеПродукты");
			ОбработатьУсловие(МассивУсловий, ВыборкаПроцент, "СтраховойРиск", ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойРиск, "AMS_СтраховыеРиски");
			ОбработатьУсловие(МассивУсловий, ВыборкаПроцент, "ЭтоЭлектронноеОсаго", ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЭтоЕОСАГО, "Булево");
			
			Если ЗначениеЗаполнено(ВыборкаПроцент.БанкИНН)
				И ВыборкаПроцент.БанкИНН <> "00000000-0000-0000-0000-000000000000" Тогда
				
				НовоеУсловие = AMS_КлючиУсловийСервер.Условие();
				НовоеУсловие.Параметр = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк;
				НовоеУсловие.Значение = ВыборкаПроцент.БанкИНН;
				МассивУсловий.Добавить(НовоеУсловие);
				
			КонецЕсли;	
			
			КлючУсловий = AMS_КлючиУсловийСервер.ЭлементКлючаУсловий(МассивУсловий);
			
			СтрокаУсловий = ДокументОбъект.Показатели.Добавить();
			СтрокаУсловий.КлючСвязи = ИдентификаторСтроки;
			СтрокаУсловий.КлючУсловий = КлючУсловий;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьУсловие(МассивУсловий, ВыборкаДетали, Реквизит, Характеристика, Тип)
	
	Элемент = ВыборкаДетали[Реквизит]; 
	ЭлементСсылка = ЭлементСправочникаПоЦССУ(Тип, Элемент);
	
	Если ТипЗнч(ЭлементСсылка) = Тип("Булево") 
		И НЕ ЭлементСсылка Тогда
		Возврат;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
			
			НовоеУсловие = AMS_КлючиУсловийСервер.Условие();
			НовоеУсловие.Параметр = Характеристика;
			НовоеУсловие.Значение = ЭлементСсылка;
			МассивУсловий.Добавить(НовоеУсловие);
			
	КонецЕсли;
		
КонецПроцедуры	

Функция ТекстЗапросаОбщееКВ()
	Результат = 
	"ВЫБРАТЬ
	|	ВходящиеДанные.Процент КАК Процент,
	|	ВходящиеДанные.Отменен КАК Отменен,
	|	ВходящиеДанные.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ВходящиеДанные.ГУИД КАК ГУИД,
	|	ВходящиеДанные.Проведен КАК Проведен,
	|	ВходящиеДанные.ВидПродукта КАК ВидПродукта,
	|	ВходящиеДанные.Агент КАК Агент,
	|	ВходящиеДанные.ЭтоБанк КАК ЭтоБанк,
	|	ВходящиеДанные.ПодканалПродаж КАК ПодканалПродаж,
	|	ВходящиеДанные.КатегорияПродавца КАК КатегорияПродавца,
	|	ВходящиеДанные.КБМОт КАК КБМОт,
	|	ВходящиеДанные.ПремияОт КАК ПремияОт,
	|	ВходящиеДанные.БанкИНН КАК БанкИНН,
	|	ВходящиеДанные.ГодСтрахования КАК ГодСтрахования,
	|	ВходящиеДанные.Филиал КАК Филиал,
	|	ВходящиеДанные.КатегорияДоговора КАК КатегорияДоговора,
	|	ВходящиеДанные.СтраховойПродукт КАК СтраховойПродукт,
	|	ВходящиеДанные.СтраховойРиск КАК СтраховойРиск,
	|	ВходящиеДанные.КаналПродаж КАК КаналПродаж,
	|	ВходящиеДанные.ЭтоЭлектронноеОсаго КАК ЭтоЭлектронноеОсаго,
	|	ВходящиеДанные.ДополнительноеКВ КАК ДополнительноеКВ,
	|	ВходящиеДанные.Ссылка КАК Ссылка,
	|	ВходящиеДанные.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ВходящиеДанные
	|ИЗ
	|	&ВходящиеДанные КАК ВходящиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВходящиеДанные.Процент КАК Процент,
	|	ВТ_ВходящиеДанные.Отменен КАК Отменен,
	|	ВТ_ВходящиеДанные.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ВТ_ВходящиеДанные.ГУИД КАК ГУИД,
	|	ВТ_ВходящиеДанные.Проведен КАК Проведен,
	|	ВТ_ВходящиеДанные.ВидПродукта КАК ВидПродукта,
	|	ВТ_ВходящиеДанные.Агент КАК Агент,
	|	ВТ_ВходящиеДанные.ЭтоБанк КАК ЭтоБанк,
	|	ВТ_ВходящиеДанные.ПодканалПродаж КАК ПодканалПродаж,
	|	ВТ_ВходящиеДанные.КатегорияПродавца КАК КатегорияПродавца,
	|	ВТ_ВходящиеДанные.КБМОт КАК КБМОт,
	|	ВТ_ВходящиеДанные.ПремияОт КАК ПремияОт,
	|	ВТ_ВходящиеДанные.БанкИНН КАК БанкИНН,
	|	ВТ_ВходящиеДанные.ГодСтрахования КАК ГодСтрахования,
	|	ВТ_ВходящиеДанные.Филиал КАК Филиал,
	|	ВТ_ВходящиеДанные.КатегорияДоговора КАК КатегорияДоговора,
	|	ВТ_ВходящиеДанные.СтраховойПродукт КАК СтраховойПродукт,
	|	ВТ_ВходящиеДанные.СтраховойРиск КАК СтраховойРиск,
	|	ВТ_ВходящиеДанные.КаналПродаж КАК КаналПродаж,
	|	ВТ_ВходящиеДанные.ЭтоЭлектронноеОсаго КАК ЭтоЭлектронноеОсаго,
	|	ВТ_ВходящиеДанные.ДополнительноеКВ КАК ДополнительноеКВ,
	|	ВТ_ВходящиеДанные.Ссылка КАК Ссылка,
	|	ВТ_ВходящиеДанные.Дата КАК Дата
	|ИЗ
	|	ВТ_ВходящиеДанные КАК ВТ_ВходящиеДанные
	|ИТОГИ
	|	МАКСИМУМ(ГУИД),
	|	МАКСИМУМ(Дата)
	|ПО
	|	Филиал,
	|	КаналПродаж,
	|	ПодканалПродаж,
	|	КатегорияПродавца,
	|	СтраховойПродукт";
	
	Возврат Результат;	
	
КонецФункции

Функция ТекстЗапросаИндивидуальноеКВ()
	Результат = 
	"ВЫБРАТЬ
	|	ВходящиеДанные.Процент КАК Процент,
	|	ВходящиеДанные.Отменен КАК Отменен,
	|	ВходящиеДанные.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ВходящиеДанные.ГУИД КАК ГУИД,
	|	ВходящиеДанные.Проведен КАК Проведен,
	|	ВходящиеДанные.ВидПродукта КАК ВидПродукта,
	|	ВходящиеДанные.Агент КАК Агент,
	|	ВходящиеДанные.ЭтоБанк КАК ЭтоБанк,
	|	ВходящиеДанные.ПодканалПродаж КАК ПодканалПродаж,
	|	ВходящиеДанные.КатегорияПродавца КАК КатегорияПродавца,
	|	ВходящиеДанные.КБМОт КАК КБМОт,
	|	ВходящиеДанные.ПремияОт КАК ПремияОт,
	|	ВходящиеДанные.БанкИНН КАК БанкИНН,
	|	ВходящиеДанные.ГодСтрахования КАК ГодСтрахования,
	|	ВходящиеДанные.Филиал КАК Филиал,
	|	ВходящиеДанные.КатегорияДоговора КАК КатегорияДоговора,
	|	ВходящиеДанные.СтраховойПродукт КАК СтраховойПродукт,
	|	ВходящиеДанные.СтраховойРиск КАК СтраховойРиск,
	|	ВходящиеДанные.КаналПродаж КАК КаналПродаж,
	|	ВходящиеДанные.ЭтоЭлектронноеОсаго КАК ЭтоЭлектронноеОсаго,
	|	ВходящиеДанные.ДополнительноеКВ КАК ДополнительноеКВ,
	|	ВходящиеДанные.Ссылка КАК Ссылка,
	|	ВходящиеДанные.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ВходящиеДанные
	|ИЗ
	|	&ВходящиеДанные КАК ВходящиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВходящиеДанные.Процент КАК Процент,
	|	ВТ_ВходящиеДанные.Отменен КАК Отменен,
	|	ВТ_ВходящиеДанные.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ВТ_ВходящиеДанные.ГУИД КАК ГУИД,
	|	ВТ_ВходящиеДанные.Проведен КАК Проведен,
	|	ВТ_ВходящиеДанные.ВидПродукта КАК ВидПродукта,
	|	ВТ_ВходящиеДанные.Агент КАК Агент,
	|	ВТ_ВходящиеДанные.ЭтоБанк КАК ЭтоБанк,
	|	ВТ_ВходящиеДанные.ПодканалПродаж КАК ПодканалПродаж,
	|	ВТ_ВходящиеДанные.КатегорияПродавца КАК КатегорияПродавца,
	|	ВТ_ВходящиеДанные.КБМОт КАК КБМОт,
	|	ВТ_ВходящиеДанные.ПремияОт КАК ПремияОт,
	|	ВТ_ВходящиеДанные.БанкИНН КАК БанкИНН,
	|	ВТ_ВходящиеДанные.ГодСтрахования КАК ГодСтрахования,
	|	ВТ_ВходящиеДанные.Филиал КАК Филиал,
	|	ВТ_ВходящиеДанные.КатегорияДоговора КАК КатегорияДоговора,
	|	ВТ_ВходящиеДанные.СтраховойПродукт КАК СтраховойПродукт,
	|	ВТ_ВходящиеДанные.СтраховойРиск КАК СтраховойРиск,
	|	ВТ_ВходящиеДанные.КаналПродаж КАК КаналПродаж,
	|	ВТ_ВходящиеДанные.ЭтоЭлектронноеОсаго КАК ЭтоЭлектронноеОсаго,
	|	ВТ_ВходящиеДанные.ДополнительноеКВ КАК ДополнительноеКВ,
	|	ВТ_ВходящиеДанные.Ссылка КАК Ссылка,
	|	ВТ_ВходящиеДанные.Дата КАК Дата,
	|	ВТ_ВходящиеДанные.Процент КАК Процент1
	|ИЗ
	|	ВТ_ВходящиеДанные КАК ВТ_ВходящиеДанные
	|ИТОГИ
	|	МАКСИМУМ(ГУИД),
	|	МАКСИМУМ(ЭтоБанк),
	|	МАКСИМУМ(Дата)
	|ПО
	|	Агент,
	|	СтраховойПродукт";
	
	Возврат Результат;	
	
КонецФункции	
	
#КонецОбласти

#КонецЕсли