
#Область ОбработчикиСобытий  

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.AMS_ОбщиеПравилаРасчетаКВ.Записывать = Истина;
	
	AMS_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ПараметрыПроведедения = Документы.AMS_ИзменениеКВОбщее.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	AMS_ПроведениеСервер.ПроведениеПоРегистрам(ЭтотОбъект, ПараметрыПроведедения); 
	AMS_АктуализацияКВПоИпотеке.СформироватьЗаписиАктуальногоКВ(Ссылка);
	
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//ВидПродукта = Перечисления.AMS_ВидыСтраховыхПродуктов.ОСАГО;
	//Ответственный = Пользователи.ТекущийПользователь();
	//Организация = Константы.AMS_ОрганизацияПоУмолчанию.Получить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();	

КонецПроцедуры

#КонецОбласти
