#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт
	
	Результат = Новый Массив;
	
	ЗаполнитьДанныеСтатусыАгентов(ОбъектСсылка, Результат);
	
	Возврат Результат;
	
КонецФункции	

#Область СообщениеДляМАМС

Функция ПолучитьСтруктуруСообщенияИнструментыСтатусыАгентов()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "AgentStatusTools");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	Результат.Вставить("description");
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДанныеСтатусыАгентов(ОбъектСсылка, Результат)
	
	ИнструментыСтатусыАгентов 			 = ПолучитьСтруктуруСообщенияИнструментыСтатусыАгентов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнструментыСтатусовАгентов.ГУИД КАК guid,
		|	ИнструментыСтатусовАгентов.Наименование КАК name,
		|	ИнструментыСтатусовАгентов.Описание КАК description
		|ИЗ
		|	Справочник.ИнструментыСтатусовАгентов КАК ИнструментыСтатусовАгентов
		|ГДЕ
		|	ИнструментыСтатусовАгентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ИнструментыСтатусыАгентов, Выборка);
	
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(ИнструментыСтатусыАгентов, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	Результат.Добавить(Данные);
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

	
#Область СлужебныйПрограммныйИнтерфей

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	Идентификаторы				 = ИдентификаторыПредопределенныхДанныхГУИД();
	Описание					 = ИдентификаторыПредопределенныхДанныхВнешнийОписание();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		ВидыСравненияОбъект							 = КлючЗначение.Ключ.ПолучитьОбъект();
		ВидыСравненияОбъект.ГУИД					 = КлючЗначение.Значение;
		ВидыСравненияОбъект.Описание				 = Описание.Получить(КлючЗначение.Ключ);
		ВидыСравненияОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыПредопределенныхДанныхГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.Обучение,							 "02c24787-32b1-4257-b5fa-f95ac62fab51");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ЦентрализованнаяПоддержкаПродаж,	 "1131b759-d7de-4b2e-a478-82a0101c5b7c");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ПрограммаПреимущество,			 "833a52d5-cde5-45d7-b99b-6bcbe38ef9bb");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.Конкурсы,							 "31d940ee-2612-420d-9d2f-f838feb1605e");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.КвартальныйБонус,					 "4418d469-e6e0-4182-aadf-05fc4f0e6f72");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ЮгорскиеКаникулы,					 "ff025df9-0360-4e41-9bcb-028b42fe1fd4");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ОфлайнФорумы,						 "ca9bc2c4-0a6c-4be9-b829-a32743fb8bb8");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.УдаленнаяТочкаУрегулирования,		 "6541d5ce-a4bd-47b2-acf1-5932ad08ca4e");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.Франшиза,							 "2f01774d-3bdf-43ad-aea4-08f1045c5dbb");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.КлубВершина,						 "6a7b8b3f-a9bb-4fdb-b511-70c8ac665c8f");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ВыделеннаяЛинияПоддержки,			 "859fbc09-bb27-4fa9-a29a-a20e1cedd167");
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхВнешнийОписание()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.Обучение,							 "Записаться на следующий вебинар, узнать больше про страховые продукты");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ЦентрализованнаяПоддержкаПродаж,	 "Получить быструю консультацию");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ПрограммаПреимущество,			 "Зарабатывай больше");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.Конкурсы,							 "Узнай действующие конкурсы");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.КвартальныйБонус,					 "Бонус за качество страхового портфеля");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ЮгорскиеКаникулы,					 "Прими участие в рейтинге, заработай билет на мероприятие");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ОфлайнФорумы,						 "Зарегистрируйся на ближайшую трансляцию");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.УдаленнаяТочкаУрегулирования,		 "Обеспечь клиентам сервис в одно касание");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.Франшиза,							 "Открой офис вместе компанией ""Югория""");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.КлубВершина,						 "Вступай в сообщество лидеров страхового рынка, стань страховым предпринимателем!");
	Результат.Вставить(Справочники.ИнструментыСтатусовАгентов.ВыделеннаяЛинияПоддержки,			 "Получить помощь по сложным котировкам");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли