#Область ПрограммныйИнтерфейс

//Входная точка для нетиповых обменов в подсистеме "Обмен данными" БСП
Процедура ВыгрузкаЗагрузкаДанных(СтандартнаяОбработка,
								ПланОбмена,
								ИмяФайлаСообщения,
								ДанныеСообщения,
								КоличествоЭлементовВТранзакции,
								ИмяСобытияЖурналаРегистрации,
								КоличествоОтправленныхОбъектов,
								НаименованиеПланаОбмена,
								ВидПроцедуры,
								Отладка = Ложь,
								ОтладочноеСообщение = Неопределено) Экспорт
								
	СтандартнаяОбработка = Ложь;
	
	ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзла(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение);
	
КонецПроцедуры

#КонецОбласти

#Область ВариантыОбмена

Процедура ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзла(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,
														   КоличествоЭлементовВТранзакции = 0, КлючСообщенияЖурналаРегистрации = "",
														   КоличествоОбъектовОбработано = 0, ВидПроцедуры, Отладка, ОтладочноеСообщение)
							
	Если ВидПроцедуры = "Выгрузка" Тогда
		
		 ВыполнитьВыгрузкуИзмененийДляУзлаМАМС(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,КоличествоЭлементовВТранзакции,
						КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение);
		
	ИначеЕсли ВидПроцедуры = "Загрузка" Тогда
		
    Иначе
										
		Комментарий = "Иной вариант работы не предусмотрен";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка данных из ЦССУ", УровеньЖурналаРегистрации.Ошибка, , , Комментарий);	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьВыгрузкуИзмененийДляУзлаМАМС(УзелИнформационнойБазы, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение)
						
	ЗарегистрированныеОбъекты	= ПолучитьЗарегистрированныеКОтправкеОбъекты(ИмяФайлаСообщения, УзелИнформационнойБазы);
	ПараметрыСообщения = ОбменДаннымиAMS.ПараметрыПодключенияRabbitMQ(УзелИнформационнойБазы, ВидПроцедуры);
	СоответствиеТиповОбъектовМенеджерам = ПолучитьСоответствиеТиповОбъектов();
	
	
	РезультатОтправки = Новый Структура("Успех, Сообщение", Истина, Неопределено);
	
	Для Каждого Пакет Из ЗарегистрированныеОбъекты Цикл
		
		ВыборкаИзменений = Пакет.Выбрать();
		
		Пока ВыборкаИзменений.Следующий() Цикл
			
			ОбъектВыборка = ВыборкаИзменений.НомерСообщения;
			
			Если ВыборкаИзменений.Тип = "AMS_СоответствиеБрокеровАгентам" Тогда
				
				Сообщения = РегистрыСведений.AMS_СоответствиеБрокеровАгентам
								.СформироватьСообщениеДляМАМС(ВыборкаИзменений.Брокер);
											
				ОбъектВыборка = Неопределено;	
				
			ИначеЕсли ВыборкаИзменений.Тип = "СоответствиеКураторовАгентам" Тогда
				
				Сообщения = РегистрыСведений.СоответствиеКураторовАгентам
								.СформироватьСообщениеДляМАМС(ВыборкаИзменений.Куратор,
															ВыборкаИзменений.Агент);
																										
				ОбъектВыборка = Неопределено;	
				
			ИначеЕсли ВыборкаИзменений.Тип = "СоответствиеСтраховыхПродуктов" Тогда
				
				Сообщения = РегистрыСведений.СоответствиеСтраховыхПродуктов
								.СформироватьСообщениеДляМАМС(ВыборкаИзменений.СтраховойПродукт);
																										
				ОбъектВыборка = Неопределено;
				
			ИначеЕсли ВыборкаИзменений.Тип = "СоответствиеСтраховыхРисков" Тогда
				
				Сообщения = РегистрыСведений.СоответствиеСтраховыхРисков
								.СформироватьСообщениеДляМАМС(ВыборкаИзменений.СтраховойРиск,
															ВыборкаИзменений.СтраховойПродукт);
																										
				ОбъектВыборка = Неопределено;	
				
			Иначе	
				
				Сообщения = СформироватьТекстСообщения(ВыборкаИзменений.Ссылка, 
											СоответствиеТиповОбъектовМенеджерам);
				ОбъектВыборка = ВыборкаИзменений.Ссылка;							
															
			КонецЕсли;	
			
			ИсходноеСообщение = Сообщения;
			
			Если НЕ ТипЗнч(Сообщения) = Тип("Массив") Тогда
				ИсходноеСообщение = Новый Массив;
				ИсходноеСообщение.Добавить(Сообщения);
			КонецЕсли;
			
			Для каждого ТекстСообщения Из ИсходноеСообщение Цикл
				
				Если НЕ ЗначениеЗаполнено(ТекстСообщения) Тогда
					
					Продолжить;
					
				КонецЕсли;				
				
				ПараметрыСообщения.ТекстСообщения = ТекстСообщения;	
				
				ЗаписьЖурналаРегистрации("МастерАМС.СообщенияИнтеграции." + ВыборкаИзменений.Тип, УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
				
				РезультатОтправки = ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения);	
				
				Если РезультатОтправки.Успех Тогда
		
					ОчиститьСписокИзменений(УзелИнформационнойБазы, ОбъектВыборка);
		
				КонецЕсли;
			КонецЦикла;															
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если РезультатОтправки.Успех Тогда
		
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелИнформационнойБазы, Метаданные.РегистрыСведений.AMS_СоответствиеБрокеровАгентам);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелИнформационнойБазы, Метаданные.РегистрыСведений.СоответствиеКураторовАгентам);
		СоздатьФайлВыгрузкиЗаглушкуДляОбменаНаБСП(ИмяФайлаСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#Область ФормированиеСообщений

Функция СформироватьТекстСообщения(ОбъектСсылка, СоответствиеТиповОбъектовМенеджерам)
	
	Менеджер = СоответствиеТиповОбъектовМенеджерам.Получить(ТипЗнч(ОбъектСсылка));
	
	Если Менеджер = Неопределено Тогда
		
		Возврат "";
		
	КонецЕсли;	
	
	Возврат Менеджер.СформироватьСообщениеДляМАМС(ОбъектСсылка);
	
КонецФункции	

Функция ПолучитьСоответствиеТиповОбъектов()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Тип("СправочникСсылка.AMS_Продавцы"),							 Справочники.AMS_Продавцы);
	Результат.Вставить(Тип("СправочникСсылка.AMS_Агенты"),								 Справочники.AMS_Агенты);
	Результат.Вставить(Тип("СправочникСсылка.AMS_КаналыПродаж"),						 Справочники.AMS_КаналыПродаж);
	Результат.Вставить(Тип("СправочникСсылка.AMS_ВидыВознаграждений"),					 Справочники.AMS_ВидыВознаграждений);
	Результат.Вставить(Тип("СправочникСсылка.AMS_СтраховыеПродукты"),					 Справочники.AMS_СтраховыеПродукты);
	Результат.Вставить(Тип("СправочникСсылка.AMS_Банки"),								 Справочники.AMS_Банки);
	Результат.Вставить(Тип("СправочникСсылка.AMS_СтраховыеРиски"),						 Справочники.AMS_СтраховыеРиски);
	Результат.Вставить(Тип("СправочникСсылка.AMS_Филиалы"),								 Справочники.AMS_Филиалы);
	Результат.Вставить(Тип("СправочникСсылка.AMS_РегиональныеГруппы"),					 Справочники.AMS_РегиональныеГруппы);
	Результат.Вставить(Тип("СправочникСсылка.AMS_ВидыСтраховыхПродуктов"),				 Справочники.AMS_ВидыСтраховыхПродуктов);
	Результат.Вставить(Тип("СправочникСсылка.AMS_МотивационныеПрограммы"),				 Справочники.AMS_МотивационныеПрограммы);
	Результат.Вставить(Тип("СправочникСсылка.AMS_КонкурсыИРейтингиАгентов"),			 Справочники.AMS_КонкурсыИРейтингиАгентов);
	Результат.Вставить(Тип("СправочникСсылка.СтатусыАгентов"),							 Справочники.СтатусыАгентов);
	Результат.Вставить(Тип("СправочникСсылка.ИнструментыСтатусовАгентов"),				 Справочники.ИнструментыСтатусовАгентов);
	Результат.Вставить(Тип("ДокументСсылка.AMS_ИзменениеУсловийМотивационнойПрограммы"), Документы.AMS_ИзменениеУсловийМотивационнойПрограммы);
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

//Чтобы типовой механизм понял, что выгрузка данных произошла,
//надо заполнить типовой файл выгрузки содержимым.
Процедура СоздатьФайлВыгрузкиЗаглушкуДляОбменаНаБСП(ИмяФайлаСообщения)

	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайлаСообщения);
	ТекстЗаглушка = "Этот файл создаётся типовым механизмом обмена БСП. Его следует игнорировать. Можно удалять.";
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Данные");
	ЗаписьХМЛ.ЗаписатьТекст(ТекстЗаглушка);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.Закрыть();
	
КонецПроцедуры

//Отправка сообщения в очередь RabbitMQ
Функция ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения)
	
	Результат = ОбменДаннымиAMS.ОтправитьСообщениеСервер(ПараметрыСообщения);	
	
	Возврат Результат;	

КонецФункции

//Отправка сообщения в очередь RabbitMQ
Функция ПолучитьСообщенияИзRabbitMQ(ПараметрыСообщения) 
	
	Результат = ОбменДаннымиAMS.ПолучитьСообщениеСервер(ПараметрыСообщения);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗарегистрированныеКОтправкеОбъекты(ИмяФайла, УзелИнформационнойБазы)

	МетаДанныеОбмена		= УзелИнформационнойБазы.МетаДанные();
	СоставПланаОбмена		= МетаДанныеОбмена.Состав;
	УчаствуютВОбмене		= Новый Массив();
	НаименованиеПланаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелИнформационнойБазы, "Наименование");
	
	Для Каждого Элемент Из СоставПланаОбмена Цикл
		УчаствуютВОбмене.Добавить(Элемент.Метаданные.ПолноеИмя());
	КонецЦикла;
	
	// Получаем выборку измененных данных.
	Запрос = Новый Запрос;
	Запрос.Текст = ОбменДаннымиAMS.ТекстЗапросаИзмененийПланаОбмена(УчаствуютВОбмене, НаименованиеПланаОбмена);
	Запрос.УстановитьПараметр("Узел", УзелИнформационнойБазы);
	
	ВыборкаИзменений = Запрос.ВыполнитьПакет();
	
	Возврат ВыборкаИзменений;
	
КонецФункции

#КонецОбласти

#Область ОчисткаСпискаИзменений

Процедура ОчиститьСписокИзменений(Узел, Данные)
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Данные);
	
КонецПроцедуры

#КонецОбласти
