#Область ПрограммныйИнтерфейс

Функция ПолучитьСообщение(Идентификатор) Экспорт
	
	Результат = ИнициализироватьСтруктуруСообщения();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ЖурналСообщений.Идентификатор КАК Идентификатор,
		|	AMS_ЖурналСообщений.ВидСообщения КАК ВидСообщения,
		|	AMS_ЖурналСообщений.ПланОбмена КАК ОтправительПолучатель,
		|	AMS_ЖурналСообщений.Сообщение КАК Сообщение
		|ИЗ
		|	РегистрСведений.AMS_ЖурналСообщений КАК AMS_ЖурналСообщений
		|ГДЕ
		|	AMS_ЖурналСообщений.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Результат;
		
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	Данные = ПолучитьСтруктуруJSON(ВыборкаДетальныеЗаписи.Сообщение);
	Результат.Данные = Данные;
	
	Возврат Результат;
	
КонецФункции	

Процедура AMS_ОбработкаОчередиИнтеграции() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ЖурналСообщений.Идентификатор КАК Идентификатор,
		|	AMS_ЖурналСообщений.ПланОбмена КАК ПланОбмена
		|ИЗ
		|	РегистрСведений.AMS_ЖурналСообщений КАК AMS_ЖурналСообщений
		|ГДЕ
		|	НЕ AMS_ЖурналСообщений.Обработано";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Менеджер = ПолучитьМенеджерПоИнтеграции(ВыборкаДетальныеЗаписи.ПланОбмена);
		
		Если Менеджер <> Неопределено Тогда
			Менеджер.ОбработатьСообщение(ВыборкаДетальныеЗаписи.Идентификатор);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМенеджерПоИнтеграции(ПланОбмена)
	
	Результат = Неопределено;
	
	Если ТипЗнч(ПланОбмена) = Тип("ПланОбменаСсылка.ЮПРО") Тогда
		
		Результат = Обработки.AMS_ВыгрузкаЗагрузкаЮПро.Создать();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция ИнициализироватьСтруктуруСообщения()
	
	Результат = Новый Структура;
	Результат.Вставить("ОтправительПолучатель");
	Результат.Вставить("ВидСообщения");
	Результат.Вставить("Идентификатор");
	Результат.Вставить("Данные");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруJSON(ТекстСообщения)
	
	Результат = Новый Структура;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТекстСообщения);		
		Результат = ПрочитатьJSON(ЧтениеJSON,,, ФорматДатыJSON.ISO);	
		
	Исключение
		
		Возврат Результат;
		
	КонецПопытки;
	
	Возврат Результат;	
		
КонецФункции

#КонецОбласти