
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПараметрыДинамическогоСписка();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДинамическогоСписка()
	
    Если Параметры.Свойство("СтраховойПродукт") Тогда
		ДоступныеПараметры = ПолучитьСписокДоступныхПараметров(Параметры.СтраховойПродукт); 
		Список.Параметры.УстановитьЗначениеПараметра("СписокПараметров", ДоступныеПараметры);
	Иначе	
	
	Подстрока = "ГДЕ
		|	ПланВидовХарактеристикAMS_ПараметрыДополнительныхУсловий.Ссылка В(&СписокПараметров)";
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, Подстрока, "");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоступныхПараметров(СтраховойПродукт)

	Результат = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий.Параметр КАК Параметр
		|ИЗ
		|	РегистрСведений.AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий КАК AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий
		|ГДЕ
		|	AMS_ПереработатьИлиУдалитьНаборыДополнительныхУсловий.СтраховойПродукт = &СтраховойПродукт";
	
	Запрос.УстановитьПараметр("СтраховойПродукт", СтраховойПродукт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Параметр);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти





