
#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Для Каждого Строка Из ИсходныеДанные Цикл
		
		Если Не Строка.Свойство("МотивационнаяПрограмма") Тогда
			
			Комментарий = "Для справочника не заполнен обязательный реквизит МотивационнаяПрограмма";
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Мотивационные программы", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			
			Возврат;
			
		КонецЕсли;	
					
		СправочникЭлемент = Справочники.AMS_МотивационныеПрограммыНЕИСПОЛЬЗОВАТЬ.НайтиПоРеквизиту("ГУИДЦССУ", Строка.МотивационнаяПрограмма); 
		
		Если СправочникЭлемент.Пустая() Тогда 
			
			Если Строка.ЭтоГруппа Тогда
				
				СправочникОбъект = Справочники.AMS_МотивационныеПрограммыНЕИСПОЛЬЗОВАТЬ.СоздатьГруппу();
				
			Иначе
				
				СправочникОбъект = Справочники.AMS_МотивационныеПрограммыНЕИСПОЛЬЗОВАТЬ.СоздатьЭлемент();
				
			КонецЕсли;	
			
		Иначе
			
			СправочникОбъект = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка, "Наименование");
				
		Если Не Строка.ЭтоГруппа Тогда 
			
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка);
			
		КонецЕсли;
		
		ДозаполнитьВидСтрахования(СправочникОбъект, Строка, Строка.ЭтоГруппа);
		
		Попытка 
			
			СправочникОбъект.Записать();
			
			Комментарий = СтрШаблон("Успешно записан вид страхования с УИД %1", Строка.МотивационнаяПрограмма);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Мотивационные программы", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_МотивационныеПрограммыНЕИСПОЛЬЗОВАТЬ, СправочникОбъект.Ссылка, Комментарий);
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Мотивационные программы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_МотивационныеПрограммыНЕИСПОЛЬЗОВАТЬ, СправочникОбъект.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
			
	КонецЦикла;	
		
КонецПроцедуры  

Процедура ДозаполнитьВидСтрахования(СправочникОбъект, Строка, ЭтоГруппа)
	
	СправочникОбъект.Родитель = Справочники.AMS_ВидыСтрахования.НайтиПоРеквизиту("ГУИДЦССУ", Строка.Родитель);
	СправочникОбъект.ГУИДЦССУ = Строка.МотивационнаяПрограмма;
	СправочникОбъект.ГУИД = Строка.ГУИД;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СправочникОбъект.ВидСтрахования = Справочники.AMS_ВидыСтрахования.НайтиПоРеквизиту("ГУИДЦССУ", Строка.ВидСтрахования);
	
КонецПроцедуры

#КонецОбласти
