
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьФилиаловПоПользователю();
КонецПроцедуры

&НаСервере
Процедура ВидимостьФилиаловПоПользователю()
	
	ГУИДФилиал = ПользователиКлиентСервер.ТекущийПользователь().AMS_Филиал.ГУИД;
	
	Если НЕ ГУИДФилиал = "" Тогда
		
		СписокДоговор = ОпределитьСписокДоговоровПоФилиалуПользователя(ГУИДФилиал);
		
		Если ЗначениеЗаполнено(СписокДоговор) Тогда
			
			ВидВСписке = ВидСравненияКомпоновкиДанных.ВСписке;
			Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ГУИД", СписокДоговор, ВидВСписке,
			Неопределено, Истина, Режим);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьСписокДоговоровПоФилиалуПользователя(ГУИДФилиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AMS_АгентскиеДоговоры.ГУИД КАК ГУИД
	|ИЗ
	|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|ГДЕ
	|	AMS_АгентскиеДоговоры.Филиал.ГУИД = &ГУИД";
	
	Запрос.УстановитьПараметр("ГУИД", ГУИДФилиал);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГУИД");
	
	Возврат РезультатЗапроса;
	
КонецФункции
