Функция СериализоватьЗначение(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.AMS_КатегорииДоговоров") Тогда
		
		Возврат XMLСтрока(Значение.Наименование);
		
	КонецЕсли;

	Если ТипЗнч(Значение) = Тип("ПеречислениеСсылка.AMS_ТипыКонтрагентов") Тогда
		
		Возврат XMLСтрока(Строка(Значение));
		
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.AMS_КатегорииТС") Тогда
		
		Возврат XMLСтрока(Строка(Значение.НаименованиеСОРВ));
		
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		
		Возврат XMLСтрока(Значение);
		
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.AMS_ТерриторииСтрахования") Тогда
		
		Возврат XMLСтрока(Лев(Значение.КодКЛАДР, 2));
		
	КонецЕсли;
	
	Попытка
		Результат = XMLСтрока(Значение.ГУИД);
	Исключение
		Результат = XMLСтрока(Значение);	
	КонецПопытки;	

	Возврат Результат;
	
КонецФункции

Функция ПобитовоеXORСтрок(Идентификатор1, Идентификатор2) Экспорт

	ЧислоИД1 = УникальныйИдентификаторВЧисло(Идентификатор1);
	ЧислоИД2 = УникальныйИдентификаторВЧисло(Идентификатор2);
	
	ЧислоИД12 = Из_Число_В_XСчисл(ЧислоИД1, "01");
	ЧислоИД22 = Из_Число_В_XСчисл(ЧислоИД2, "01"); 
	
	Попытка
		ЧислоXORИД  = СтрЗаменить(Формат(Число(ЧислоИД12) + Число(ЧислоИД22), "ЧГ=0"), "2", 0);
	Исключение
	    Возврат Строка(Новый УникальныйИдентификатор);
	КонецПопытки;
	
	ЧислоИД = ИзХСчислВЧисло(ЧислоXORИД, "01");
	
	
	ИД16 = Прав("0000000000000000000000000000000000" + ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(ЧислоИД), 32);
	
	с1 = Сред(ИД16, 1, 4);
	с2 = Сред(ИД16, 5, 12);
	с3 = Сред(ИД16, 17, 4);
	с4 = Сред(ИД16, 21, 4);
	с5 = Сред(ИД16, 25, 8);
	
	Возврат с5 + "-" + с4 + "-" + с3 + "-" + с1 + "-" + с2;
	
КонецФункции

Функция УникальныйИдентификаторВЧисло(Идентификатор)
	
	с1 = Сред(Идентификатор, 20, 4);
	с2 = Сред(Идентификатор, 25, 12);
	с3 = Сред(Идентификатор, 15, 4);
	с4 = Сред(Идентификатор, 10, 4);
	с5 = Сред(Идентификатор, 1, 8);
	
	с16 = с1 + с2 + с3 + с4 + с5;
	
	Возврат ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(с16);
	
КонецФункции

Функция ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Знач ДесятичноеЧисло)
    
    Результат = "";
    
    Пока ДесятичноеЧисло > 0 цикл
        ОстатокОтДеления = ДесятичноеЧисло % 16;
        ДесятичноеЧисло  = (ДесятичноеЧисло - ОстатокОтДеления) / 16;
        Результат        = Сред("0123456789abcdef", ОстатокОтДеления + 1, 1) + Результат;
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции

Функция ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(Знач Значение)
    
    Значение = НРег(Значение);
    ДлинаСтроки = СтрДлина(Значение);
    
    Результат = 0;
    Для НомерСимвола = 1 По ДлинаСтроки Цикл
        Результат = Результат * 16 + Найти("0123456789abcdef", Сред(Значение, НомерСимвола, 1)) - 1;
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции 

Функция Из_Число_В_XСчисл(Знач Значение, Шаблон)
	
	Результат = "";
    Основание = СтрДлина(Шаблон);
	
	Пока Значение > 0 цикл
        Остат = Значение%Основание;
        Результат1 = Сред(Шаблон, Остат + 1, 1);
        Значение   = (Значение - Остат) / Основание;
        Результат = Результат1 + Результат;
    КонецЦикла;
	
	Возврат Результат;

КонецФункции 

Функция ИзХСчислВЧисло(аф,Шаблон) // Шаблон = "0123456789ABCDEF"
	
	аф = ВРег(аф); // на всякий случай.
    ДлинаШаблона = СтрДлина(Шаблон);

    ДлинаСтроки = СтрДлина(аф);
    ТекСимвол = ДлинаСтроки;
    Результат = 0;

    Пока ТекСимвол > 0 Цикл

        ОбрабатываемыйСимвол = Сред(аф, ТекСимвол,1);
        ПозицияВШаблоне = Найти(Шаблон,ОбрабатываемыйСимвол)-1;
        Результат = Результат + (ПозицияВШаблоне * pow(ДлинаШаблона,ДлинаСтроки-ТекСимвол));
        ТекСимвол = ТекСимвол - 1;
		
	КонецЦикла;

    Возврат(Результат);
КонецФункции


