
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьКаналовПродажПоПользователю();
КонецПроцедуры

&НаСервере
Процедура ВидимостьКаналовПродажПоПользователю()
	
	КаналПользователя = ПользователиКлиентСервер.ТекущийПользователь().AMS_КаналПродаж.ГУИД;
	
	Если ЗначениеЗаполнено(КаналПользователя) Тогда
		
		ВидРавно = ВидСравненияКомпоновкиДанных.Равно;
		Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ГУИД", КаналПользователя, ВидРавно, Неопределено, Истина, Режим);
		
	КонецЕсли;
	
КонецПроцедуры
