Функция ЭлементСправочникаПоЦССУ(ИмяСправочника, ИдентификаторЦССУ) Экспорт
	
	Если СтрДлина(ИдентификаторЦССУ) < 20 
		ИЛИ НЕ ТипЗнч(ИдентификаторЦССУ) = Тип("Строка") Тогда
		
		Возврат ИдентификаторЦССУ;
		
	КонецЕсли;
	
	Если ИдентификаторЦССУ = "00000000-0000-0000-0000-000000000000" Тогда
		
		Возврат Справочники[ИмяСправочника].ПустаяСсылка();
		
	КонецЕсли;
	
	Результат = ОбщегоНазначенияAMS
				.ПолучитьСсылкаНаОтсутствующийОбъект(ИдентификаторЦССУ, ИмяСправочника);
				
	Возврат Результат;
	
КонецФункции

Функция ФункциональностьAMSДоступна(Флаг) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_УправлениеFeatureФлагами.Флаг КАК Флаг
		|ИЗ
		|	РегистрСведений.AMS_УправлениеFeatureФлагами КАК AMS_УправлениеFeatureФлагами
		|ГДЕ
		|	AMS_УправлениеFeatureФлагами.Флаг = &Флаг
		|	И AMS_УправлениеFeatureФлагами.Действует";
	
	Запрос.УстановитьПараметр("Флаг", Флаг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции	