
Процедура ПриКопированииДокументовКВ(Источник, ОбъектКопирования, Отказ) Экспорт
	
	Источник.ГУИД = "";
	Источник.ГУИДЦССУ = "";
	
	Для каждого СтраховойПродукт Из Источник.СтраховыеПродукты Цикл
	
		КлючСвязи 	   = СтраховойПродукт.КлючСвязи;
		НовыйКлючСвязи = Строка(Новый УникальныйИдентификатор); 
		
		СтраховойПродукт.КлючСвязи = НовыйКлючСвязи;
		
		Отбор = Новый Структура("КлючСвязи", КлючСвязи);
		
		СтрокиПоказателей = Источник.Показатели.НайтиСтроки(Отбор);
		
		Для каждого Показатель Из СтрокиПоказателей Цикл
		
			Показатель.КлючСвязи = НовыйКлючСвязи;
		
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

#Область ЗаполнениеСтандартныхРеквизитов

Процедура ЗаполнениеСтандартныхРеквизитов(Источник, Отказ = Ложь) Экспорт
	ЗаполнитьГУИДОбъекта(Источник, Отказ);
	ЗаполнитьОтветственного(Источник, Отказ);
КонецПроцедуры

#Область ЗаполнениеГУИД

//Заполнение реквизита ГУИД уникальным идентификатором ссылки объекта
//Выполняется при записи справочника с незаполненным реквизитом "ГУИД"
//Вызывается в модуле объекта в процедуре "ПередЗаписью"
Процедура ЗаполнитьГУИДОбъекта(Источник, Отказ = Ложь) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "ЭтоГруппа") И Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	Ссылка = Источник.Ссылка;
	
	Если Источник.ЭтоНовый() Тогда
		
		Если НЕ ЗначениеЗаполнено(Источник.ПолучитьСсылкуНового()) Тогда
			
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
			НовыйОбъектСсылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор);
			Источник.УстановитьСсылкуНового(НовыйОбъектСсылка);
			
			Если ОпределитьТипОбъекта(Источник) = "Справочник" Тогда
				Источник.УстановитьНовыйКод();
			КонецЕсли;
			
		КонецЕсли;
		
		Ссылка = Источник.ПолучитьСсылкуНового();
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.ГУИД) Тогда
		Источник.ГУИД = Строка(Ссылка.УникальныйИдентификатор());	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнениеГУИДПредопределенныхЭлементовСправочников() Экспорт
	
	Запрос = Новый Запрос(ПолучитьТекстЗапроса());
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Ссылка = Выборка.Ссылка;
			НовыйОбъект = Ссылка.ПолучитьОбъект();
			НовыйОбъект.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса()
	
	Результат = "";
	ИменаСправочников = ИменаСправочниковAMS();
	НомерТаблицы = 1;
	
	Для Каждого Имя Из ИменаСправочников Цикл
		Результат = Результат + ТекстДляТекущегоСправочника(Имя, Строка(НомерТаблицы));
		НомерТаблицы = НомерТаблицы + 1;
	КонецЦикла;
	
	Результат = Лев(Результат, СтрДлина(Результат) - 17);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстДляТекущегоСправочника(Справочник, ПорядковыйНомер)
	
	Результат = "ВЫБРАТЬ
	|	ТекущаяТаблица%2.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.%1 КАК ТекущаяТаблица%2
	|ГДЕ
	|	ТекущаяТаблица%2.ГУИД = """"
	|	И ТекущаяТаблица%2.Предопределенный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Результат = СтрШаблон(Результат, Справочник, ПорядковыйНомер);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеОтветственного

Процедура ЗаполнитьОтветственного(Источник, Отказ = Ложь) Экспорт
	
	ЕстьРеквизит = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "Ответственный");
	
	Если Источник.Модифицированность() И ЕстьРеквизит Тогда  
		Источник.Ответственный = Пользователи.ТекущийПользователь(); 
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеВидыКонтактнойИнформации

Процедура ЗаполнениеВидыКонтактнойИнформации() Экспорт
	
	ДанныеТелефон = Новый Массив();
	ДанныеEmail = Новый Массив();
	ДанныеАдрес = Новый Массив();	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Элемент = РезультатЗапроса.Ссылка;
		
		Если Элемент.ЭтоГруппа Тогда
			
			КонтактнаяИнформацияСправочник = Элемент.ПолучитьОбъект();
			
			Если НЕ КонтактнаяИнформацияСправочник.Используется Тогда
				КонтактнаяИнформацияСправочник.Используется = Истина;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(КонтактнаяИнформацияСправочник);
			КонецЕсли;
			
		Иначе
			
			Если СтрНайти(Элемент.ИмяПредопределенныхДанных, "Телефон") > 0 Тогда
				ДанныеТелефон.Добавить(Элемент);
			ИначеЕсли СтрНайти(Элемент.ИмяПредопределенныхДанных, "Email") > 0 Тогда
				ДанныеEmail.Добавить(Элемент);
			ИначеЕсли СтрНайти(Элемент.ИмяПредопределенныхДанных, "ЮридическийАдрес") > 0 Тогда
				ДанныеАдрес.Добавить(Элемент);	
			ИначеЕсли СтрНайти(Элемент.ИмяПредопределенныхДанных, "ФактическийАдрес") > 0 Тогда
				ДанныеАдрес.Добавить(Элемент);
			ИначеЕсли СтрНайти(Элемент.ИмяПредопределенныхДанных, "ПочтовыйАдрес") > 0 Тогда
				ДанныеАдрес.Добавить(Элемент);
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ПорядковыйНомер = 1;
	Для Каждого Элемент Из ДанныеТелефон Цикл  
		
		ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
		ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации[Элемент.ИмяПредопределенныхДанных];
		ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
		ПараметрыВида.Порядок = ПорядковыйНомер;
		УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
	КонецЦикла;
	
	ПорядковыйНомер = 1;
	Для Каждого Элемент Из ДанныеEmail Цикл   
		
		ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации[Элемент.ИмяПредопределенныхДанных];
		ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
		ПараметрыВида.Порядок = ПорядковыйНомер;
		УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;  
		
	КонецЦикла;
	
	ПорядковыйНомер = 1;
	Для Каждого Элемент Из ДанныеАдрес Цикл 
		
		ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
		ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации[Элемент.ИмяПредопределенныхДанных];
		ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
		ПараметрыВида.Порядок = ПорядковыйНомер;
		УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнениеВидыКонтактнойИнформацииБанки() Экспорт
	
	ДанныеТелефон = Новый Массив();
	ДанныеEmail = Новый Массив();
	ДанныеАдрес = Новый Массив();	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Элемент = РезультатЗапроса.Ссылка;
		
		Если Элемент.ЭтоГруппа Тогда
			
			КонтактнаяИнформацияСправочник = Элемент.ПолучитьОбъект();
			
			Если НЕ КонтактнаяИнформацияСправочник.Используется Тогда
				КонтактнаяИнформацияСправочник.Используется = Истина;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(КонтактнаяИнформацияСправочник);
			КонецЕсли;
			
		Иначе
			
			Если СтрНайти(Элемент.ИмяПредопределенныхДанных, "Телефон") > 0 Тогда
				ДанныеТелефон.Добавить(Элемент);
			ИначеЕсли СтрНайти(Элемент.ИмяПредопределенныхДанных, "Email") > 0 Тогда
				ДанныеEmail.Добавить(Элемент);
			ИначеЕсли СтрНайти(Элемент.ИмяПредопределенныхДанных, "ЮридическийАдрес") > 0 Тогда
				ДанныеАдрес.Добавить(Элемент);	
			ИначеЕсли СтрНайти(Элемент.ИмяПредопределенныхДанных, "ФактическийАдрес") > 0 Тогда
				ДанныеАдрес.Добавить(Элемент);
			ИначеЕсли СтрНайти(Элемент.ИмяПредопределенныхДанных, "ПочтовыйАдрес") > 0 Тогда
				ДанныеАдрес.Добавить(Элемент);
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ПорядковыйНомер = 1;
	Для Каждого Элемент Из ДанныеТелефон Цикл  
		
		ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
		ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации[Элемент.ИмяПредопределенныхДанных];
		ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
		ПараметрыВида.Порядок = ПорядковыйНомер;
		УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
	КонецЦикла;
	
	ПорядковыйНомер = 1;
	Для Каждого Элемент Из ДанныеEmail Цикл   
		
		ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации[Элемент.ИмяПредопределенныхДанных];
		ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
		ПараметрыВида.Порядок = ПорядковыйНомер;
		УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;  
		
	КонецЦикла;
	
	ПорядковыйНомер = 1;
	Для Каждого Элемент Из ДанныеАдрес Цикл 
		
		ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
		ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации[Элемент.ИмяПредопределенныхДанных];
		ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
		ПараметрыВида.Порядок = ПорядковыйНомер;
		УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьТаблицуМакета(ИмяМакета, Менеджер) Экспорт

	МакетДанных  = Менеджер.ПолучитьМакет(ИмяМакета);
	ОбластьСтарт = МакетДанных.Область(1, 1, МакетДанных.ВысотаТаблицы, МакетДанных.ШиринаТаблицы);
	Построитель  = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьСтарт);
	Построитель.Выполнить();
	
	ТаблицаДанных = Построитель.Результат.Выгрузить();
	
	Возврат ТаблицаДанных;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедуры

Функция ИменаСправочниковAMS() Экспорт
	
	Результат = Новый Массив();
	
	Для Каждого СправочникМетаДанных Из Метаданные.Справочники Цикл
		
		Префикс = Лев(СправочникМетаДанных.Имя, 3);
		
		Если Префикс = "AMS" Тогда
			Результат.Добавить(СправочникМетаДанных.Имя);
		КонецЕсли;		
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОпределитьТипОбъекта(Объект) Экспорт
	
	Результат = "";
	
	ТипЗначения = ТипЗнч(Объект);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Результат = "Справочник";
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Результат = "Документ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты) Экспорт
	
	Для Каждого ЭлементМассива Из НеПроверяемыеРеквизиты Цикл
		
		ПорядковыйНомер = ПроверяемыеРеквизиты.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПорядковыйНомер);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСсылкаНаОтсутствующийОбъект(Идентификатор, ТипСправочника) Экспорт
	
	Результат = Справочники[ТипСправочника].ПустаяСсылка();
	
	Если НЕ Идентификатор = "" И НЕ Идентификатор = Неопределено Тогда 
		
		МенеджерСправочника		= Справочники[ТипСправочника];  
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник." + СокрЛП(ТипСправочника) + " КАК Т
		|ГДЕ
		|	(Т.ГУИД = &ГУИД
		|			ИЛИ Т.ГУИДЦССУ = &ГУИДЦССУ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Т.Наименование УБЫВ";
		
		Запрос.УстановитьПараметр("ГУИД", Идентификатор);
		Запрос.УстановитьПараметр("ГУИДЦССУ", Идентификатор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			СсылкаНаОбъект = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда 
			
			Объект = МенеджерСправочника.СоздатьЭлемент();
			
			Объект.ГУИДЦССУ = Идентификатор;
			
			Попытка 
				
				Объект.ГУИД = Идентификатор;
				
			Исключение
				
				// ГУИД отсутствует
				
			КонецПопытки;	
			
			Объект.ОбменДанными.Загрузка = Истина;
			
			Объект.Записать();
			
			СсылкаНаОбъект = Объект.Ссылка;
			
		КонецЕсли; 
		
		Результат = СсылкаНаОбъект;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьКаналыПродаж() Экспорт 
	
	Попытка 
		
		ПодканалПродажБАКП = Справочники.AMS_КаналыПродаж.БАКП.ПолучитьОбъект();
		ПодканалПродажБАКП.НаименованиеПолное = "Брокерский";
		ПодканалПродажБАКП.Записать();
		
		ПодканалПродажБПКП = Справочники.AMS_КаналыПродаж.БПКП.ПолучитьОбъект();
		ПодканалПродажБПКП.НаименованиеПолное = "Банк страхование";
		ПодканалПродажБПКП.Записать();
		
		ПодканалПродажБПП = Справочники.AMS_КаналыПродаж.БПП.ПолучитьОбъект();
		ПодканалПродажБПП.НаименованиеПолное = "Брокерский ККП";
		ПодканалПродажБПП.Записать();
		
		ПодканалПродажВККП = Справочники.AMS_КаналыПродаж.ВККП.ПолучитьОбъект();
		ПодканалПродажВККП.НаименованиеПолное = "ВИП Корпоративный";
		ПодканалПродажВККП.Записать();
		
		ПодканалПродажИПКП = Справочники.AMS_КаналыПродаж.ИПКП.ПолучитьОбъект();
		ПодканалПродажИПКП.НаименованиеПолное = "Ипотечный";
		ПодканалПродажИПКП.Записать();
		
		ПодканалПродажИПП = Справочники.AMS_КаналыПродаж.ИПП.ПолучитьОбъект();
		ПодканалПродажИПП.НаименованиеПолное = "Ипотечный БКП";
		ПодканалПродажИПП.Записать();
		
		ПодканалПродажКАКП = Справочники.AMS_КаналыПродаж.КАКП.ПолучитьОбъект();
		ПодканалПродажКАКП.НаименованиеПолное = "Классический";
		ПодканалПродажКАКП.Записать();
		
		ПодканалПродажЛПКП = Справочники.AMS_КаналыПродаж.ЛПКП.ПолучитьОбъект();
		ПодканалПродажЛПКП.НаименованиеПолное = "Лизинговый";
		ПодканалПродажЛПКП.Записать();
		
		ПодканалПродажНПКП = Справочники.AMS_КаналыПродаж.НПКП.ПолучитьОбъект();
		ПодканалПродажНПКП.НаименованиеПолное = "Нефинансовые посредники";
		ПодканалПродажНПКП.Записать();
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Заполнение предопределенных данных", 
		УровеньЖурналаРегистрации.Информация, 
		Метаданные.Справочники.AMS_КаналыПродаж, 
		, "Данные заполнены");
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Заполнение предопределенных данных", 
		УровеньЖурналаРегистрации.Ошибка, 
		Метаданные.Справочники.AMS_КаналыПродаж, 
		, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры	

// Возвращает Истина или Ложь.
// Проверяет имя на уникальность
//
// Параметры:
//  ИмяОбъекта - Строка
//  ИмяОбъекта = "AMS_МотивационныеПрограммы";
//
//  СтрРеквизитов - Структура.
//  СтрРеквизитов = Новый Структура; //
//  СтрРеквизитов.Вставить("Наименование", Объект.Наименование);
//
//  ЗначениеСсылка - Ссылка на объект
//  ЗначениеСсылка = Объект.Ссылка
//
&НаСервере
Функция ПрошелКонтрольУникальностиСправочникаПоРеквизиту(ИмяОбъекта, СтрРеквизитов, ЗначениеСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спр.Ссылка
	|ИЗ
	|	Справочник." + ИмяОбъекта + " КАК Спр
	|ГДЕ
	|	Спр.Ссылка <> &парЗначениеСсылка
	|";
	
	Нум = 0;
	
	Для Каждого Знч Из СтрРеквизитов Цикл
		ИмяПараметраВЗапросе = " = &Пар" + Строка(Нум);
		Запрос.Текст = Запрос.Текст + " И Спр." + Знч.Ключ + ИмяПараметраВЗапросе; 
		Запрос.УстановитьПараметр("Пар" + Строка(Нум),	Знч.Значение);
		Нум = Нум + 1;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("парЗначениеСсылка", 		ЗначениеСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти