#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Для Каждого Строка Из ИсходныеДанные Цикл 
		
		Если Не Строка.Свойство("КатегорииАгентовДляKPI") Тогда
			
			Комментарий = "Для справочника не заполнен обязательный реквизит КатегорииАгентовДляKPI";
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника КатегорииАгентовДляKPI", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			
			Возврат;
			
		КонецЕсли;	
		
		СправочникЭлемент = Справочники.AMS_КатегорияАгентовДляПоказателейКачества.НайтиПоРеквизиту("ГУИДЦССУ", Строка.КатегорииАгентовДляKPI); 
		
		Если СправочникЭлемент.Пустая() Тогда 
			
			КатегорииАгентовДляKPI = Справочники.AMS_КатегорияАгентовДляПоказателейКачества.СоздатьЭлемент();		
		Иначе
			
			КатегорииАгентовДляKPI = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(КатегорииАгентовДляKPI, Строка);
		
		КатегорииАгентовДляKPI.ГУИДЦССУ = Строка.КатегорииАгентовДляKPI;
		
		Попытка
			
			КатегорииАгентовДляKPI.Записать();
			
			Комментарий = СтрШаблон("Успешно записан продавец с УИД %1", Строка.Продавец);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника КатегорииАгентовДляKPI", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_КатегорияАгентовДляПоказателейКачества, КатегорииАгентовДляKPI.Ссылка, Комментарий);
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника КатегорииАгентовДляKPI", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_КатегорияАгентовДляПоказателейКачества, КатегорииАгентовДляKPI.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли