#Область ПрограммныйИнтерфейс

//Входная точка для нетиповых обменов в подсистеме "Обмен данными" БСП
Процедура ВыгрузкаЗагрузкаДанных(СтандартнаяОбработка,
	ПланОбмена,
	ИмяФайлаСообщения,
	ДанныеСообщения,
	КоличествоЭлементовВТранзакции,
	ИмяСобытияЖурналаРегистрации,
	КоличествоОтправленныхОбъектов,
	НаименованиеПланаОбмена,
	ВидПроцедуры,
	Отладка = Ложь,
	ОтладочноеСообщение = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзла(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
	ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВариантыОбмена

Процедура ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзла(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,
	КоличествоЭлементовВТранзакции = 0, КлючСообщенияЖурналаРегистрации = "",
	КоличествоОбъектовОбработано = 0, ВидПроцедуры, Отладка, ОтладочноеСообщение)
	
	Если ВидПроцедуры = "Выгрузка" Тогда
		
		ВыполнитьВыгрузкуИзменений(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,КоличествоЭлементовВТранзакции,
			КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение);
		
	ИначеЕсли ВидПроцедуры = "Загрузка" Тогда
		
		ВыполнитьЗагрузкуИзменений(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,КоличествоЭлементовВТранзакции,
			КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение);
		
		
	Иначе
		
		Комментарий = "Иной вариант работы не предусмотрен";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка данных из ЦССУ", УровеньЖурналаРегистрации.Ошибка, , , Комментарий);	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

Процедура ВыполнитьВыгрузкуИзменений(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,КоличествоЭлементовВТранзакции,
						КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение)
	
	ПараметрыСообщения = ОбменДаннымиAMS.ПараметрыПодключенияRabbitMQ(УзелИнформационнойБазы, ВидПроцедуры);
	ЗарегистрированныеОбъекты	= ПолучитьЗарегистрированныеКОтправкеОбъекты(ИмяФайла, УзелИнформационнойБазы);
	
	РезультатОтправки = Новый Структура("Успех, Сообщение", Истина, Неопределено);
	
	Для Каждого Пакет Из ЗарегистрированныеОбъекты Цикл
		
		ВыборкаИзменений = Пакет.Выбрать();
		
		Пока ВыборкаИзменений.Следующий() Цикл
			
			Реестр = ВыборкаИзменений.Реестр;
			ТекстСообщения = "";
			
			СформироватьСообщениеПоРеестру(Реестр, ТекстСообщения);
			
			Если НЕ ЗначениеЗаполнено(ТекстСообщения) Тогда
				
				Продолжить;
				
			КонецЕсли;	
			
			ПараметрыСообщения.ТекстСообщения = ТекстСообщения;	
			РезультатОтправки = ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения);			
			
		КонецЦикла;
		
		ВыборкаИзменений.Сбросить();
		Пока ВыборкаИзменений.Следующий() Цикл
			
			Реестр = ВыборкаИзменений.Реестр;
			МассивСообщений = Новый Массив;
			
			СформироватьСообщениеПоРееструПоУдалениям(Реестр, МассивСообщений);
			
			Если МассивСообщений.Количество() = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;	
			
			Для каждого ТекстСообщения Из МассивСообщений Цикл
								
				ПараметрыСообщения.ТекстСообщения = ТекстСообщения;	
				РезультатОтправки = ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения);		
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;	
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелИнформационнойБазы);				
	СоздатьФайлВыгрузкиЗаглушкуДляОбменаНаБСП(ИмяФайла);

КонецПроцедуры						

Процедура ВыполнитьЗагрузкуИзменений(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,КоличествоЭлементовВТранзакции,
						КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение)
						
						
	Если Отладка Тогда
		
		ВходящиеСообщения = ОтладочноеСообщение;
		
	Иначе 
		
		ПараметрыПодключения = ОбменДаннымиAMS
						.ПараметрыПодключенияRabbitMQ(УзелИнформационнойБазы, ВидПроцедуры);
		ВходящиеСообщения	 = ПолучитьСообщенияИзRabbitMQ(ПараметрыПодключения); 
		
	КонецЕсли;
	
	МассивДляОбработки = Новый Массив;
	
	Для Каждого Сообщение Из ВходящиеСообщения Цикл
		
		Если НЕ Сообщение.ВходящееСообщение = "" Тогда
			
			ИдентификаторСообщения = РегистрыСведений
						.AMS_ЖурналСообщенийПоРеестрам
						.ДобавитьСообщение(Сообщение.ВходящееСообщение);
						
			МассивДляОбработки.Добавить(ИдентификаторСообщения);
			
		КонецЕсли;
		
	КонецЦикла;	
		
	ОбработатьВходящиеСообщения(МассивДляОбработки);					
	
КонецПроцедуры

//Чтобы типовой механизм понял, что выгрузка данных произошла,
//надо заполнить типовой файл выгрузки содержимым.
Процедура СоздатьФайлВыгрузкиЗаглушкуДляОбменаНаБСП(ИмяФайлаСообщения)

	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайлаСообщения);
	ТекстЗаглушка = "Этот файл создаётся типовым механизмом обмена БСП. Его следует игнорировать. Можно удалять.";
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Данные");
	ЗаписьХМЛ.ЗаписатьТекст(ТекстЗаглушка);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.Закрыть();
	
КонецПроцедуры

#Область КоннекторRMQ
//Отправка сообщения в очередь RabbitMQ
Функция ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения)
	
	Результат = ОбменДаннымиAMS.ОтправитьСообщениеСервер(ПараметрыСообщения);	
	
	Возврат Результат;	

КонецФункции					

//Отправка сообщения в очередь RabbitMQ
Функция ПолучитьСообщенияИзRabbitMQ(ПараметрыСообщения) 
	
	Результат = ОбменДаннымиAMS.ПолучитьСообщениеСервер(ПараметрыСообщения);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьВходящиеСообщения(МассивСообщений)
	
	Для каждого ИдентификаторСообщения Из МассивСообщений Цикл
	
		Сообщение = РегистрыСведений
						.AMS_ЖурналСообщенийПоРеестрам
						.ПолучитьСообщение(ИдентификаторСообщения);
		ИсходныеДанные = ПолучитьСтруктуруJSON(Сообщение);				                                   
		
		Попытка
			Документы
				.AMS_РеестрПоПремиальнымПрограммам
				.СформироватьИзменитьЭлементСправочника(ИсходныеДанные);
				
			РегистрыСведений
						.AMS_ЖурналСообщенийПоРеестрам
						.ЗафиксироватьОбработку(ИдентификаторСообщения);
		Исключение
						
			Ошибка = ИнформацияОбОшибке();
			РегистрыСведений
						.AMS_ЖурналСообщенийПоРеестрам
						.ЗафиксироватьОшибку(ИдентификаторСообщения, ПодробноеПредставлениеОшибки(Ошибка));
						
		КонецПопытки;				
						
	КонецЦикла;
						
КонецПроцедуры	

Функция ПолучитьСтруктуруJSON(ТекстСообщения)
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);	
	
	Возврат ДанныеJSON;	
		
КонецФункции

Функция ПолучитьЗарегистрированныеКОтправкеОбъекты(ИмяФайла, УзелИнформационнойБазы)

	МетаДанныеОбмена		= УзелИнформационнойБазы.МетаДанные();
	СоставПланаОбмена		= МетаДанныеОбмена.Состав;
	УчаствуютВОбмене		= Новый Массив();
	НаименованиеПланаОбмена = МетаДанныеОбмена.Имя;
	
	Для Каждого Элемент Из СоставПланаОбмена Цикл
		УчаствуютВОбмене.Добавить(Элемент.Метаданные.ПолноеИмя());
	КонецЦикла;
	
	// Получаем выборку измененных данных.
	Запрос = Новый Запрос;
	Запрос.Текст = ОбменДаннымиAMS.ТекстЗапросаИзмененийПланаОбмена(УчаствуютВОбмене, НаименованиеПланаОбмена);
	Запрос.УстановитьПараметр("Узел", УзелИнформационнойБазы);
	
	ВыборкаИзменений = Запрос.ВыполнитьПакет();
	
	Возврат ВыборкаИзменений;
	
КонецФункции

Процедура СформироватьСообщениеПоРеестру(Реестр, ТекстСообщения)
	
	СоответствиеСтатусов = ПолучитьСоответствиеСтатусов();
	Статус = СоответствиеСтатусов.Получить(Реестр.Статус);
	
	Если Статус = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Сообщение = Новый Структура;
	Сообщение.Вставить("eventType", "ChangeRegistryStatus");
	Сообщение.Вставить("guid", Реестр.ГУИД);
	Сообщение.Вставить("status", Статус);
	Сообщение.Вставить("createDate", Формат(ТекущаяДатаСеанса(),"ДФ=yyyy-MM-dd"));
	
	ТекстСообщения = ОбменДаннымиAMS.СформироватьСтрокуJSON(Сообщение, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
		
	ЗаписьЖурналаРегистрации("РеестрыПоПремиальнымПрограммам.СообщенияИнтеграции", 
								УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
	
КонецПроцедуры	

Процедура СформироватьСообщениеПоРееструПоУдалениям(Реестр, МассивСообщений)
	
    Для каждого СтрокаРеестра Из Реестр.Договоры Цикл
	
		Если НЕ СтрокаРеестра.Исключен Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Сообщение = Новый Структура;
		Сообщение.Вставить("eventType", "DeleteCommission");
		Сообщение.Вставить("guid", СтрокаРеестра.ИдентификаторРасчета);
		ТекстСообщения = ОбменДаннымиAMS.СформироватьСтрокуJSON(Сообщение, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
		ЗаписьЖурналаРегистрации("РеестрыПоПремиальнымПрограммам.СообщенияИнтеграции", 
								УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);

		
		МассивСообщений.Добавить(ТекстСообщения);
	
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьСоответствиеСтатусов()

	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.AMS_СтатусыРеестра.Создан, "VALIDATION");
	Результат.Вставить(Перечисления.AMS_СтатусыРеестра.Согласован, "APPROVED");
	Результат.Вставить(Перечисления.AMS_СтатусыРеестра.Отменен, "REJECT");
	Результат.Вставить(Перечисления.AMS_СтатусыРеестра.Перерасчет, "RECALCULATION");

	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#КонецОбласти