#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьСообщение(Сообщение) Экспорт
	
    Менеджер = РегистрыСведений.AMS_ЖурналСообщенийПоРеестрам.СоздатьМенеджерЗаписи();
	Менеджер.Идентификатор = Строка(Новый УникальныйИдентификатор);
	Менеджер.Сообщение     = Сообщение;
	Менеджер.Записать(Истина);
	
	Возврат Менеджер.Идентификатор;
	
КонецФункции	

Функция ПолучитьСообщение(Идентификатор) Экспорт

	Менеджер = РегистрыСведений.AMS_ЖурналСообщенийПоРеестрам.СоздатьМенеджерЗаписи();
	Менеджер.Идентификатор = Идентификатор;
	Менеджер.Прочитать();
	
	Возврат Менеджер.Сообщение;
	
КонецФункции	

Процедура ЗафиксироватьОбработку(Идентификатор) Экспорт
	
	Менеджер = РегистрыСведений.AMS_ЖурналСообщенийПоРеестрам.СоздатьМенеджерЗаписи();
	Менеджер.Идентификатор = Идентификатор;
	Менеджер.Прочитать();
	Менеджер.Обработан = Истина;
	Менеджер.Записать(Истина);
	
КонецПроцедуры	

Процедура ЗафиксироватьОшибку(Идентификатор, Ошибка) Экспорт
	
	Менеджер = РегистрыСведений.AMS_ЖурналСообщенийПоРеестрам.СоздатьМенеджерЗаписи();
	Менеджер.Идентификатор = Идентификатор;
	Менеджер.Прочитать();
	Менеджер.ОписаниеОшибки = Ошибка;
	Менеджер.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
#КонецОбласти

#КонецЕсли