
#Область СлужебныеПроцедуры

Функция ПараметрыПодключенияRabbitMQ(УзелИнформационнойБазы, ВидПроцедуры) Экспорт

	Результат = Новый Структура();
	
	Результат.Вставить("Адрес", "");
	Результат.Вставить("Порт", 0);
	Результат.Вставить("Логин", "");
	Результат.Вставить("Пароль", "");
	Результат.Вставить("ВиртуальныйХост", "");
	Результат.Вставить("ТекстСообщения", "");	
	Результат.Вставить("РазмерПорции", 0);
	
	ЗаполнитьЗначенияСвойств(Результат, УзелИнформационнойБазы);
	
	Если ВидПроцедуры = "Загрузка" Тогда
		Результат.Вставить("ТочкаОбмена", УзелИнформационнойБазы.ТочкаОбменаПолучение);
		Результат.Вставить("ИмяОчереди" , УзелИнформационнойБазы.ИмяОчередиПолучение);
	Иначе
		Результат.Вставить("ТочкаОбмена", УзелИнформационнойБазы.ТочкаОбменаОтправка);
		Результат.Вставить("ИмяОчереди" , УзелИнформационнойБазы.ИмяОчередиОтправка);	
	КонецЕсли;
	
	Если ФункциональностьAMSДоступна("G1C-50") Тогда
		
		ДанныеПодключения = Справочники.AMS_НастройкиVault.ПолучитьСекрет(УзелИнформационнойБазы.Интеграция);
		ЗаполнитьЗначенияСвойств(Результат, ДанныеПодключения);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПроверитьПодключениеСервер(Параметры) Экспорт
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ПроверитьПодключениеКлиентСервер(КлиентКомпоненты, Параметры);
	
КонецПроцедуры

&НаСервере
Функция ОтправитьСообщениеСервер(Параметры) Экспорт
	
	Если НЕ ИспользуетсяИнтеграцияЧерезHttp() Тогда
		
		КлиентКомпоненты = ПолучитьКомпонентуСервер();	
		Возврат ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, Параметры);
		
	КонецЕсли;
	
	Возврат ОтправитьСообщениеСерверHttp(Параметры);
	
КонецФункции

&НаСервере
Функция ПолучитьСообщениеСервер(Параметры) Экспорт
	
	Если НЕ ИспользуетсяИнтеграцияЧерезHttp() Тогда
		
		КлиентКомпоненты = ПолучитьКомпонентуСервер();
		Возврат ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты, Параметры);
		
	КонецЕсли;
	
	Возврат ПолучитьСообщениеСерверHttp(Параметры);
	
КонецФункции

Функция ТекстЗапросаИзмененийПланаОбмена(Состав, НаименованиеПланаОбмена) Экспорт 

	Результат = "";
	
	ШаблонЗапроса = "ВЫБРАТЬ
					|	ЕСТЬNULL(ТекущийЭлементОбмена.НомерСообщения, ТекущийПланОбмена.НомерОтправленного + 1) КАК НомерСообщения,
					|	%3,
					|	%4
					|ИЗ
					|	%1.Изменения КАК ТекущийЭлементОбмена
					|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.%2 КАК ТекущийПланОбмена
					|		ПО (ТекущийЭлементОбмена.Узел = ТекущийПланОбмена.Ссылка)
					|ГДЕ
					|	ТекущийЭлементОбмена.Узел = &Узел;
					|////////////////////////////////////////////////////////////////////////////////";
	
	Для Каждого Элемент Из Состав Цикл
		
		ЭтоРегистрСведений = СтрНайти(Элемент, "РегистрСведений.") > 0;
		
		Если ЭтоРегистрСведений Тогда
			
			ИмяРегистра  = СтрЗаменить(Элемент, "РегистрСведений.","");
			Регистр 	 = МетаДанные.РегистрыСведений[ИмяРегистра];   
			СтрокаДанных = "";
			
			Если Регистр.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
				ШаблонДляНовогоИзмерения = "ТекущийЭлементОбмена.%1 КАК %1";
				СтрокаДанных = СтрокаДанных + СтрШаблон(ШаблонДляНовогоИзмерения, "Регистратор") + ",";
			Иначе	
				
				Для Каждого Измерение Из Регистр.Измерения Цикл
					ШаблонДляНовогоИзмерения = "ТекущийЭлементОбмена.%1 КАК %1";
					СтрокаДанных = СтрокаДанных + СтрШаблон(ШаблонДляНовогоИзмерения, Измерение.Имя) + ",";
				КонецЦикла;
			КонецЕсли;
			СтрокаДанных = Лев(СтрокаДанных, СтрДлина(СтрокаДанных) - 1);
			
			ШаблонТипДанных	= """%1"" КАК Тип";
			СтрокаТипДанных	= СтрШаблон(ШаблонТипДанных, ИмяРегистра);
			
		Иначе
			
			СтрокаДанных	= "ТекущийЭлементОбмена.Ссылка КАК Ссылка";
			СтрокаТипДанных	= "ТИПЗНАЧЕНИЯ(ТекущийЭлементОбмена.Ссылка) КАК Тип"; 
			
		КонецЕсли;

		ЗапросКЭлементу = СтрШаблон(ШаблонЗапроса, Элемент, НаименованиеПланаОбмена, СтрокаДанных, СтрокаТипДанных);
		Результат = Результат + ЗапросКЭлементу + Символы.ПС;
		
	КонецЦикла;
	
	Результат = Лев(Результат, СтрДлина(Результат) - 17);
	
	Возврат Результат;
	
КонецФункции
							
#КонецОбласти

#Область ПроцедурыРаботаСRabbitMQ

#Область ПодключениеИнициализацияКомпоненты

&НаСервере
Процедура ПодключитьКомпонентуСервер(КомпонентаПодключена = Неопределено) 
	
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановкиНаСервере(Новый УникальныйИдентификатор());
	
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(АдресВоВременномХранилище, "BITERP", ТипВнешнейКомпоненты.Native);
	
	Если КомпонентаПодключена Тогда
		Сообщить(НСтр("ru = 'Компонента подключена!'"));
	Иначе
		Сообщить(НСтр("ru = 'Не удалось подключить компоненту!'"));	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор)
	
	МакетВнешнейКомпоненты    = ПолучитьОбщийМакет("PinkRabbitMQ");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

&НаСервере
Функция ПолучитьКомпонентуСервер()
	
	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты) Тогда
		
		ПодключитьКомпонентуСервер();
		ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты);
		
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
	
КонецФункции

&НаСервере
Функция ИнициализироватьКомпонентуКлиентСервер(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ПроверитьПодключениеКлиентСервер(КлиентКомпоненты, Параметры)
	
	Попытка
		КлиентКомпоненты.Connect(
				Параметры.Адрес,
				Параметры.Порт,
				Параметры.Логин,
				Параметры.Пароль,
				Параметры.ВиртуальныйХост);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка подключения! %СистемнаяОшибка%.";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", КлиентКомпоненты.GetLastError());
		
		КлиентКомпоненты = Неопределено;
		
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	КлиентКомпоненты = Неопределено;
	Сообщить(НСтр("ru = 'Подключение успешно выполнено!'"));
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты, Параметры)

	ПолученныеСообщения = Новый Массив();
	РезультатПолучения = Новый Структура("Успех, ВходящееСообщение, ТекстОшибки", Истина, "", "");
	
	Попытка
		
		КлиентКомпоненты.Connect(
			Параметры.Адрес,
			Параметры.Порт,
			Параметры.Логин,
			Параметры.Пароль,
			Параметры.ВиртуальныйХост);
			
		ИмяОчереди = Параметры.ИмяОчереди;
			
		Попытка
			
			КлиентКомпоненты.DeclareQueue(ИмяОчереди, Истина, Ложь, Ложь, Ложь);
			Потребитель = КлиентКомпоненты.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			
			ОчередьПустая		 = Ложь;
			ОтветноеСообщение	 = "";
			ТегСообщения		 = 0;
			СообщенийЗагружено  = 0;
			КоличествоОграничено = Параметры.РазмерПорции > 0;
			
			Пока НЕ ОчередьПустая Цикл
				
				РезультатПолучения = Новый Структура("Успех, ВходящееСообщение, ТекстОшибки", Истина, "", "");
				
				Если КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, ТегСообщения) Тогда
					КлиентКомпоненты.BasicAck();
					РезультатПолучения.ВходящееСообщение = ОтветноеСообщение;					
				Иначе
					ОчередьПустая = Истина;
				КонецЕсли;
				
				ОтветноеСообщение = "";
				ТегСообщения	  = 0;
				
				ПолученныеСообщения.Добавить(РезультатПолучения);
				
				СообщенийЗагружено = СообщенийЗагружено + 1;
				
				Если КоличествоОграничено И Параметры.РазмерПорции = СообщенийЗагружено Тогда
					ОчередьПустая = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		Исключение
			ТекстОшибки = КлиентКомпоненты.GetLastError();
		КонецПопытки;
		
	Исключение
		
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", КлиентКомпоненты.GetLastError());
		
		РезультатПолучения.Успех = Ложь;
		РезультатПолучения.ТекстОшибки = ТекстСообщения;
		ПолученныеСообщения.Добавить(РезультатПолучения);
		
	КонецПопытки;
	
	КлиентКомпоненты.BasicCancel("");
	КлиентКомпоненты = Неопределено;
	
	Возврат ПолученныеСообщения;
	
КонецФункции

&НаСервере
Функция ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, Параметры)
	
	РезультатОтправки = Новый Структура("Успех, ТекстОшибки", Истина, "");
	
	Попытка
		
		КлиентКомпоненты.Connect(
			Параметры.Адрес,
			Параметры.Порт,
			Параметры.Логин,
			Параметры.Пароль,
			Параметры.ВиртуальныйХост);
		
		КлиентКомпоненты.BasicPublish(Параметры.ТочкаОбмена, Параметры.ИмяОчереди, Параметры.ТекстСообщения, 0, Ложь);
			
	Исключение
			
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", КлиентКомпоненты.GetLastError());
		
		РезультатОтправки.Успех = Ложь;
		РезультатОтправки.ТекстОшибки = ТекстСообщения;
		
	КонецПопытки;
	
	КлиентКомпоненты = Неопределено;
	
	Возврат РезультатОтправки;
	
КонецФункции

#Область ПроцедурыРаботаСRabbitMQЧерезHttp

Функция ИспользуетсяИнтеграцияЧерезHttp()
	
	Возврат Константы.ИспользоватьHTTPДляИнтеграцииRMQ.Получить();
	
КонецФункции	

Функция ОтправитьСообщениеСерверHttp(Параметры)
	
	РезультатОтправки = Новый Структура("Успех, ТекстОшибки", Истина, "");
	
	Соединение = УстановитьСоединениеСRMQ(Параметры);
	Запрос	   = СформироватьЗапрос(Параметры, "Отправка");
	
	Сообщение  = СообщениеRMQОтправкаСтруктураПараметров();
    Сообщение.payload 	  = Параметры.ТекстСообщения; 
    Сообщение.routing_key = Параметры.ТочкаОбмена;
	
	Запрос.УстановитьТелоИзСтроки(СформироватьСтрокуJSON(Сообщение, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением));
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);	
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		РезультатОтправки.Успех = Ложь;
		РезультатОтправки.ТекстОшибки   = Ответ.ПолучитьТелоКакСтроку();
		
	КонецЕсли;
	
	Возврат РезультатОтправки;
	
КонецФункции

Функция ПолучитьСообщениеСерверHttp(Параметры)
	
	ПолученныеСообщения = Новый Массив;
	
	Соединение = УстановитьСоединениеСRMQ(Параметры);
	Запрос	   = СформироватьЗапрос(Параметры, "Получение");
    Сообщение  = СообщениеRMQПолучениеСтруктураПараметров();
	
	Запрос.УстановитьТелоИзСтроки(СформироватьСтрокуJSON(Сообщение, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением));
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	ДанныеОтвета = Ответ.ПолучитьТелоКакСтроку();
	Данные = ПолучитьСтруктуруJSON(ДанныеОтвета);
	
	Для каждого РезультатОтвета Из Данные Цикл
	
		РезультатПолучения = Новый Структура("Успех, ВходящееСообщение, ТекстОшибки", Истина, "", "");
		РезультатПолучения.ВходящееСообщение = РезультатОтвета.payload;
	    ПолученныеСообщения.Добавить(РезультатПолучения);
		
	КонецЦикла;
	
	Возврат ПолученныеСообщения;
	
КонецФункции

Функция УстановитьСоединениеСRMQ(Параметры)
	
	СтандартноеОтклонениеПорта = 10000;
	
	Результат = Новый HTTPСоединение(
			Параметры.Адрес, 
			Параметры.Порт + СтандартноеОтклонениеПорта,
			Параметры.Логин,
			Параметры.Пароль);
			
	Возврат Результат;		
	
КонецФункции	

Функция СформироватьЗапрос(Параметры, ТипЗапроса)
	
	Метод = "publish";
	API	  = "exchanges";
	ИмяКанала = Параметры.ИмяОчереди;
	Если ТипЗапроса = "Получение" Тогда
		
		Метод = "get";
		API	  = "queues";
		ИмяКанала = Параметры.ИмяОчереди;
		
	КонецЕсли;	
	
	АдресРесурса = "/api/" + API + "/" + Параметры.ВиртуальныйХост + "/" + ИмяКанала + "/" + Метод;
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат ЗапросHTTP;
	
КонецФункции	

Функция СообщениеRMQПолучениеСтруктураПараметров()

	Результат = Новый Структура;
	Результат.Вставить("count", 	1000);
	Результат.Вставить("requeue", 	0);
	Результат.Вставить("encoding", 	"auto");
	Результат.Вставить("truncate", 	"10000000");
	Результат.Вставить("ackmode", 	"ack_requeue_false");
	
	Возврат Результат;

КонецФункции

Функция СообщениеRMQОтправкаСтруктураПараметров()

	Результат = Новый Структура;
	Результат.Вставить("routing_key", 		"");
	Результат.Вставить("payload", 			"");
	Результат.Вставить("payload_encoding", 	"string");
	Результат.Вставить("props", 			Новый Структура);
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("delivery_mode", 2);
	Результат.Вставить("properties", СтруктураНастроек);
	
	Возврат Результат;

КонецФункции
#КонецОбласти

#КонецОбласти 

// Формирование строки JSON по произвольным данным
//
// Параметры:
//  <Данные>  - <Произвольный> - Значение которое необходимо сериализовать в JSON
//  <ФорматДаты>  - <ВариантЗаписиДатыJSON> - Вариант записи 
//                 даты в JSON, в случае если параметр на задан устанвливается
//				   ВариантЗаписиДатыJSON.ЛокальнаяДата
//
// Возвращаемое значение:
//   <Строка>   - Строка JSON переданого значения
//
Функция СформироватьСтрокуJSON(Данные, ФорматДаты = Неопределено,
								ЭкранироватьКавычки = Истина) Экспорт
	
	НастройкиДатыJSON = Новый НастройкиСериализацииJSON;
	
	Если ФорматДаты = Неопределено Тогда 
		НастройкиДатыJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	Иначе
		НастройкиДатыJSON.ВариантЗаписиДаты = ФорматДаты;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	// ЗаписьJSON.Параметры.ЭкранироватьОдинарныеКавычки = ЭкранироватьКавычки;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиДатыJSON, "ПреобразованиеJSON", ОбменДаннымиAMS);
	
	Результат = ЗаписьJSON.Закрыть();	
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразованиеJSON(Знач Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
		Возврат СтрЗаменить(Строка(Значение), " ", "");
	КонецЕсли;
	
	Если Значение = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если ТипЗначения = Тип("Булево") Тогда
		Возврат Формат(Значение, "БЛ=false; БИ=true");
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат Строка(Значение);
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьСтруктуруJSON(ТекстСообщения)
	
	Результат = Новый Структура;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТекстСообщения);		
		Результат = ПрочитатьJSON(ЧтениеJSON,,, ФорматДатыJSON.ISO);	
		
	Исключение
		
		Возврат Результат;
		
	КонецПопытки;
	
	Возврат Результат;	
		
КонецФункции
