#Область ПрограммныйИнтерфейс 

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("AMS_СредаЗапуска", "AMS_АдминистрированиеСлужебный.УстановкаПараметровСеанса");
	
КонецПроцедуры

Процедура УстановкаПараметровСеанса(Знач ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = "AMS_СредаЗапуска" Тогда
		
		ПараметрыСеанса.AMS_СредаЗапуска = AMS_Администрирование.ЗаполнитьСредуЗапускаИБ();
		УстановленныеПараметры.Добавить("AMS_СредаЗапуска");
		
		Справочники.AMS_НастройкиVault.ОчиститьДанныеПродуктовойСреды();	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти