#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

//Определяет видимость элементов формы (вызывается в "ПриСозданииНаСервере")
Процедура ВидимостьЭлементовФормы()

	Если Пользователи.РолиДоступны("ЧтениеГуидОбъекта", ПользователиКлиентСервер.ТекущийПользователь(), Ложь) Тогда
		Элементы.ГУИД.Видимость 		= Истина;
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("ИзменениеОтветственного", ПользователиКлиентСервер.ТекущийПользователь(), Ложь) Тогда
		Элементы.Ответственный.Доступность = Истина;
	КонецЕсли;
	
    Элементы.НаименованиеПолное.Видимость = ЗначениеЗаполнено(Объект.Родитель);
	
КонецПроцедуры

#КонецОбласти