#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьЗаполнениеРеквизита() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Период КАК Период,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Регистратор КАК Регистратор,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.НомерСтроки КАК НомерСтроки,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Активность КАК Активность,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Филиал КАК Филиал,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.КаналПродаж КАК КаналПродаж,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ПодканалПродаж КАК ПодканалПродаж,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.КатегорияПродавца КАК КатегорияПродавца,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Банк КАК Банк,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Верификация КАК Верификация,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ГодСтрахования КАК ГодСтрахования,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ТипАгента КАК ТипАгента,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.КатегорияДоговора КАК КатегорияДоговора,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.КБМОт КАК КБМОт,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.КБМДо КАК КБМДо,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ПрограммаПеревод КАК ПрограммаПеревод,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ПрограммаПереход КАК ПрограммаПереход,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Пролонгация КАК Пролонгация,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.РегионСобственника КАК РегионСобственника,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.СтраховойПродукт КАК СтраховойПродукт,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ТипКонтрагента КАК ТипКонтрагента,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ТипТС КАК ТипТС,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ФормаВыплаты КАК ФормаВыплаты,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Франшиза КАК Франшиза,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ЦельИспользованияТС КАК ЦельИспользованияТС,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ЭтоЭлектронноеОсаго КАК ЭтоЭлектронноеОсаго,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Процент КАК Процент,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Отменен КАК Отменен,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	AMS_ОбщиеПравилаРасчетаДополнительногоКВ.ГУИД КАК ГУИД
		|ИЗ
		|	РегистрСведений.AMS_ОбщиеПравилаРасчетаДополнительногоКВ КАК AMS_ОбщиеПравилаРасчетаДополнительногоКВ
		|ИТОГИ ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРегистратор.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаРегистратор.Выбрать();
		
		Набор = РегистрыСведений.AMS_ОбщиеПравилаРасчетаДополнительногоКВ.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаписьНабора = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ВыборкаДетальныеЗаписи);
			ЗаписьНабора.ГУИД = Строка(Новый УникальныйИдентификатор);
			
		КонецЦикла;
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать(Истина);
		
	КонецЦикла;
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли