#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
		
	Для Каждого Строка Из ИсходныеДанные Цикл 
		
		Если Не Строка.Свойство("Продавец") Тогда
			
			Комментарий = "Для справочника не заполнен обязательный реквизит Продавец";
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Продавцы", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			
			Возврат;
			
		КонецЕсли;	
		
		СправочникЭлемент = Справочники.AMS_Продавцы.НайтиПоРеквизиту("ГУИДЦССУ", Строка.Продавец);
		
		Если СправочникЭлемент.Пустая() Тогда
			
			СправочникЭлемент = Справочники.AMS_Продавцы.НайтиПоРеквизиту("ГУИДЦССУ", Строка.ГУИД);
			
		КонецЕсли;	
			
		Если СправочникЭлемент.Пустая() Тогда 
			
			ПродавецОбъект = Справочники.AMS_Продавцы.СоздатьЭлемент();		
		Иначе
			
			ПродавецОбъект = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПродавецОбъект, Строка);
		
		ДозаполнитьОбъектПродавец(ПродавецОбъект, Строка);
		
		Попытка
			
			ПродавецОбъект.ОбменДанными.Загрузка = Истина;
			ПродавецОбъект.Записать();
			
			Комментарий = СтрШаблон("Успешно записан продавец с УИД %1", Строка.Продавец);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Продавцы", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_Продавцы, ПродавецОбъект.Ссылка, Комментарий);
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Продавцы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_Продавцы, ПродавецОбъект.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДозаполнитьОбъектПродавец(ПродавецОбъект, Строка)
	
	ПродавецОбъект.ГУИДЦССУ = Строка.Продавец;
	ПродавецОбъект.ГУИД = Строка.ГУИД;
	ПродавецОбъект.Владелец = ЭлементСправочникаПоЦССУ("AMS_Агенты", Строка.Владелец);
	ПродавецОбъект.ПросмотрРеестраУбытков = Истина;
	
	Если ЗначениеЗаполнено(ПродавецОбъект.Ссылка) Тогда
		
		ЭтоПродавецИсключение = РегистрыСведений
					.AMS_ПродавцыИсключенияДляВидимостиInsapp
					.ЭтоПродавецИсключение(ПродавецОбъект.Ссылка);
					
		ПродавецОбъект.ИспользованиеВиджетаInsapp = ЭтоПродавецИсключение;
		
	Иначе
		
		ПродавецОбъект.ИспользованиеВиджетаInsapp = Ложь;	
		
	КонецЕсли;	
	
КонецПроцедуры

// Возвращает данные продавца вместе со связанными данными
//
// Параметры:
//  Продавец  - СправочникСсылка.AMS_Продавцы - Ссылка на справочник продавца
//
// Возвращаемое значение:
//   Структура - Структура данных продавца
//
Функция ДанныеПродавцаПоСсылке(Продавец) Экспорт
	
	ПоляСтруктуры = "Продавец, Агент, Филиал, ВидТерритории, КаналПродаж, ПодканалПродаж,
			| Куратор, АгентскийДоговор, ТипАгента, Уволен, КатегорияАгента, 
			| ГУИД, КаналПродажГУИД, ПодканалПродажГУИД, ФилиалГУИД, АгентГУИД, Наименование, ОтображатьРейтинг,
			| ПросмотрРеестраУбытков, ИспользованиеВиджетаInsapp";
	
	Результат = Новый Структура(ПоляСтруктуры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникAMS_Продавцы.Ссылка КАК Ссылка,
		|	СправочникAMS_Продавцы.Владелец КАК Агент,
		|	AMS_ИнформацияОПродавцеСрезПоследних.АгентскийДоговор.Филиал КАК Филиал,
		|	AMS_ИнформацияОПродавцеСрезПоследних.ВидТерритории КАК ВидТерритории,
		|	AMS_ИнформацияОПродавцеСрезПоследних.КаналПродаж КАК КаналПродаж,
		|	AMS_ИнформацияОПродавцеСрезПоследних.ПодканалПродаж КАК ПодканалПродаж,
		|	AMS_ИнформацияОПродавцеСрезПоследних.Куратор КАК Куратор,
		|	AMS_ИнформацияОПродавцеСрезПоследних.АгентскийДоговор КАК АгентскийДоговор,
		|	AMS_ИнформацияОПродавцеСрезПоследних.Уволен КАК Уволен,
		|	СправочникAMS_Продавцы.Наименование КАК Наименование,
		|	СправочникAMS_Продавцы.ОтображатьРейтинг КАК ОтображатьРейтинг,
		|	СправочникAMS_Продавцы.ПросмотрРеестраУбытков КАК ПросмотрРеестраУбытков,
		|	СправочникAMS_Продавцы.ИспользованиеВиджетаInsapp КАК ИспользованиеВиджетаInsapp
		|ПОМЕСТИТЬ ВТ_ИнформацияОбщая
		|ИЗ
		|	Справочник.AMS_Продавцы КАК СправочникAMS_Продавцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_ИнформацияОПродавце.СрезПоследних(, ) КАК AMS_ИнформацияОПродавцеСрезПоследних
		|		ПО (AMS_ИнформацияОПродавцеСрезПоследних.Продавец = СправочникAMS_Продавцы.Ссылка)
		|ГДЕ
		|	СправочникAMS_Продавцы.Ссылка = &Продавец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ИнформацияОбщая.Ссылка КАК Продавец,
		|	ВТ_ИнформацияОбщая.Агент КАК Агент,
		|	ВТ_ИнформацияОбщая.Филиал КАК Филиал,
		|	ВТ_ИнформацияОбщая.ВидТерритории КАК ВидТерритории,
		|	ВТ_ИнформацияОбщая.КаналПродаж КАК КаналПродаж,
		|	ВТ_ИнформацияОбщая.ПодканалПродаж КАК ПодканалПродаж,
		|	ВТ_ИнформацияОбщая.Куратор КАК Куратор,
		|	AMS_СостояниеАгентскогоДоговораСрезПоследних.АгентскийДоговор КАК АгентскийДоговор,
		|	ВТ_ИнформацияОбщая.Агент.ТипКонтрагента КАК ТипАгента,
		|	ВТ_ИнформацияОбщая.Ссылка.ГУИД КАК ГУИД,
		|	ВТ_ИнформацияОбщая.КаналПродаж.ГУИД КАК КаналПродажГУИД,
		|	ВТ_ИнформацияОбщая.ПодканалПродаж.ГУИД КАК ПодканалПродажГУИД,
		|	ВТ_ИнформацияОбщая.Филиал.ГУИДФилиалаВЮПро КАК ФилиалГУИД,
		|	ВТ_ИнформацияОбщая.Агент.ГУИД КАК АгентГУИД,
		|	AMS_СостояниеАгентскогоДоговораСрезПоследних.АгентскийДоговор.КатегорияАгента КАК КатегорияАгента,
		|	ВТ_ИнформацияОбщая.Уволен КАК Уволен,
		|	ВТ_ИнформацияОбщая.Наименование КАК Наименование,
		|	ВТ_ИнформацияОбщая.ОтображатьРейтинг КАК ОтображатьРейтинг,
		|	ВТ_ИнформацияОбщая.ИспользованиеВиджетаInsapp КАК ИспользованиеВиджетаInsapp,
		|	ВТ_ИнформацияОбщая.ПросмотрРеестраУбытков КАК ПросмотрРеестраУбытков
		|ИЗ
		|	ВТ_ИнформацияОбщая КАК ВТ_ИнформацияОбщая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_СостояниеАгентскогоДоговора.СрезПоследних КАК AMS_СостояниеАгентскогоДоговораСрезПоследних
		|		ПО ВТ_ИнформацияОбщая.АгентскийДоговор = AMS_СостояниеАгентскогоДоговораСрезПоследних.АгентскийДоговор";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт
	
	 Результат = ПолучитьСтруктуруСообщения();
	 ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);	 	 
	 Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	 //Данные = СтрЗаменить(Данные, """""", "null");
	 
	 Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)

	ДанныеПродавца = ДанныеПродавцаПоСсылке(ОбъектСсылка);	
	
	Результат.guid					 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ГУИД);
	Результат.fullName 				 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.Наименование);
	Результат.intermediateSellerGuid = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.АгентГУИД);
	Результат.viewRating 			 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ОтображатьРейтинг);
	Результат.saleChannelGuid 		 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.КаналПродажГУИД);
	Если ЗначениеЗаполнено(ДанныеПродавца.ПодканалПродаж) И 
			ЗначениеЗаполнено(ДанныеПродавца.ПодканалПродаж.Родитель) Тогда 
		Результат.saleSubchannelGuid 	 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ПодканалПродажГУИД);
	КонецЕсли;	
	Результат.filialGuid 			 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ФилиалГУИД);
	Результат.fired 			 	 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.Уволен);
	
	Если ФункциональностьAMSДоступна("AGENTS-2486") Тогда
		Результат.viewLosses 	= ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ПросмотрРеестраУбытков);
		Результат.widgetInsapp  = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ИспользованиеВиджетаInsapp);	
	КонецЕсли;
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "Seller");
	Результат.Вставить("guid");
	Результат.Вставить("fullName");
	Результат.Вставить("intermediateSellerGuid");
	Результат.Вставить("viewRating");
	Результат.Вставить("saleChannelGuid");
	Результат.Вставить("saleSubchannelGuid", null);
	Результат.Вставить("filialGuid");
	Результат.Вставить("fired");
	
	Если ФункциональностьAMSДоступна("AGENTS-2486") Тогда
		Результат.Вставить("viewLosses", Ложь);
		Результат.Вставить("widgetInsapp", Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли