#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(СтраховойРиск, СтраховойПродукт) Экспорт
	
	Результат = Новый Массив;
	
	ЗаполнитьДанныеРиск(СтраховойРиск, СтраховойПродукт, Результат);
	
	Возврат Результат;
	
КонецФункции	

#Область СообщениеДляМАМС

Функция ПолучитьСтруктуруСообщенияРиски()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "RiskMapping");
	Результат.Вставить("guid");
	Результат.Вставить("riskGuid");
	Результат.Вставить("productGuid");
	Результат.Вставить("name");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеРиск(СтраховойРиск, СтраховойПродукт, Результат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеСтраховыхРисков.НаименованиеРиска КАК name,
		|	СоответствиеСтраховыхРисков.Идентификатор КАК guid,
		|	СоответствиеСтраховыхРисков.СтраховойРиск.ГУИД КАК riskGuid,
		|	СоответствиеСтраховыхРисков.СтраховойПродукт.ГУИД КАК productGuid
		|ИЗ
		|	РегистрСведений.СоответствиеСтраховыхРисков КАК СоответствиеСтраховыхРисков
		|ГДЕ
		|	СоответствиеСтраховыхРисков.СтраховойРиск = &СтраховойРиск
		|	И СоответствиеСтраховыхРисков.СтраховойПродукт = &СтраховойПродукт";
	
	Запрос.УстановитьПараметр("СтраховойРиск", СтраховойРиск);
	Запрос.УстановитьПараметр("СтраховойПродукт", СтраховойПродукт);
	Выборка = Запрос.Выполнить().Выбрать();;
	Выборка.Следующий();
	
	Риски = ПолучитьСтруктуруСообщенияРиски();
	ЗаполнитьЗначенияСвойств(Риски, Выборка);

	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Риски, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	Результат.Добавить(Данные);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли