#Область ПрограммныйИнтерфейс

// Расчитывает контрольное значение
//
// Параметры:
//  ПараметрыУсловий  - Массив - Массив условий, каждое условие Структура
//                 с.м. Условие() 
//
// Возвращаемое значение:
//   Строка   - Контрольная сумма условий
//
Функция КонтрольноеЧислоКлюча(ПараметрыУсловий, СписокКлючей = Неопределено) Экспорт

	КонтрольнаяСтрока = "";
	
	Для каждого Параметр Из ПараметрыУсловий Цикл
	
		Для каждого КлючЗначение Из Параметр Цикл
		
			КонтрольнаяСтрока = КонтрольнаяСтрока +
					XMLСтрока(КлючЗначение.Ключ)  +
					XMLСтрока(Новый ХранилищеЗначения(КлючЗначение.Значение));
		
		КонецЦикла;	
	
	КонецЦикла;
	
	Если СписокКлючей <> Неопределено Тогда
		
		 Для каждого Ключ Из СписокКлючей Цикл
		 
		 	 КонтрольнаяСтрока = КонтрольнаяСтрока + Ключ.КлючУсловий.КонтрольноеЧисло + Строка(Ключ.ОсновнойКлюч);
		 
		 КонецЦикла;
		
	КонецЕсли;	
	
	
	Хэш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хэш.Добавить(КонтрольнаяСтрока);
	
	Возврат XMLСтрока(Хэш.ХешСумма);
	
КонецФункции

// Преобразует таблицу условий в массив
//
// Параметры:
//  ТаблицаУсловий  - ТаблицаЗначений - с.м. Табличная часть AMS_КлючиУсловий
//
// Возвращаемое значение:
//   Массив   - МассивУсловий
//
Функция ПреобразоватьТаблицуУсловийВМассив(ТаблицаУсловий) Экспорт

	Результат = Новый Массив;
	
	Для каждого СтрокаУсловий Из ТаблицаУсловий Цикл
	
		Условие = Условие();
		ЗаполнитьЗначенияСвойств(Условие, СтрокаУсловий);
	    Результат.Добавить(Условие);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭлементКлючаУсловий(Знач ПараметрыУсловий) Экспорт
	
	Если ТипЗнч(ПараметрыУсловий) = Тип("ТаблицаЗначений") Тогда
		
		ПараметрыУсловий = ПреобразоватьТаблицуУсловийВМассив(ПараметрыУсловий);
		
	КонецЕсли;
	
	КонтрольноеЧисло = КонтрольноеЧислоКлюча(ПараметрыУсловий);
	
	ЭлементСправочника = Справочники.AMS_КлючиУсловий.НайтиПоРеквизиту("КонтрольноеЧисло", КонтрольноеЧисло);
	
	Если ЗначениеЗаполнено(ЭлементСправочника) Тогда
		
		Возврат ЭлементСправочника;
		
	КонецЕсли;
	
	ОбъектСправочника = Справочники.AMS_КлючиУсловий.СоздатьЭлемент();
	ОбъектСправочника.КонтрольноеЧисло = КонтрольноеЧисло;
	
	Для каждого Условие Из ПараметрыУсловий Цикл
	
		СтрокаУсловий = ОбъектСправочника.НаборУсловий.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУсловий, Условие);
	
	КонецЦикла;
	ОбъектСправочника.Записать();
	
	Возврат ОбъектСправочника.Ссылка;
	
КонецФункции

Функция СтруктураПростыхУсловий(ТолькоУсловия = Ложь) Экспорт

	Результат = Новый Структура();
	Результат.Вставить("Параметр");
	Результат.Вставить("ОператорСравнения");
	Результат.Вставить("Значение");
	Результат.Вставить("ЗначениеПроизвольногоТипа");
	Если НЕ ТолькоУсловия Тогда
		
		Результат.Вставить("КлючСвязи");
		Результат.Вставить("КлючСвязиСложногоУсловия");
		Результат.Вставить("ОсновноеУсловие", Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПростойКлюч(КлючУсловий) Экспорт
	
	Возврат КлючУсловий.НаборУсловий.Количество() > 0;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПрограммныйИнтерфейс

Функция Условие() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Параметр", ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПустаяСсылка());
	Результат.Вставить("Значение");
	Результат.Вставить("ОператорСравнения", Справочники.AMS_ВидыСравнения.Равно);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти