#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьЗаполнениеРеквизита() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Период КАК Период,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Регистратор КАК Регистратор,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.НомерСтроки КАК НомерСтроки,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Активность КАК Активность,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Организация КАК Организация,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Филиал КАК Филиал,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Агент КАК Агент,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.АгентскийДоговор КАК АгентскийДоговор,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Банк КАК Банк,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Верификация КАК Верификация,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ГодСтрахования КАК ГодСтрахования,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ТипАгента КАК ТипАгента,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.КатегорияДоговора КАК КатегорияДоговора,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.КБМОт КАК КБМОт,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.КБМДо КАК КБМДо,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ПрограммаПеревод КАК ПрограммаПеревод,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ПрограммаПереход КАК ПрограммаПереход,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Пролонгация КАК Пролонгация,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.РегионСобственника КАК РегионСобственника,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.СтраховойПродукт КАК СтраховойПродукт,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ТипКонтрагента КАК ТипКонтрагента,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ТипТС КАК ТипТС,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ФормаВыплаты КАК ФормаВыплаты,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Франшиза КАК Франшиза,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ЦельИспользованияТС КАК ЦельИспользованияТС,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ЭтоЭлектронноеОсаго КАК ЭтоЭлектронноеОсаго,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Процент КАК Процент,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.Отменен КАК Отменен,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.ГУИД КАК ГУИД
		|ИЗ
		|	РегистрСведений.AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ КАК AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ
		|ИТОГИ ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРегистратор.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаРегистратор.Выбрать();
		
		Набор = РегистрыСведений.AMS_ИндивидуальныеПравилаРасчетаДополнительногоКВ.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаписьНабора = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ВыборкаДетальныеЗаписи);
			ЗаписьНабора.ГУИД = Строка(Новый УникальныйИдентификатор);
			
		КонецЦикла;
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать(Истина);
		
	КонецЦикла;
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли