#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфей

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	Идентификаторы				 = ИдентификаторыПредопределенныхДанныхГУИД();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		ВидыСравненияОбъект							 = КлючЗначение.Ключ.ПолучитьОбъект();
		ВидыСравненияОбъект.ГУИД					 = КлючЗначение.Значение;
		ВидыСравненияОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ИдентификаторыПредопределенныхДанныхГУИД()

	Результат = Новый Соответствие;
	Результат.Вставить(Справочники.РолиСогласующихЛиц.Андеррайтер, "39d5152a-3e8d-4247-bce4-1c6ad35990db");
	Результат.Вставить(Справочники.РолиСогласующихЛиц.КураторКаналаПродаж, "81fe6fbe-cab6-4b06-a7d4-c36be8691c60");
	Результат.Вставить(Справочники.РолиСогласующихЛиц.ДиректорФилиала, "59f5fcc4-dcb5-40a0-9f4d-7ab7ca42832a");
	Результат.Вставить(Справочники.РолиСогласующихЛиц.РуководительРегиональнойДирекции, "76ae14f0-eeca-4ea7-80ca-c916eeab315a");
	
	Возврат Результат;
	
КонецФункции	
	
#КонецЕсли