
&НаКлиенте
Процедура ПеренестиЗначения(Команда)
	
	Если НЕ ЗначениеЗаполнено(Филиал) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Филиал"" не заполнено",,"Филиал",,Истина);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КаналПродаж) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Канал продаж"" не заполнено",,"КаналПродаж",,Истина);
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Филиал", Филиал);
	СтруктураОтбора.Вставить("КаналПродаж", КаналПродаж);
	
	ОповеститьОВыборе(СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

