#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт
	
	Менеджер = Справочники.ШаблоныПисем;
	ТаблицаДанных = ОбщегоНазначенияAMS.ПолучитьТаблицуМакета("ПредопределенныеЗначения", Менеджер);
	
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
	
		ЗаполнитьЗначениеПредопределенныйЭлемент(СтрокаДанных, Менеджер)
	
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЗначениеПредопределенныйЭлемент(Данные, Менеджер)

	ЭлементОбъект = Менеджер[Данные.Элемент].ПолучитьОбъект();
	ЭлементОбъект.ПолноеНаименование = ЭлементОбъект.Наименование;
	ЭлементОбъект.Процесс = Справочники.Процессы[Данные.Процесс];
	ЭлементОбъект.ТекстПисьма = Данные.ТекстСообщения;
	ЭлементОбъект.Записать();
		
КонецПроцедуры	
	
#КонецОбласти 

#КонецЕсли