#Область ОбработчикиСобытий

&НаКлиенте
Процедура ДополнительноеСоглашениеПриИзменении(Элемент)
	ВидимостьДопСоглашения();
КонецПроцедуры

&НаКлиенте
Процедура УсловияВознагражденияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если ЗначениеЗаполнено(Объект.ТипЗначений) Тогда
		
		МассивОграничения = Новый Массив();
		
		Если Объект.ТипЗначений = ПредопределенноеЗначение("Перечисление.ТипУсловияВознагражденияИКУ.ВидыСтрахования") Тогда
			
			МассивОграничения.Добавить(Тип("СправочникСсылка.AMS_ВидыСтрахования"));
			
		ИначеЕсли Объект.ТипЗначений = ПредопределенноеЗначение("Перечисление.ТипУсловияВознагражденияИКУ.ВидыСтраховыхПродуктов") Тогда
			
			МассивОграничения.Добавить(Тип("СправочникСсылка.AMS_ВидыСтраховыхПродуктов"));
			
		ИначеЕсли Объект.ТипЗначений = ПредопределенноеЗначение("Перечисление.ТипУсловияВознагражденияИКУ.СтраховыеПродукты") Тогда
			
			МассивОграничения.Добавить(Тип("СправочникСсылка.AMS_СтраховыеПродукты"));
			
		КонецЕсли;
		
		ОписаниеТипов = Новый ОписаниеТипов(МассивОграничения);
		
		Элементы.ТипЗначений.ОграничениеТипа = ОписаниеТипов;
		Элемент.ТекущиеДанные.НаборЗначений = ОписаниеТипов.ПривестиЗначение(Элемент.ТекущиеДанные.НаборЗначений);	
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ИдентификаторСтроки) Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Объект.ДополнительноеСоглашение Тогда
		Объект.ПричинаВнесенияИзменений = ПредопределенноеЗначение("Перечисление.ПричиныИзмененияДоговораИКУ.ПустаяСсылка");
		Объект.ДатаДосрочногоРасторжения = '00010101';
		Объект.ПричинаРасторжения = ПредопределенноеЗначение("Перечисление.AMS_ПричиныРасторженияАД.ПустаяСсылка");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДоговорИКУ) Тогда
		Если Объект.РегистрационныйНомер = "" Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить номер нового договора ИКУ или выбрать существующий",, "Объект.РегистрационныйНомер",,Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ДатаВыплаты < 1 Или Объект.ДатаВыплаты > 31 Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Указана не корректная дата выплаты.",, "Объект.ДатаВыплаты",,Истина);
	КонецЕсли;
	
	Если Объект.ДатаНачалаДействия < Объект.ДатаПодписанияАгентом Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата подписания агентом не может быть больше даты начала действия договора",, "Объект.ДатаПодписанияАгентом",,Истина);
	КонецЕсли;
	
	Если Объект.ДатаОкончанияДействия <= Объект.ДатаНачалаДействия Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата окончания действаия не может быть меньше или равна дате начала действия договора",, "Объект.ДатаОкончанияДействия",,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьДопСоглашения();
КонецПроцедуры

&НаСервере
Процедура АгентОбработкаВыбораНаСервере(Элемент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_УсловияДоговораАгентаСрезПоследних.АгентскийДоговор КАК АгентскийДоговор,
		|	AMS_УсловияДоговораАгентаСрезПоследних.Филиал КАК Филиал,
		|	AMS_УсловияДоговораАгентаСрезПоследних.АгентскийДоговор.Подразделение КАК Подразделение,
		|	AMS_УсловияДоговораАгентаСрезПоследних.ПериодичностьВыплатыКВ КАК ПериодичностьВыплатыКВ,
		|	AMS_УсловияДоговораАгентаСрезПоследних.УдержаниеКомиссии КАК УдержаниеКомиссии,
		|	ЕСТЬNULL(AMS_СостояниеАгентскогоДоговораСрезПоследних.Действует, ЛОЖЬ) КАК Действует
		|ИЗ
		|	РегистрСведений.AMS_УсловияДоговораАгента.СрезПоследних(, Агент = &Агент) КАК AMS_УсловияДоговораАгентаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_СостояниеАгентскогоДоговора.СрезПоследних(, Действует = ИСТИНА) КАК AMS_СостояниеАгентскогоДоговораСрезПоследних
		|		ПО AMS_УсловияДоговораАгентаСрезПоследних.АгентскийДоговор = AMS_СостояниеАгентскогоДоговораСрезПоследних.АгентскийДоговор";
	
	Запрос.УстановитьПараметр("Агент", Элемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Если ВыборкаДетальныеЗаписи.Действует Тогда
			ЗаполнитьЗначенияСвойств(Объект, ВыборкаДетальныеЗаписи);
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Отсутствует действующий агентский договор",,"Объект.АгентскийДоговор",,Истина);
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Условия агентский договора не выполнены",,"Объект.АгентскийДоговор",,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгентОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	АгентОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ВидимостьДопСоглашения()
	
	Элементы.ПричинаВнесенияИзменений.Видимость = Объект.ДополнительноеСоглашение;
	Элементы.ДатаДосрочногоРасторжения.Видимость = Объект.ДополнительноеСоглашение;
	Элементы.ПричинаРасторжения.Видимость = Объект.ДополнительноеСоглашение;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ПериодичностьВыплатыКВ = Перечисления.AMS_РасписаниеВыплатыКВ.Ежемесячно;
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипЗначений) Тогда
		Объект.ТипЗначений = Перечисления.ТипУсловияВознагражденияИКУ.ВидыСтраховыхПродуктов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьУслугУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Стоимость = ПолучитьСтоимостьУслуги(ВыбранноеЗначение);
	ЗаполнитьЗначенияСвойств(ТекущийЭлемент.ТекущиеДанные, Стоимость);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьУслуги(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонсультационныеУслуги.СтоимостьОТ КАК СтоимостьОТ,
		|	КонсультационныеУслуги.СтоимостьДО КАК СтоимостьДО
		|ИЗ
		|	Справочник.КонсультационныеУслуги КАК КонсультационныеУслуги
		|ГДЕ
		|	КонсультационныеУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("СтоимостьОТ", Выборка.СтоимостьОТ);
	Результат.Вставить("СтоимостьДО", Выборка.СтоимостьДО);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ПодписантСоСтороныСКОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СотрудникОтКомпании = ПолучитьПодписантаОтКомпании(ВыбранноеЗначение);
	Если НЕ ЗначениеЗаполнено(СотрудникОтКомпании.Действующий) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный сотрудник отсутствует в подписантах от компании. Проверьте данные подписанта.",, "Объект.ПодписантСоСтороныСК",,Истина);
	ИначеЕсли СотрудникОтКомпании.Действующий Тогда	
		ЗаполнитьЗначенияСвойств(Объект, СотрудникОтКомпании);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выбран не действующий сотрудник. Проверьте данные подписанта от компании.",, "Объект.ПодписантСоСтороныСК",,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодписантаОтКомпании(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодписантыОрганизаций.Должность КАК Должность,
		|	ПодписантыОрганизаций.Документ КАК Документ,
		|	ПодписантыОрганизаций.Действующий КАК Действующий
		|ИЗ
		|	РегистрСведений.ПодписантыОрганизаций КАК ПодписантыОрганизаций
		|ГДЕ
		|	ПодписантыОрганизаций.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("ДолжностьПодписантаКомпании"	, Выборка.Должность);
	Результат.Вставить("ДокументПодписантаКомпании"		, Выборка.Документ);
	Результат.Вставить("Действующий"					, Выборка.Действующий);
	
	Возврат Результат;

КонецФункции


#КонецОбласти

