#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Для Каждого Строка Из ИсходныеДанные Цикл
		
		Если Не Строка.Свойство("СтраховойПродукт") Тогда
			
			Комментарий = "Для справочника не заполнен обязательный реквизит СтраховойПродукт";
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Страховые продукты", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			
			Возврат;
			
		КонецЕсли;
				
		СправочникЭлемент = Справочники.AMS_СтраховыеПродукты.НайтиПоРеквизиту("ГУИДЦССУ", Строка.СтраховойПродукт); 
				
		Если СправочникЭлемент.Пустая() Тогда 
			
			Если Строка.ЭтоГруппа Тогда
				
				СправочникОбъект = Справочники.AMS_СтраховыеПродукты.СоздатьГруппу();
				
			Иначе
				
				СправочникОбъект = Справочники.AMS_СтраховыеПродукты.СоздатьЭлемент();
				
			КонецЕсли;	
							
		Иначе
			
			СправочникОбъект = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка, "Наименование");
		
		Если Не Строка.ЭтоГруппа Тогда 
			
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка);
						
		КонецЕсли;
		
		ДозаполнитьОбъектФизЛица(СправочникОбъект, Строка, Строка.ЭтоГруппа);
		
		Попытка
			
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Записать();
			
			Комментарий = СтрШаблон("Успешно записан страховой продукт с УИД %1", Строка.СтраховойПродукт);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Страховые продукты", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_СтраховыеПродукты, СправочникОбъект.Ссылка, Комментарий);
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Страховые продукты", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_СтраховыеПродукты, СправочникОбъект.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт

	Результат = ПолучитьСтруктуруСообщения();
	
	ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);	 	 
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	//Данные = СтрЗаменить(Данные, """""", "null");
	 
	Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)
	
	Реквизиты = "ГУИД, Наименование, ВидСтраховогоПродукта, ОбязательноеСтрахование";
	ДанныеКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты);	
	
	Результат.guid					 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ГУИД);
	Результат.name 				 	 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Наименование);
	Результат.mandatory 			 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ОбязательноеСтрахование);
	
	Если ЗначениеЗаполнено(ДанныеКП.ВидСтраховогоПродукта) Тогда
		Результат.productTypeGuid 		 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ВидСтраховогоПродукта.ГУИД);
	КонецЕсли;
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "Product");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	Результат.Вставить("productTypeGuid");
	Результат.Вставить("mandatory");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДозаполнитьОбъектФизЛица(СправочникОбъект, Строка, ЭтоГруппа) 
	
	СправочникОбъект.Родитель = Справочники.AMS_СтраховыеПродукты.НайтиПоРеквизиту("ГУИДЦССУ", Строка.Родитель);
	СправочникОбъект.ГУИДЦССУ = Строка.СтраховойПродукт;
	СправочникОбъект.ГУИД = Строка.ГУИД;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СправочникОбъект.ВидСтрахованияПродукта = ЭлементСправочникаПоЦССУ("AMS_ВидыСтрахования", Строка.ВидСтрахования);
	СправочникОбъект.ВидСтраховогоПродукта = Справочники.AMS_ВидыСтраховыхПродуктов.НайтиПоНаименованию(Строка.ВидПродукта);
	СправочникОбъект.ПравилоСтрахования = ЭлементСправочникаПоЦССУ("AMS_ПравилаСтрахования", Строка.ПравилоСтрахования);
	СправочникОбъект.ТипыСтраховыхПродуктовПоНС = Перечисления.AMS_ТипыСтраховыхПродуктовПоНС[Строка.ТипСтраховогоПродуктаПОНС];
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитОбязательноеСтрахованиеВпервые() Экспорт

	СтраховыеПродуктыИдентификатор = МассивИдентификаторовКЗаполнению();
	ВыборкаПродуктов = ВыбратьСтраховыеПродукты(СтраховыеПродуктыИдентификатор);
	ЗаполнитьРеквизиты(ВыборкаПродуктов);
	
КонецПроцедуры

Функция МассивИдентификаторовКЗаполнению()

	Результат = Новый Массив;
	
	Результат.Добавить("7918bd43-5ef3-4087-98c2-53e62b827c38");
	Результат.Добавить("02d736d6-5b67-4654-9f15-74aa179627b9");
	Результат.Добавить("8a3a2e5e-6c93-479b-a5ab-4c34d8660beb");
	Результат.Добавить("adb2e48f-ee51-11df-b319-001517da95cc");
	Результат.Добавить("087d79e1-24d0-4713-b7b3-473f847d5f96");
	Результат.Добавить("3d27207b-82d3-4852-a2a1-7285ba888b61");
	Результат.Добавить("0ca590b1-b1f3-419e-b690-d776cd9b24ef");
	
	Возврат Результат;
	
КонецФункции

Функция ВыбратьСтраховыеПродукты(ГУИД)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_СтраховыеПродукты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AMS_СтраховыеПродукты КАК AMS_СтраховыеПродукты
		|ГДЕ
		|	AMS_СтраховыеПродукты.ГУИД В(&ГУИД)";
	
	Запрос.УстановитьПараметр("ГУИД", ГУИД);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ЗаполнитьРеквизиты(Выборка);
	
	Пока Выборка.Следующий() Цикл 
		
		ОбъектПродукты = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектПродукты.ОбязательноеСтрахование = Истина;
		ОбъектПродукты.ОбменДанными.Загрузка = Истина;
		ОбъектПродукты.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли