&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("Запись_УзелПланаОбмена");
КонецПроцедуры // ПриЗакрытии()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
КонецПроцедуры // ПриЗаписиНаСервере()

&НаСервере
Процедура ПроверитьПодключениеRabbitMQНаСервере()
		
	ОбменДаннымиAMS.ПроверитьПодключениеСервер(ПараметрыПодключения());
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеRabbitMQ(Команда)
	ПроверитьПодключениеRabbitMQНаСервере();
КонецПроцедуры

&НаСервере
Функция ПараметрыПодключения()

	Результат = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост");
	ЗаполнитьЗначенияСвойств(Результат, Объект);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИсключенияИзОбменаИсключенияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Отбор = Новый Структура("Исключения", ВыбранноеЗначение);
	СтрокиТабличнойЧасти = Объект.ИсключенияИзОбмена.НайтиСтроки(Отбор);
	
	Если НЕ СтрокиТабличнойЧасти.Количество() = 0 Тогда
		
		ОчиститьСообщения();
		ТекстСообщения = "" + ВыбранноеЗначение + " Уже добавлено в исключения";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.ИсключенияИзОбмена.Исключения",,Истина);
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	УдалитьПустыеСтроки();
КонецПроцедуры

Процедура УдалитьПустыеСтроки()

	СтрокаТЧ = Объект.ИсключенияИзОбмена.Количество();
	Пока СтрокаТЧ > 0 Цикл
		СтрокаТЧ = СтрокаТЧ - 1;
		Строка = Объект.ИсключенияИзОбмена[СтрокаТЧ];
		Если НЕ ЗначениеЗаполнено(Строка.Исключения) Тогда
			Объект.ИсключенияИзОбмена.Удалить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

