#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьЭлементовФормы();
	ВидимостьФилиаловПоПользователю();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

//
Процедура ВидимостьЭлементовФормы()

	Если Пользователи.РолиДоступны("ЧтениеГуидОбъекта", ПользователиКлиентСервер.ТекущийПользователь(), Ложь) Тогда
		Элементы.ГУИД.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьФилиаловПоПользователю()
	
	ГУИДФилиал = ПользователиКлиентСервер.ТекущийПользователь().AMS_Филиал.ГУИД;
	
	Если НЕ ГУИДФилиал = "" Тогда
		
		СписокДоговор = ОпределитьСписокДоговоровПоФилиалуПользователя();
		
		Если ЗначениеЗаполнено(СписокДоговор) Тогда
			
			ВидВСписке = ВидСравненияКомпоновкиДанных.ВСписке;
			Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ГУИД", СписокДоговор, ВидВСписке,
			Неопределено, Истина, Режим);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьСписокДоговоровПоФилиалуПользователя()
	
	ГУИДФилиал = ПользователиКлиентСервер.ТекущийПользователь().AMS_Филиал.ГУИД;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_Продавцы.ГУИД КАК ГУИД
		|ИЗ
		|	Справочник.AMS_Продавцы КАК AMS_Продавцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
		|		ПО AMS_Продавцы.Владелец = AMS_АгентскиеДоговоры.Владелец
		|ГДЕ
		|	AMS_АгентскиеДоговоры.Филиал.ГУИД = &ГУИД";
	
	Запрос.УстановитьПараметр("ГУИД", ГУИДФилиал);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГУИД");
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти


