#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфей

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	СправочникГУИД = ИдентификаторыПредопределенныхДанных();
	СправочникОписание = ОписаниеПредопределенных();
	
	Для каждого КлючЗначение Из СправочникГУИД Цикл
	
		ИКУОбъект = КлючЗначение.Ключ.ПолучитьОбъект();
		ИКУОбъект.Описание = СправочникОписание.Получить(КлючЗначение.Ключ);
		ИКУОбъект.ГУИД = КлючЗначение.Значение;
		ИКУОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ОписаниеПредопределенных()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.КонсультационныеУслуги.ВводВнесение,						 "Ввод/внесение договоров страхования в учетную базу данных Заказчика и учет договоров страхования за период.");
	Результат.Вставить(Справочники.КонсультационныеУслуги.ПодготовкаПроверка,				 "Подготовка/проверка  и корректировка реестров/бордеро договоров страхования в целях предотвращения сбоев при дальнейшем осуществлении конвертации реестров в ПО Заказчика.");
	Результат.Вставить(Справочники.КонсультационныеУслуги.Проверка,							 "Проверка комплектности документов. Под проверкой компелктов документов понимется проверка корректности заполнения данных о страхователе, собственнике транспортного средства, транспортном средстве, лицах допущенных к управлению транспортным средством и.т.п.");
	Результат.Вставить(Справочники.КонсультационныеУслуги.Контроль,							 "Контроль поступления страховых взносов с привязкой этих сумм к договорам страхования в учетной системе Заказчика");
	Результат.Вставить(Справочники.КонсультационныеУслуги.КонсультированиеПоПорядку,		 "Консультирование по порядку оформления документов при возникновении страхового случая");
	
	Возврат Результат;

КонецФункции

Функция ИдентификаторыПредопределенныхДанных()

	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.КонсультационныеУслуги.ВводВнесение,						 "b0d9e1ca-282b-4528-868e-3a43f6e0b65");
	Результат.Вставить(Справочники.КонсультационныеУслуги.ПодготовкаПроверка,				 "73515c74-9798-4745-8e55-5648a15e6c4a");
	Результат.Вставить(Справочники.КонсультационныеУслуги.Проверка,							 "d0f8a279-1028-455e-8f34-efbe7a953399");
	Результат.Вставить(Справочники.КонсультационныеУслуги.Контроль,							 "88032140-b9ca-4978-9233-632bbc93cedb");
	Результат.Вставить(Справочники.КонсультационныеУслуги.КонсультированиеПоПорядку,		 "b9a91436-58c8-4469-b19e-328af51a243e");
	
	Возврат Результат;
	
КонецФункции	
	
#КонецЕсли