#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт

	РезультатMp = ПолучитьСтруктуруСообщения();
	
	ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, РезультатMp);	 	 
	ДанныеMp = ОбменДаннымиAMS.СформироватьСтрокуJSON(РезультатMp, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	
	РезультатSd = Новый Массив;
	
	ЗаполнитьСтруктуруСообщенияМАМСSd(ОбъектСсылка, РезультатSd);
	
	Результат = Новый Массив;
	Результат.Добавить(ДанныеMp);
	
	Для каждого СтрокаSd Из РезультатSd  Цикл
	
		ДанныеSd = ОбменДаннымиAMS.СформироватьСтрокуJSON(СтрокаSd, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	    Результат.Добавить(ДанныеSd);
		
	КонецЦикла;
	
	Возврат ДанныеMp;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)
	
	Реквизиты = "ГУИД, Наименование, Отменена, ОфициальноеНаименование, ПроверкаНаличияДоговоровДВС";
	ДанныеКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты);	
	
	Результат.guid						 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ГУИД);
	Результат.name 				 		 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Наименование);
	Результат.officialName 				 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ОфициальноеНаименование);
	Результат.isActive 			 		 = ПреобразоватьЗначениеДляJSON(НЕ ДанныеКП.Отменена);
	Результат.voluntaryContractExists  	 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ПроверкаНаличияДоговоровДВС);
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "BonusProgram");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	Результат.Вставить("officialName");
	Результат.Вставить("isActive");
	Результат.Вставить("voluntaryContractExists");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСтруктуруСообщенияМАМСSd(ОбъектСсылка, Результат)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_МотивационныеПрограммыГрафик.НачалоПериода КАК fromDate,
		|	AMS_МотивационныеПрограммыГрафик.ОкончаниеПериода КАК toDate,
		|	AMS_МотивационныеПрограммыГрафик.ДатаРасчета КАК plannedDate,
		|	AMS_МотивационныеПрограммыГрафик.ИдентификаторСтроки КАК guid,
		|	""BonusSchedule"" КАК objectType,
		|	AMS_МотивационныеПрограммыГрафик.Ссылка.ГУИД КАК bonusGuid
		|ИЗ
		|	Справочник.AMS_МотивационныеПрограммы.График КАК AMS_МотивационныеПрограммыГрафик
		|ГДЕ
		|	AMS_МотивационныеПрограммыГрафик.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщение = ПолучитьСтруктуруСообщенияSd();
		ЗаполнитьЗначенияСвойств(Сообщение, ВыборкаДетальныеЗаписи,, "objectType");
		Сообщение.fromDate = Формат(ВыборкаДетальныеЗаписи.fromDate, "ДФ=yyyy-MM-dd");
		Сообщение.toDate = Формат(ВыборкаДетальныеЗаписи.toDate, "ДФ=yyyy-MM-dd");
		Сообщение.plannedDate = Формат(ВыборкаДетальныеЗаписи.plannedDate, "ДФ=yyyy-MM-dd");
		
		Результат.Добавить(Сообщение);
		
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьСтруктуруСообщенияSd()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "BonusSchedule");
	Результат.Вставить("guid");
	Результат.Вставить("bonusGuid");
	Результат.Вставить("fromDate");
	Результат.Вставить("toDate");
	Результат.Вставить("plannedDate");
	
	Возврат Результат;

КонецФункции	

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#КонецЕсли