#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ВидимостьЭлементовФормы();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

//Определяет видимость элементов формы (вызывается в "ПриСозданииНаСервере")
Процедура ВидимостьЭлементовФормы()

	Если Пользователи.РолиДоступны("ЧтениеГуидОбъекта", ПользователиКлиентСервер.ТекущийПользователь(), Ложь) Тогда
		Элементы.ГУИД.Видимость = Истина;
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("ИзменениеОтветственного", ПользователиКлиентСервер.ТекущийПользователь(), Ложь) Тогда
		Элементы.Ответственный.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКВ(Команда)
	
	ЗаполнитьТаблицуНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	Отбор = ДанныеКВСервер.ИнициализироватьСтруктуруОтбора();
	Отбор.Филиал = Объект.Ссылка;
	ТаблицаКВДанные = ДанныеКВСервер.ПолучитьТаблицуБазовогоКВ(Отбор);
	
	Если Элементы.Найти("ТаблицаКВ") <> Неопределено Тогда
		
		УдаляемыеРеквизиты = Новый Массив;
		УдаляемыеРеквизиты.Добавить("ТаблицаКВ");
		ИзменитьРеквизиты(, УдаляемыеРеквизиты);	
		Элементы.Удалить(Элементы["ТаблицаКВ"]);
		
	КонецЕсли;
	
	РеквизитыФормы = Новый Массив;
	РеквизитыФормы.Добавить(Новый РеквизитФормы("ТаблицаКВ", Новый ОписаниеТипов("ТаблицаЗначений")));
	Для каждого Колонка Из ТаблицаКВДанные.Колонки Цикл
	
		РеквизитыФормы.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаКВ"));
	
	КонецЦикла;
	ИзменитьРеквизиты(РеквизитыФормы);
				
	Таблица = Элементы.Добавить("ТаблицаКВ", Тип("ТаблицаФормы"), Элементы.РазмерыБазовогоКВ);
	Таблица.ПутьКДанным = "ТаблицаКВ";
	
	Для каждого Колонка Из ТаблицаКВДанные.Колонки Цикл
	
		Реквизит = Элементы.Добавить("Колонка" + Колонка.Имя, Тип("ПолеФормы"), Таблица);;
	    Реквизит.Вид = ВидПоляФормы.ПолеНадписи;
		Реквизит.ПутьКДанным = "ТаблицаКВ." + Колонка.Имя;
		Реквизит.Заголовок   = Колонка.Имя;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаКВДанные, "ТаблицаКВ");
	
КонецПроцедуры	

#КонецОбласти