#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедуры
// Первая версия модуля 28.08.2024
Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Если Не ИсходныеДанные.Свойство("GUID") Тогда
		
		Комментарий = "Для справочника не заполнен обязательный реквизит ГУИД";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Региональные группы", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		
		Возврат;
		
	КонецЕсли;	
		
	ИсходныеДанные			  = СериализацияИсходныхДанных(ИсходныеДанные);
		
	СсылкаНаОбъект 			  = Справочники.AMS_РегиональныеГруппы.ПолучитьСсылку(ИсходныеДанные.УИД);
	
	РегиональныеГруппыОбъект 	  = СсылкаНаОбъект.ПолучитьОбъект();
	
	Если РегиональныеГруппыОбъект = Неопределено Тогда 
		
		РегиональныеГруппыОбъект = Справочники.AMS_РегиональныеГруппы.СоздатьЭлемент();
		
		РегиональныеГруппыОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РегиональныеГруппыОбъект, ИсходныеДанные);
	
	Попытка
		
		РегиональныеГруппыОбъект.Записать();
		
		Комментарий = СтрШаблон("Успешно записана региональная группа с УИД %1", ИсходныеДанные.УИД);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Региональные группы", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_РегиональныеГруппы, РегиональныеГруппыОбъект.Ссылка, Комментарий);
			
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Региональные группы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_РегиональныеГруппы, РегиональныеГруппыОбъект.Ссылка, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Функция СериализацияИсходныхДанных(Данные)
	
	Попытка
		
		СодержимоеСтруктуры = "УИД, Комментарий, Наименование, ПометкаУдаления, ТипСправочника, КраткоеНаименование,
							| ИдентификаторВЮПро, ЗаблокированыВЮПро";
		
		Результат = Новый Структура(СодержимоеСтруктуры);
		
		Результат.УИД = Новый УникальныйИдентификатор(Данные.GUID);
		
		Результат.Комментарий			 = Данные.Комментарий;
		Результат.Наименование			 = Данные.Наименование;
		Результат.ПометкаУдаления		 = Булево(Данные.ПометкаУдаления);
		Результат.ТипСправочника		 = Данные.ТипСправочника;
		Результат.КраткоеНаименование	 = Данные.КраткоеНаименование;
		Результат.ИдентификаторВЮПро	 = Данные.ИдентификаторВЮПро;
		Результат.ЗаблокированыВЮПро	 = Булево(Данные.ЗаблокированыВЮПро);
		
	Исключение
		
		Результат = Неопределено;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Региональные группы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_РегиональныеГруппы,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти  

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт

	Результат = ПолучитьСтруктуруСообщения();
	
	ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);	 	 
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	// Данные = СтрЗаменить(Данные, """""", "null");
	 
	Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)
	
	Реквизиты = "ГУИДЦССУ, Наименование, КраткоеНаименование";
	ДанныеКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты);	
	
	Результат.guid					 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ГУИДЦССУ);
	Результат.name 				 	 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Наименование);
	Результат.shortName 			 = ПреобразоватьЗначениеДляJSON(ДанныеКП.КраткоеНаименование);
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "Region");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	Результат.Вставить("shortName");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#КонецЕсли