
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	////Если регистр создается копированием, тогда очищаем реквизит ГУИД
	//Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
	//	Запись.ГУИД = "";
	//КонецЕсли;
	 ЗаполнитьДоступныеУсловияСравнения();

КонецПроцедуры



&НаСервере
Процедура ЗаполнитьДоступныеУсловияСравнения()
	
	Элементы.УсловиеПоУмолчанию.СписокВыбора.Очистить();

	
	Если ЗначениеЗаполнено(Запись.Параметр) тогда
		
		//ДоступныеУсловияСравнения 
		УсловиеСравнения = ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПолучитьДоступныеУсловияСравнения(Запись.Параметр);
		
		Элементы.УсловиеПоУмолчанию.СписокВыбора.ЗагрузитьЗначения(УсловиеСравнения);		
		
		//Объект.ТипЗначения = Неопределено;   
		Элементы.УсловиеПоУмолчанию.ТолькоПросмотр = Ложь;   
		   	   

		Если  ЗначениеЗаполнено(Запись.УсловиеПоУмолчанию) и УсловиеСравнения.Найти(Запись.УсловиеПоУмолчанию) = Неопределено тогда  
			Запись.УсловиеПоУмолчанию =Неопределено;
			
		Конецесли;

	Иначе
		
		Элементы.УсловиеПоУмолчанию.ТолькоПросмотр = Истина;	
	Конецесли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПараметрПриИзменении(Элемент)
	ЗаполнитьДоступныеУсловияСравнения();
КонецПроцедуры

