#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Статус = Перечисления.AMS_СтатусыАД.Приостановлен;
	
	Если Параметры.Свойство("ТипОперации") Тогда
		ТипОперации = Параметры.ТипОперации;
	КонецЕсли;
	
	Если ТипОперации = "ВозобновлениеДействия" Тогда 
		Элементы.Статус.Видимость = Ложь;
		Элементы.ПричинаПриостановкиДоговора.Видимость = Ложь;
	КонецЕсли;	
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандыФормы

&НаКлиенте
Процедура Приостановить(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Статус", Статус);
	ПараметрыЗакрытия.Вставить("Дата", Дата);
	ПараметрыЗакрытия.Вставить("ПричинаПриостановки", ПричинаПриостановкиДоговора);
	ПараметрыЗакрытия.Вставить("ТипОперации", ТипОперации);
	
	Оповестить("AMS_ИзменениеДействияДоговора", ПараметрыЗакрытия);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Статус", ПредопределенноеЗначение("Перечисление.AMS_СтатусыАД.ПустаяСсылка"));
	ПараметрыЗакрытия.Вставить("Дата", Дата(1,1,1));
	ПараметрыЗакрытия.Вставить("ПричинаПриостановки", "");
	ПараметрыЗакрытия.Вставить("ТипОперации", ТипОперации);
	
	Оповестить("AMS_ИзменениеДействияДоговора", ПараметрыЗакрытия);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти
