
&НаСервере
Процедура ОбработатьСообщениеНаСервере()
	
	ИсходныеДанные = ПолучитьСтруктуруJSON(Запись.Сообщение);				                                   
	
	Если ТипЗнч(ИсходныеДанные) = Тип("Массив") Тогда
		ДанныеДляОбработки = ИсходныеДанные;
	Иначе	
		
		ДанныеДляОбработки = Новый Массив;
		ДанныеДляОбработки.Добавить(ИсходныеДанные);
	КонецЕсли;
	
	Попытка
		Справочники
			.AMS_РеестрыВознагражденийПоМотивационнымПрограммамДляПередачивЦССУ
			.СформироватьИзменитьЭлементСправочника(ДанныеДляОбработки);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Сообщить(ПодробноеПредставлениеОшибки(Ошибка));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруJSON(ТекстСообщения)
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
		
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);	
	
	Возврат ДанныеJSON;	
		
КонецФункции

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	ОбработатьСообщениеНаСервере();
КонецПроцедуры
