#Область ПрограммныйИнтерфейс

//Входная точка для нетиповых обменов в подсистеме "Обмен данными" БСП
Процедура ВыгрузкаЗагрузкаДанных(СтандартнаяОбработка,
								ПланОбмена,
								ИмяФайлаСообщения,
								ДанныеСообщения,
								КоличествоЭлементовВТранзакции,
								ИмяСобытияЖурналаРегистрации,
								КоличествоОтправленныхОбъектов,
								НаименованиеПланаОбмена,
								ВидПроцедуры,
								Отладка = Ложь,
								ОтладочноеСообщение = Неопределено) Экспорт
								
	СтандартнаяОбработка = Ложь;
	
	ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзлаSellerCandidate(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение);
	
КонецПроцедуры

#КонецОбласти

#Область ВариантыОбмена

Процедура ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзлаSellerCandidate(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,
														   КоличествоЭлементовВТранзакции = 0, КлючСообщенияЖурналаРегистрации = "",
														   КоличествоОбъектовОбработано = 0, ВидПроцедуры, Отладка, ОтладочноеСообщение)
							
	Если ВидПроцедуры = "Выгрузка" Тогда
		
	ИначеЕсли ВидПроцедуры = "Загрузка" Тогда
		
		ВыполнитьЗагрузкуИзмененийДляУзлаSellerCandidate(УзелИнформационнойБазы, ИмяФайла, КоличествоЭлементовВТранзакции, 
										КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение);
    Иначе
										
		Комментарий = "Иной вариант работы не предусмотрен";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка данных из SellerCandidate", УровеньЖурналаРегистрации.Ошибка, , , Комментарий);	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыполнитьЗагрузкуИзмененийДляУзлаSellerCandidate(УзелИнформационнойБазы, ИмяФайла, КоличествоЭлементовВТранзакции, 
										КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано,
										ВидПроцедуры, Отладка, ОтладочноеСообщение)
	
	ОбработаноСообщений  		= 0;
	ОбработаноСОшибкой 	 		= 0;
	
	
	Если Отладка Тогда
		
		ВходящиеСообщения = ОтладочноеСообщение;
		
	Иначе 
		
		ПараметрыПодключения = ОбменДаннымиAMS.ПараметрыПодключенияRabbitMQ(УзелИнформационнойБазы, ВидПроцедуры);
		ВходящиеСообщения	 = ПолучитьСообщенияИзRabbitMQ(ПараметрыПодключения); 
		
	КонецЕсли;
	
	Для Каждого Сообщение Из ВходящиеСообщения Цикл
		
		Если НЕ Сообщение.ВходящееСообщение = "" Тогда
			
			НачатьТранзакцию();
			Попытка 
				
				РегистрыСведений.AMS_ЖурналСообщений.ДобавитьЗапись(УзелИнформационнойБазы,
								Перечисления.AMS_ВидСообщенияИнтеграции.Входящее,
								Сообщение.ВходящееСообщение);
								
				ИсходныеДанные = ПолучитьСтруктуруJSON(Сообщение.ВходящееСообщение);
				СформироватьИзменитьЭлементСправочника(ИсходныеДанные);
				ОбработаноСообщений = ОбработаноСообщений + 1;
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				
				РегистрыСведений.AMS_ЖурналСообщений.ДобавитьЗапись(УзелИнформационнойБазы,
								Перечисления.AMS_ВидСообщенияИнтеграции.Входящее,
								Сообщение.ВходящееСообщение, Истина);
				
				ОбработаноСОшибкой = ОбработаноСОшибкой + 1;
				
				ОписаниеОшибки = ОписаниеОшибки();
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обмен данными с ЦССУ", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МенеджерыОбработкиДанных()
	
	 Результат = Новый Соответствие;
	 Результат.Вставить("АгентскиеДоговоры", Справочники.AMS_АгентскиеДоговоры);
	 Результат.Вставить("ДопСоглашения", Документы.AMS_ИзменениеУсловийАгентскогоДоговора);
	 Результат.Вставить("Контрагенты", Справочники.AMS_Агенты);
	 Результат.Вставить("ВидыСтрахования", Справочники.AMS_ВидыСтрахования);
	 Результат.Вставить("МотивационныеПрограммы", Справочники.AMS_МотивационныеПрограммы);
	 Результат.Вставить("Продавцы", Справочники.AMS_Продавцы);
	 Результат.Вставить("СтраховыеПродукты", Справочники.AMS_СтраховыеПродукты);
	 Результат.Вставить("СтраховыеРиски", Справочники.AMS_СтраховыеРиски);
	 Результат.Вставить("ФизическиеЛица", Справочники.AMS_ФизическиеЛица);
	 Результат.Вставить("ФункциональныеПринадлежности", Справочники.AMS_ФункциональныеПринадлежности);
	 Результат.Вставить("ПравилаСтрахования", Справочники.AMS_ПравилаСтрахования);
	 Результат.Вставить("КатегорииАгентовДляKPI", Справочники.AMS_ФизическиеЛица);
	 Результат.Вставить("ТерриторииПоОсаго", Справочники.AMS_ТерриторииСтрахования);
	 Результат.Вставить("ИзменениеКВ", Документы.AMS_ИзменениеКВОбщее);
	 Результат.Вставить("РазмерКВСтраховыхПродуктов", РегистрыСведений.AMS_ОграниченияВознагражденийПоПродукту);
	 
	 Возврат Результат;
	 
КонецФункции	

//Вызов процедуры создания соответствующего элемента справочника
Процедура СформироватьИзменитьЭлементСправочника(Данные)
	
	ОписаниеМенеджеров = МенеджерыОбработкиДанных();
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		
		ОбработатьСтруктуруПакета(Данные, ОписаниеМенеджеров);
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Массив") Тогда	
		
		Для Каждого Строка Из Данные Цикл
			
			ОбработатьСтруктуруПакета(Строка, ОписаниеМенеджеров);
			
		КонецЦикла
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСтруктуруПакета(Строка, ОписаниеМенеджеров)
	
	ОписаниеОбъектов = Строка.ОписаниеОбъектов;
	ТипПакета		 = Строка.ТипДанных;
	
	Менеджер = ОписаниеМенеджеров.Получить(ТипПакета);
	
	Если Менеджер = Неопределено Тогда
		
		Комментарий = СтрШаблон("Для такого типа данных %1 обработка не предусмотрена", ТипПакета);			
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка данных из ЦССУ", УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
		
		ВызватьИсключение Комментарий;
		
	КонецЕсли;
	
	Менеджер.СформироватьИзменитьЭлементСправочника(ОписаниеОбъектов)

КонецПроцедуры

//Чтобы типовой механизм понял, что выгрузка данных произошла,
//надо заполнить типовой файл выгрузки содержимым.
Процедура СоздатьФайлВыгрузкиЗаглушкуДляОбменаНаБСП(ИмяФайлаСообщения)

	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайлаСообщения);
	ТекстЗаглушка = "Этот файл создаётся типовым механизмом обмена БСП. Его следует игнорировать. Можно удалять.";
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Данные");
	ЗаписьХМЛ.ЗаписатьТекст(ТекстЗаглушка);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.Закрыть();
	
КонецПроцедуры

//Получение зарегистрированных изменений объектов
Функция ПолучитьЗарегистрированныеКОтправкеОбъекты(ИмяФайла, УзелИнформационнойБазы)

	МетаДанныеОбмена		= УзелИнформационнойБазы.МетаДанные();
	СоставПланаОбмена		= МетаДанныеОбмена.Состав;
	УчаствуютВОбмене		= Новый Массив();
	НаименованиеПланаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелИнформационнойБазы, "Наименование");
	
	Для Каждого Элемент Из СоставПланаОбмена Цикл
		УчаствуютВОбмене.Добавить(Элемент.Метаданные.ПолноеИмя());
	КонецЦикла;
	
	// Получаем выборку измененных данных.
	Запрос = Новый Запрос;
	Запрос.Текст = ОбменДаннымиAMS.ТекстЗапросаИзмененийПланаОбмена(УчаствуютВОбмене, НаименованиеПланаОбмена);
	Запрос.УстановитьПараметр("Узел", УзелИнформационнойБазы);
	
	ВыборкаИзменений = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаИзменений;
	
КонецФункции

//Текстовое представление реквизитов отправляемых данных
Функция СписокРеквизитовОбъекта(Данные)

	Результат = "";
	МетаданныеОбъекта = Данные.Метаданные();
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		ИмяРеквизита = Реквизит.Имя; 
		Результат 	 = Результат + ИмяРеквизита + ", ";
	КонецЦикла;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(Результат, 2);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыОбъекта(ВыборкаИзменений)

	Результат = Новый Структура();
	
	СсылкаНаОбъект = ВыборкаИзменений.Ссылка;
	НомерСообщения = ВыборкаИзменений.НомерСообщения;
	ТипОбъекта	   = ТипЗнч(СсылкаНаОбъект);
	Данные		   = Новый Структура ("НомерСообщения, Объект", НомерСообщения, СсылкаНаОбъект);
	
	Если НЕ СсылкаНаОбъект = Неопределено Тогда
		
		Результат.Вставить("СообщениеJSON", ОбъектВСтрокуJSON(Данные));
		Результат.Вставить("ТипОбъекта"	  , Строка(ТипОбъекта));
		Результат.Вставить("Представление", ВыборкаИзменений.Наименование);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Формируется текст сообщения обмена
Функция ОбъектВСтрокуJSON(Данные)

	Результат 		= "";
	Ссылка			= Данные.Объект;
	НомерСообщения  = Данные.НомерСообщения;
	Объект			= Ссылка.ПолучитьОбъект();
	СтруктураJSON 	= Новый Структура("НомерСообщения, ДанныеОбъекта", НомерСообщения, Объект);
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиОбъекта = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиОбъекта);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты  = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты  = ФорматДатыJSON.ISO;
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, СтруктураJSON, НазначениеТипаXML.Явное);
	
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

//Отправка сообщения в очередь RabbitMQ
Функция ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения)
	Результат = ОбменДаннымиAMS.ОтправитьСообщениеСервер(ПараметрыСообщения);	
	Возврат Результат;	
КонецФункции

//Отправка сообщения в очередь RabbitMQ
Функция ПолучитьСообщенияИзRabbitMQ(ПараметрыСообщения) 
	
	Результат = ОбменДаннымиAMS.ПолучитьСообщениеСервер(ПараметрыСообщения);
	
	Возврат Результат;
	
КонецФункции
                                                                                                        
//Формирует структуру из сообщения JSON
Функция ПолучитьСтруктуруJSON(ТекстСообщения)
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
	
	РеквизитыДат = Новый Массив;
	РеквизитыДат.Добавить("Дата");
	РеквизитыДат.Добавить("ДатаВыдачиДокумента");
	РеквизитыДат.Добавить("ДатаРождения");
	РеквизитыДат.Добавить("ДатаСоздания");
	РеквизитыДат.Добавить("НачалоДействия");
	РеквизитыДат.Добавить("КонецДействия");	
	РеквизитыДат.Добавить("ДатаНачалаДействия");
	РеквизитыДат.Добавить("ДатаОкончанияДействия");
	
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON,, РеквизитыДат, ФорматДатыJSON.ISO);	
	
	Возврат ДанныеJSON;	
		
КонецФункции

#КонецОбласти