Функция ПолучитьТаблицуБазовогоКВ(Отбор = Неопределено) Экспорт
	
	Если Отбор = Неопределено Тогда
		
		ИнициализироватьСтруктуруОтбора();
		
	КонецЕсли;	
	
	ТаблицаСКлючами = ПолучитьТаблицуСКлючамиБазовогоКВ(Отбор);
	РазвернутьКлюч(ТаблицаСКлючами);
	
	Возврат ТаблицаСКлючами;
	
КонецФункции

Функция ПолучитьТаблицуБазовогоКВИндивидуального(Отбор = Неопределено) Экспорт
	
	Если Отбор = Неопределено Тогда
		
		ИнициализироватьСтруктуруОтбора();
		
	КонецЕсли;	
	
	ТаблицаСКлючами = ПолучитьТаблицуСКлючамиБазовогоКВИндивидуального(Отбор);
	РазвернутьКлюч(ТаблицаСКлючами);
	
	Возврат ТаблицаСКлючами;
	
КонецФункции

Функция ИнициализироватьСтруктуруОтбора() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Филиал", Справочники.AMS_Филиалы.ПустаяСсылка());
	Результат.Вставить("Агент", Справочники.AMS_Агенты.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

Процедура РазвернутьКлюч(Таблица)
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
	
		Для каждого УсловиеКлюча Из СтрокаТаблицы.КлючУсловий.НаборУсловий Цикл
			
			ИмяКолонки = УсловиеКлюча.Параметр.ИмяПредопределенныхДанных;
			Если Таблица.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
				
				Таблица.Колонки.Добавить(ИмяКолонки);
				
			КонецЕсли;	
			
			СтрокаТаблицы[ИмяКолонки] = УсловиеКлюча.Значение;
			
		КонецЦикла;
	
	КонецЦикла;	
	Таблица.Колонки.Удалить("КлючУсловий");
	
КонецПроцедуры	

Функция ПолучитьТаблицуСКлючамиБазовогоКВ(Отбор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ОбщиеПравилаРасчетаКВСрезПоследних.КаналПродаж КАК КаналПродаж,
		|	AMS_ОбщиеПравилаРасчетаКВСрезПоследних.КатегорияПродавца КАК КатегорияПродавца,
		|	AMS_ОбщиеПравилаРасчетаКВСрезПоследних.СтраховойПродукт КАК СтраховойПродукт,
		|	AMS_ОбщиеПравилаРасчетаКВСрезПоследних.СтраховойРиск КАК СтраховойРиск,
		|	AMS_ОбщиеПравилаРасчетаКВСрезПоследних.КлючУсловий КАК КлючУсловий,
		|	AMS_ОбщиеПравилаРасчетаКВСрезПоследних.Процент КАК Процент
		|ИЗ
		|	РегистрСведений.AMS_ОбщиеПравилаРасчетаКВ.СрезПоследних(, Филиал = &Филиал) КАК AMS_ОбщиеПравилаРасчетаКВСрезПоследних";
	
	Запрос.УстановитьПараметр("Филиал", Отбор.Филиал);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
			
КонецФункции

Функция ПолучитьТаблицуСКлючамиБазовогоКВИндивидуального(Отбор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ИндивидуальныеПравилаРасчетаКВСрезПоследних.КлючУсловий КАК КлючУсловий,
		|	AMS_ИндивидуальныеПравилаРасчетаКВСрезПоследних.СтраховойРиск КАК СтраховойРиск,
		|	AMS_ИндивидуальныеПравилаРасчетаКВСрезПоследних.СтраховойПродукт КАК СтраховойПродукт,
		|	AMS_ИндивидуальныеПравилаРасчетаКВСрезПоследних.Процент КАК Процент
		|ИЗ
		|	РегистрСведений.AMS_ИндивидуальныеПравилаРасчетаКВ.СрезПоследних(, Агент = &Агент) КАК AMS_ИндивидуальныеПравилаРасчетаКВСрезПоследних";
	
	Запрос.УстановитьПараметр("Агент", Отбор.Агент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
			
КонецФункции


