#Область ПрограммныйИнтерфейс

Функция ТабличныйДокументРеестра(МассивГУИД) Экспорт

	Результат = Новый ТабличныйДокумент;

	Макет = Документы.AMS_РеестрПоПремиальнымПрограммам.ПолучитьМакет("ВыгрузкаРеестраВознаграждения");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Результат.Вывести(ОбластьШапка);
	ТекстЗапроса = ПолучитьТекстЗапросаРеестр();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивГУИД", МассивГУИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		Результат.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТабличныйДокументВознагражденияРеестра(МассивГУИД) Экспорт

	Результат = Новый ТабличныйДокумент;
	Макет = Документы.AMS_РеестрПоПремиальнымПрограммам.ПолучитьМакет("ВыгрузкаРеестра");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Результат.Вывести(ОбластьШапка);
	ТекстЗапроса = ПолучитьТекстЗапросаРеестрВознаграждения();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивГУИД", МассивГУИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		Результат.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция СсылкаНаДокументПоГУИД() Экспорт
	
	Результат = "ВЫБРАТЬ
	|	AMS_РеестрПоПремиальнымПрограммам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_РеестрПоПремиальнымПрограммам КАК AMS_РеестрПоПремиальнымПрограммам
	|ГДЕ
	|	AMS_РеестрПоПремиальнымПрограммам.ГУИД В(&ГУИД)";
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстЗапросаРеестр()
	
	Результат = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_РеестрПоПремиальнымПрограммам.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Реестры
	|ИЗ
	|	Документ.AMS_РеестрПоПремиальнымПрограммам КАК AMS_РеестрПоПремиальнымПрограммам
	|ГДЕ
	|	AMS_РеестрПоПремиальнымПрограммам.ГУИД В(&МассивГУИД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AMS_АгентскиеДоговоры.Ссылка КАК АгентскийДоговор,
	|	AMS_АгентскиеДоговоры.Филиал.Наименование КАК Филиал,
	|	AMS_АгентскиеДоговоры.Филиал.Владелец.Наименование КАК Дирекция,
	|	AMS_АгентскиеДоговоры.Владелец КАК Агент
	|ПОМЕСТИТЬ ВТ_ДанныеДоговоров
	|ИЗ
	|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_СостояниеАгентскогоДоговора.СрезПоследних КАК AMS_СостояниеАгентскогоДоговораСрезПоследних
	|		ПО (AMS_СостояниеАгентскогоДоговораСрезПоследних.АгентскийДоговор = AMS_АгентскиеДоговоры.Ссылка)
	|ГДЕ
	|	AMS_АгентскиеДоговоры.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_Реестры.Ссылка.Агент КАК СсылкаАгент
	|			ИЗ
	|				ВТ_Реестры КАК ВТ_Реестры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка.Агент.НаименованиеПолное КАК Агент,
	|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка.Агент.ГУИД КАК АгентГУИД,
	|	AMS_АгентскиеДоговоры.Филиал.Наименование КАК Филиал,
	|	AMS_АгентскиеДоговоры.Филиал.Владелец.Наименование КАК Дирекция,
	|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.МотивационнаяПрограмма.Наименование КАК Программа,
	|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка.НачалоПериода КАК НачалоПериода,
	|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка.ОкончаниеПериода КАК ОкончаниеПериода,
	|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.СуммаПремии КАК СуммаПремии,
	|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.СуммаВознаграждения КАК Вознаграждение
	|ИЗ
	|	Документ.AMS_РеестрПоПремиальнымПрограммам.МотивационныеПрограммы КАК AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ПО AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка.Агент = AMS_АгентскиеДоговоры.Владелец
	|			И (AMS_АгентскиеДоговоры.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыАД.Действует))
	|			И (AMS_АгентскиеДоговоры.Ссылка.Филиал <> ЗНАЧЕНИЕ(Справочник.AMS_Филиалы.ПустаяСсылка))
	|ГДЕ
	|	AMS_РеестрПоПремиальнымПрограммамМотивационныеПрограммы.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Реестры.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_Реестры КАК ВТ_Реестры)";
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстЗапросаРеестрВознаграждения()
	
	Результат = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_РеестрПоПремиальнымПрограммам.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Реестры
	|ИЗ
	|	Документ.AMS_РеестрПоПремиальнымПрограммам КАК AMS_РеестрПоПремиальнымПрограммам
	|ГДЕ
	|	AMS_РеестрПоПремиальнымПрограммам.ГУИД В(&МассивГУИД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AMS_АгентскиеДоговоры.Ссылка КАК АгентскийДоговор,
	|	AMS_АгентскиеДоговоры.Филиал.Наименование КАК Филиал,
	|	AMS_АгентскиеДоговоры.Филиал.Владелец.Наименование КАК Дирекция,
	|	AMS_АгентскиеДоговоры.Владелец КАК Агент
	|ПОМЕСТИТЬ ВТ_ДанныеДоговоров
	|ИЗ
	|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_СостояниеАгентскогоДоговора.СрезПоследних КАК AMS_СостояниеАгентскогоДоговораСрезПоследних
	|		ПО (AMS_СостояниеАгентскогоДоговораСрезПоследних.АгентскийДоговор = AMS_АгентскиеДоговоры.Ссылка)
	|ГДЕ
	|	AMS_АгентскиеДоговоры.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_Реестры.Ссылка.Агент КАК СсылкаАгент
	|			ИЗ
	|				ВТ_Реестры КАК ВТ_Реестры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.Ссылка.Агент.НаименованиеПолное КАК Агент,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.Ссылка.Агент.ГУИД КАК АгентГУИД,
	|	AMS_АгентскиеДоговоры.Филиал.Наименование КАК Филиал,
	|	AMS_АгентскиеДоговоры.Филиал.Владелец.Наименование КАК Дирекция,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.МотивационнаяПрограмма.Наименование КАК МотивационнаяПрограмма,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.Ссылка.НачалоПериода КАК НачалоПериода,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.Ссылка.ОкончаниеПериода КАК ОкончаниеПериода,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.ДоговорСтрахования.НомерДоговора КАК Договор,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.ДоговорСтрахования.Страхователь КАК Страхователь,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.ДоговорСтрахования.Продукт КАК Продукт,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.ДоговорСтрахования.ДатаЗаключения КАК ДатаЗаключения,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.ДоговорСтрахования.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.ДоговорСтрахования.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.ВознаграждениеПроцент КАК Процент,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.ВознагражденийСумма КАК Вознаграждение,
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.Премия КАК Премия
	|ИЗ
	|	Документ.AMS_РеестрПоПремиальнымПрограммам.Договоры КАК AMS_РеестрПоПремиальнымПрограммамДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ПО AMS_РеестрПоПремиальнымПрограммамДоговоры.Ссылка.Агент = AMS_АгентскиеДоговоры.Владелец
	|			И (AMS_АгентскиеДоговоры.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыАД.Действует))
	|			И (AMS_АгентскиеДоговоры.Ссылка.Филиал <> ЗНАЧЕНИЕ(Справочник.AMS_Филиалы.ПустаяСсылка))
	|ГДЕ
	|	AMS_РеестрПоПремиальнымПрограммамДоговоры.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Реестры.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_Реестры КАК ВТ_Реестры) И НЕ AMS_РеестрПоПремиальнымПрограммамДоговоры.Исключен";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти