
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ОповеститьОВыборе(ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьФилиаловПоПользователю();
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьФилиаловПоПользователю()
	
	ФилиалПользователя = ПользователиКлиентСервер.ТекущийПользователь().AMS_Филиал.ГУИД;
	
	Если ЗначениеЗаполнено(ФилиалПользователя) Тогда
		
		ВидРавно = ВидСравненияКомпоновкиДанных.Равно;
		Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ГУИД", ФилиалПользователя, ВидРавно, Неопределено, Истина, Режим);
		
	КонецЕсли;
	
КонецПроцедуры
