#Область ОписаниеПеременных

Перем ПараметрыПодключения Экспорт;
Перем Данные Экспорт;
Перем Подключение Экспорт;
Перем КомандаСУБД Экспорт;
Перем Лог Экспорт;
Перем НаборЗаписей Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция УстановитьстандартныеНастройки() Экспорт

	ПараметрыПодключения.Сервер 	= Константы.ВитринаСерверСУБД.Получить();
	ПараметрыПодключения.БазаДанных = Константы.ВитринаБазаДанных.Получить();
	ПараметрыПодключения.Пользователь = Константы.ВитринаПользователь.Получить();
	ПараметрыПодключения.Пароль 	= Константы.ВитринаПароль.Получить();
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Подключиться() Экспорт
	
	Попытка
		
		Подключение = Новый COMОбъект("ADODB.Connection");
		
		Если НЕ ЗначениеЗаполнено(ПараметрыПодключения.Пользователь) Тогда
			СтрокаПодключения = "Driver={SQL Server};Server=" + СокрЛП(ПараметрыПодключения.Сервер) 
			+ ";DataBase=" 
			+ СокрЛП(ПараметрыПодключения.БазаДанных) 
			+ ";Trusted_Connection=True;";
			
			Подключение.Open(СтрокаПодключения);					
			
		Иначе					
			Подключение.Provider = "SQLOLEDB";
			Подключение.Properties("Data Source").Value     = СокрЛП(ПараметрыПодключения.Сервер); 
			Подключение.Properties("Initial Catalog").Value = СокрЛП(ПараметрыПодключения.БазаДанных );
			Подключение.Properties("User ID").Value         = СокрЛП(ПараметрыПодключения.Пользователь);
			Подключение.Properties("Password").Value        = СокрЛП(ПараметрыПодключения.Пароль);					
			
			Подключение.ConnectionTimeOut = 10000;
			Подключение.CommandTimeout    = 10000;
			Подключение.Open();
		КонецЕсли;
		
		КомандаСУБД = Новый COMОбъект("ADODB.Command");
		
	Исключение
		
		Подключение = Неопределено;
		КомандаСУБД = Неопределено;
		
	КонецПопытки;
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Продавец(ИдентификаторПродавца) Экспорт

	Запрос = ЗапросДанныхПродавца(ИдентификаторПродавца);
	Если Подключение = Неопределено Тогда
	     Возврат ЭтотОбъект;
	КонецЕсли;
	 
	ВыполнитьЗапросКСУБД(Запрос);
	
	ОбработатьНаборЗаписей();
	
	Возврат ЭтотОбъект; 

КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДанныеПодключения()

	Результат = Новый Структура;
	Результат.Вставить("Сервер");
	Результат.Вставить("БазаДанных");
	Результат.Вставить("Пользователь");
	Результат.Вставить("Пароль");
	
	ПараметрыПодключения = Результат;
	
КонецПроцедуры

Процедура ИнициализироватьЛог()
	
	Лог = Новый ТаблицаЗначений;
	Лог.Колонки.Добавить("Тип");
	Лог.Колонки.Добавить("Описание");

КонецПроцедуры
	
Функция ПолучитьИдентификаторСУБД(Идентификатор)
	
	Идентификатор = НРег(Идентификатор);
    Идентификатор = СтрЗаменить(Идентификатор, "-", "");
    ИдентификаторСУБД  = "0x" + ВРег(Сред(Идентификатор, 17, 4) 
			+ Прав(Идентификатор, 12) + Сред(Идентификатор, 13, 4) 
			+ Сред(Идентификатор, 9, 4) + Лев(Идентификатор, 8));
        
    Возврат ИдентификаторСУБД; 
    
КонецФункции

Процедура ВыполнитьЗапросКСУБД(Запрос)
	
	НаборЗаписей = Неопределено;
	
	Попытка
		
		КомандаСУБД.CommandType       = 1;
		КомандаСУБД.CommandTimeout    = 10000;
		КомандаСУБД.ActiveConnection  = Подключение;
		
		КомандаСУБД.CommandText = Запрос;	
		НаборЗаписей = КомандаСУБД.Execute();
		
		ДобавитьЗаписьЛога("Информация", "Выполнен запрос: " + Запрос);
		
	Исключение
		
		ДобавитьЗаписьЛога("Ошибка", ОписаниеОшибки());
		ДобавитьЗаписьЛога("Ошибка", "Ошибка при выполнении запроса: " + Запрос);
		
	КонецПопытки;
	
КонецПроцедуры

#Область ЗапросыКБазеДанных

Функция ЗапросДанныхПродавца(Параметр)
	
	ШаблонЗапроса = 
	"SELECT [стПродавцы Владелец]  AS Владелец
    |  ,[стПродавцы Код]  AS Код
    |  ,[стПродавцы Наименование]  AS Наименование
    |  ,[стПродавцы ст ГУИД] AS ГУИД
    |  ,[стПродавцы Примечание]  AS Комментарий
    |  ,[стПродавцы ID]  AS Продавец
  	| FROM [CSSU_TEMP_views1].[dbo].[Справочники.стПродавцы]
  	| Where [стПродавцы ст ГУИД] = '%1'";
	
	Возврат СтрШаблон(ШаблонЗапроса, Параметр);
	
КонецФункции	

#КонецОбласти

Процедура ДобавитьЗаписьЛога(Тип, Описание)
	
	ЗаписьЛога = Лог.Добавить();
	ЗаписьЛога.Тип = Тип;
	ЗаписьЛога.Описание = Описание;
	
	УровеньЖурнала = УровеньЖурналаРегистрации.Информация;
	
	Если Тип = "Ошибка" Тогда
		
		УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("ПрямыеЗапросыкСУБД.Лог", УровеньЖурнала,,, Описание); 
	
КонецПроцедуры	

Процедура ОбработатьНаборЗаписей()
	
	Данные = Неопределено;
	
	Если НаборЗаписей = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;

	Если НЕ НаборЗаписей.BOF Тогда
		
		НаборЗаписей.MoveFirst();
		ИнициализироватьСтруктуруДанных();
		
		Пока НЕ НаборЗаписей.EOF Цикл
			
			СтрокаДанных = Данные.Добавить();
			
			Для каждого Колонка Из Данные.Колонки Цикл
			
				СтрокаДанных[Колонка.Имя] = ПреобразоватьИдентификатор(НаборЗаписей.fields(Колонка.Имя).value);
			                                                               
			КонецЦикла;
			
			НаборЗаписей.MoveNext();
			
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры

Процедура ИнициализироватьСтруктуруДанных()

	Данные = Новый ТаблицаЗначений;
	
	Для каждого Колонка Из НаборЗаписей.fields Цикл
	
		Данные.Колонки.Добавить(Колонка.Name);	
	
	КонецЦикла;
		
КонецПроцедуры

Функция ПреобразоватьИдентификатор(Значение)

	Результат = Строка(Значение);
	
	Если ТипЗнч(Значение) = Тип("COMSafeArray") Тогда 
		
		Строка64 = "";
		Для каждого СимволЗначения Из Значение Цикл
		
			Строка64 = Строка64 + ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(СимволЗначения);
		
		КонецЦикла;
		
		Набор1 = Сред(Строка64, 1, 4);
		Набор2 = Сред(Строка64, 5, 12);
		Набор3 = Сред(Строка64, 17, 4);
		Набор4 = Сред(Строка64, 21, 4);
		Набор5 = Сред(Строка64, 25, 8);
	
		ПромежуточныйНабор = Набор5 + Набор4 + Набор3 + Набор1 + Набор2;
		Строка64 = Лев(ПромежуточныйНабор, 8) + "-"
			 	+ Сред(ПромежуточныйНабор, 9, 4) + "-"
				+ Сред(ПромежуточныйНабор, 13, 4) + "-"
			 	+ Сред(ПромежуточныйНабор, 17, 4) + "-"
			 	+ Сред(ПромежуточныйНабор, 21);
		
		Возврат Строка64;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Знач ДесятичноеЧисло)
    
    Результат = "";
    
    Пока ДесятичноеЧисло > 0 цикл
        ОстатокОтДеления = ДесятичноеЧисло % 16;
        ДесятичноеЧисло  = (ДесятичноеЧисло - ОстатокОтДеления) / 16;
        Результат        = Сред("0123456789abcdef", ОстатокОтДеления + 1, 1) + Результат;
    КонецЦикла;
    
    Возврат  Прав("0" + Результат, 2);
    
КонецФункции

#КонецОбласти

#Область Инициализация

ИнициализироватьДанныеПодключения();
ИнициализироватьЛог();

#КонецОбласти