#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ЗаполнитьПродавцовНаСервере(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Истина, Истина);
	
	ОткрытьФорму("Справочник.AMS_Продавцы.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПродавцовНаСервере(Продавец)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ИнформацияОПродавцеСрезПоследних.Агент КАК Агент,
		|	AMS_ИнформацияОПродавцеСрезПоследних.ВидыСтраховыхПродуктов КАК ВидыСтраховыхПродуктов,
		|	AMS_ИнформацияОПродавцеСрезПоследних.СтраховыеПродукты КАК СтраховыеПродукты,
		|	AMS_ИнформацияОПродавцеСрезПоследних.ПодканалПродаж КАК ПодканалПродаж
		|ИЗ
		|	РегистрСведений.AMS_ИнформацияОПродавце.СрезПоследних КАК AMS_ИнформацияОПродавцеСрезПоследних
		|ГДЕ
		|	AMS_ИнформацияОПродавцеСрезПоследних.Продавец = &Продавец";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ПодчиненныеАгенты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Продавец = Продавец;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
