#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьЗаполнениеРеквизита() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Период КАК Период,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Регистратор КАК Регистратор,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.НомерСтроки КАК НомерСтроки,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Активность КАК Активность,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Организация КАК Организация,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Филиал КАК Филиал,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Агент КАК Агент,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.АгентскийДоговор КАК АгентскийДоговор,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Банк КАК Банк,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.ГодСтрахования КАК ГодСтрахования,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.КатегорияДоговора КАК КатегорияДоговора,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.КБМОт КАК КБМОт,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.КБМДо КАК КБМДо,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.ПремияОт КАК ПремияОт,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.ПремияДо КАК ПремияДо,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.СтраховойПродукт КАК СтраховойПродукт,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.СтраховойРиск КАК СтраховойРиск,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.ЭтоЭлектронноеОсаго КАК ЭтоЭлектронноеОсаго,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Процент КАК Процент,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.Отменен КАК Отменен,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	AMS_ИндивидуальныеПравилаРасчетаКВ.ГУИД КАК ГУИД
		|ИЗ
		|	РегистрСведений.AMS_ИндивидуальныеПравилаРасчетаКВ КАК AMS_ИндивидуальныеПравилаРасчетаКВ
		|ИТОГИ ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРегистратор.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаРегистратор.Выбрать();
		
		Набор = РегистрыСведений.AMS_ИндивидуальныеПравилаРасчетаКВ.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаписьНабора = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ВыборкаДетальныеЗаписи);
			ЗаписьНабора.ГУИД = Строка(Новый УникальныйИдентификатор);
			
		КонецЦикла;
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать(Истина);
		
	КонецЦикла;
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли