
#Область ПрограммныйИнтерфейс

Процедура AMS_РегистрацияДанныхКОбменуПриЗаписи(Источник, Отказ, Замещение) Экспорт

	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.AMS_ИнформацияОПродавце") Тогда
		
		ЗарегистрироватьПродавцовКОбмену(Источник, Отказ);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура AMS_РегистрацияДанныхКОбменуДокументыОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ИсключенМАМС = ПолучитьИсключенияМАМС(Источник.Ссылка);
	ИсключенСОРВ = ПолучитьИсключенияСОРВ(Источник.Ссылка);
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.AMS_ИзменениеУсловийМотивационнойПрограммы") Тогда
		
		Если НЕ ИсключенМАМС Тогда
			ЗарегистрироватьМотивационныеПрограммыМАМС(Источник, Отказ);
		КонецЕсли;
		
		Если НЕ ИсключенСОРВ Тогда
			ЗарегистрироватьИзменениеУсловийМотивационнойПрограммыСОРВ(Источник, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура AMS_РегистрацияДанныхКОбменуСправочникиПриЗаписи(Источник, Отказ) Экспорт
	
	Исключен = ПолучитьИсключенияМАМС(Источник.Ссылка);
	
	Если Исключен Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.AMS_МотивационныеПрограммы") Тогда
		
		ЗарегистрироватьМотивационныеПрограммыМАМС(Источник, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьПродавцовКОбмену(ИсточникИнформацияОПродавце, Отказ)
	
	Узлы = ОбменДаннымиСобытия.ВсеУзлыПланаОбмена("СОРВ");
	
	Для каждого Запись Из ИсточникИнформацияОПродавце Цикл
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узлы, Запись.Продавец);
						
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеУсловийМотивационнойПрограммыСОРВ(Источник, Отказ)
	
	УзелСОРВ = ОбменДаннымиСобытия.ВсеУзлыПланаОбмена("СОРВ");
	
	ПланыОбмена.ЗарегистрироватьИзменения(УзелСОРВ, Источник);
	
КонецПроцедуры

Процедура ЗарегистрироватьМотивационныеПрограммыМАМС(Источник, Отказ)
	
	УзелМАМС = ОбменДаннымиСобытия.ВсеУзлыПланаОбмена("МастерАМС");
	
	ПланыОбмена.ЗарегистрироватьИзменения(УзелМАМС, Источник);
	
КонецПроцедуры

Функция ПолучитьИсключенияСОРВ(Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СОРВИсключенияИзОбмена.Исключения КАК Исключения
		|ИЗ
		|	ПланОбмена.СОРВ.ИсключенияИзОбмена КАК СОРВИсключенияИзОбмена
		|ГДЕ
		|	СОРВИсключенияИзОбмена.Исключения = &Исключения";
	
	Запрос.УстановитьПараметр("Исключения", Источник);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПолучитьИсключенияМАМС(Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МастерАМСИсключенияИзОбмена.Исключения КАК Исключения
		|ИЗ
		|	ПланОбмена.МастерАМС.ИсключенияИзОбмена КАК МастерАМСИсключенияИзОбмена
		|ГДЕ
		|	МастерАМСИсключенияИзОбмена.Исключения = &Исключения";
	
	Запрос.УстановитьПараметр("Исключения", Источник);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
