#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Организация = Константы.AMS_ОрганизацияПоУмолчанию.Получить();
	ВидОперацииСПродавцами = Перечисления.AMS_ВидИзмененияОперацииОПродавце.ДобавлениеПродавцов;
	
	Для Каждого Строка Из ИсходныеДанные Цикл
		
		Если Не Строка.Свойство("АгентскийДоговор") Тогда
			
			Комментарий = СтрШаблон("Не задано основное поле: АгентскийДоговор");
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника АгентскийДоговор", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_АгентскиеДоговоры, , Комментарий);
			
			Продолжить;
			
		КонецЕсли;
		
		ОшибкаПриСоздании = Ложь;
		
		СправочникСсылка = Справочники.AMS_АгентскиеДоговоры.НайтиПоРеквизиту("ГУИДЦССУ", Строка.АгентскийДоговор);
		
		Если СправочникСсылка.Пустая() Тогда
			СправочникОбъект = Справочники.AMS_АгентскиеДоговоры.СоздатьЭлемент();
		Иначе
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		КонецЕсли;	                                                                             
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка);
		
		Если СправочникОбъект.ДатаОкончанияДействия = Дата(1,1,1) Тогда
			СправочникОбъект.ДатаОкончанияДействия = Дата(2099, 12, 31);
		КонецЕсли; 
		
		Если СправочникОбъект.ДатаОкончанияДействия = СправочникОбъект.ДатаНачалаДействия Тогда
			СправочникОбъект.ДатаОкончанияДействия = КонецДня(СправочникОбъект.ДатаНачалаДействия) + 1;	
		КонецЕсли;
		
		ДанныеДокументаПродавцы = Новый Структура("ВидОперации, Агент, АгентскийДоговор, Организация, Подразделение, ДатаВступленияВСилу, Филиал");
		
		СправочникОбъект.Организация = Организация;
		
		ДанныеДокументаПродавцы.Организация = Организация;
		ДанныеДокументаПродавцы.ВидОперации = ВидОперацииСПродавцами;
		
		Попытка
			ДозаполнитьРеквизиты(СправочникОбъект, Строка, ДанныеДокументаПродавцы);
		Исключение
			
			ТекстОшибки = СтрШаблон("Для Агентского договора с УИД %1 ошибка при создании: %2", Строка.АгентскийДоговор, ОписаниеОшибки());
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника АгентскиеДоговоры", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_АгентскиеДоговоры, СправочникОбъект.Ссылка, ТекстОшибки);
			
		КонецПопытки;
		
		Попытка 
			
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Записать();
			
			Комментарий = СтрШаблон("Успешно записан агентский договор с ГУИД %1", Строка.АгентскийДоговор);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника АгентскиеДоговоры", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_АгентскиеДоговоры, СправочникОбъект.Ссылка, Комментарий);
			
		Исключение 
			
			
			ОшибкаПриСоздании = Истина;
			
			ТекстОшибки = СтрШаблон("Для Агентского договора с УИД %1 ошибка при создании: %2", Строка.АгентскийДоговор, ОписаниеОшибки());
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника АгентскиеДоговоры", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_АгентскиеДоговоры, СправочникОбъект.Ссылка, ТекстОшибки);
			
		КонецПопытки;
		
		Если ОшибкаПриСоздании Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеДокументаПродавцы.АгентскийДоговор = СправочникОбъект.Ссылка;
		
		Если Строка.Продавцы.Количество() > 0 Тогда
			Документы.AMS_ИзмененияДанныхПродавцов.СоздатьДокументИзменениеДанныхПродавцов(ДанныеДокументаПродавцы, Строка.Продавцы);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры  

Функция ДозаполнитьРеквизиты(СправочникОбъект, Строка, ДанныеДокументПродавцы)
	
	СправочникОбъект.Наименование = СтрШаблон("Договор № %1", Строка.РегистрационныйНомер);
	СправочникОбъект.ДатаПодписанияАгентом = Строка.ДатаНачалаДействия;
	СправочникОбъект.Владелец = ЭлементСправочникаПоЦССУ("AMS_Агенты", Строка.Владелец);
	СправочникОбъект.Филиал   = ЭлементСправочникаПоЦССУ("AMS_Филиалы", Строка.Филиал);
	СправочникОбъект.Подразделение = ЭлементСправочникаПоЦССУ("AMS_Подразделения", Строка.Подразделение);
	СправочникОбъект.Статус = Перечисления.AMS_СтатусыАД[Строка.Статус];
	СправочникОбъект.ПериодичностьВыплатыКВ = ПолучитьПериодичностьВыплат(Строка.ПериодичностьВыплатыКВ);
	СправочникОбъект.КатегорияАгента = Перечисления.AMS_КатегорииПродавца[Строка.КатегорияАгента];		
	СправочникОбъект.КатегорияАгентаДляKPI = ЭлементСправочникаПоЦССУ("AMS_КатегорияАгентовДляПоказателейКачества", Строка.КатегорияАгентаДляKPI);   
	СправочникОбъект.ТипАгента = Перечисления.AMS_ТипыАгентовПоСпособуПродаж[Строка.ТипАгента];
	СправочникОбъект.ГУИДЦССУ = Строка.АгентскийДоговор;
	СправочникОбъект.НеТиповойДоговор = Не Строка.ТиповойДоговор;
	СправочникОбъект.УдерживаетПВ = Не Строка.НеУдерживаетПВ;
	
	Если НЕ Строка.КаналПродаж = "" Тогда
		СправочникОбъект.КаналПродаж = Справочники.AMS_КаналыПродаж[Строка.КаналПродаж];
	КонецЕсли;
	
	ДанныеДокументПродавцы.ДатаВступленияВСилу = СправочникОбъект.ДатаНачалаДействия;
	ДанныеДокументПродавцы.Агент = СправочникОбъект.Владелец;
	ДанныеДокументПродавцы.Подразделение = СправочникОбъект.ДатаПодписанияАгентом;
	ДанныеДокументПродавцы.Филиал = СправочникОбъект.Филиал;
	
	Для Каждого СтрокаУсловиеДоговора Из Строка.УсловияДоговора Цикл
		
		НоваяСтрока = СправочникОбъект.УсловияДоговора.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУсловиеДоговора);
		
		НоваяСтрока.СтраховойПродукт = ЭлементСправочникаПоЦССУ("AMS_СтраховыеПродукты", СтрокаУсловиеДоговора.СтраховойПродукт);;
		НоваяСтрока.Риск = ЭлементСправочникаПоЦССУ("AMS_СтраховыеРиски", СтрокаУсловиеДоговора.Риск);
		
	КонецЦикла;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПериодичностьВыплат(Периодичность)
	
	Данные = Новый Соответствие;
	Данные.Вставить("ОдинРазВНеделю", Перечисления.AMS_РасписаниеВыплатыКВ.Еженедельно);
	Данные.Вставить("ОдинРазВМесяц", Перечисления.AMS_РасписаниеВыплатыКВ.Ежемесячно);
	Данные.Вставить("ОдинРазВДвеНедели", Перечисления.AMS_РасписаниеВыплатыКВ.РазВДвеНедели);
	
	Возврат Данные.Получить(Периодичность);
	
КонецФункции	

#КонецОбласти

#КонецЕсли
