
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 

Процедура ПриКопировании(ОбъектКопирования)
	
	ГУИД = ""; 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДатаСоздания = ТекущаяДатаСеанса();
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		Организация = Константы.AMS_ОрганизацияПоУмолчанию.Получить();
		Ответственный = Пользователи.ТекущийПользователь();
		Статус = Перечисления.AMS_СтатусыАД.Проект;
		
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.AMS_СостояниеАгентскогоДоговора.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.АгентскийДоговор.Установить(Ссылка); 
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Период = ДатаНачалаДействия;
		НоваяЗапись.АгентскийДоговор = Ссылка;
		НоваяЗапись.Действует = Истина;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Период = ?(ЗначениеЗаполнено(ДатаПрекращенияДействия), ДатаПрекращенияДействия, ДатаОкончанияДействия);
		НоваяЗапись.АгентскийДоговор = Ссылка;
		НоваяЗапись.Действует = Ложь;
		
	Иначе
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Если Запись.Действует Тогда
				
				Запись.Период = ДатаНачалаДействия
				
			Иначе
				
				Запись.Период = ?(ЗначениеЗаполнено(ДатаПрекращенияДействия), ДатаПрекращенияДействия, ДатаОкончанияДействия);
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;

	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГУИД) Тогда
		ГУИД = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли