#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура СогласованиеКураторомКаналаПродажПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)

	Согласующий = Справочники.РолиСогласующихЛиц.КураторКаналаПродаж;
	ОбработкаСоздаваемыхЗадач(Согласующий, ФормируемыеЗадачи);
	
КонецПроцедуры

Процедура СогласованиеАндеррайтеромПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Согласующий = Справочники.РолиСогласующихЛиц.Андеррайтер;
	ОбработкаСоздаваемыхЗадач(Согласующий, ФормируемыеЗадачи);

КонецПроцедуры

Процедура СогласованиеДиректоромФилиалаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Согласующий = Справочники.РолиСогласующихЛиц.ДиректорФилиала;
	ОбработкаСоздаваемыхЗадач(Согласующий, ФормируемыеЗадачи);

КонецПроцедуры

Процедура СогласованиеРуководителемРегиональнойДирекцииПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Согласующий = Справочники.РолиСогласующихЛиц.РуководительРегиональнойДирекции;
	ОбработкаСоздаваемыхЗадач(Согласующий, ФормируемыеЗадачи);

КонецПроцедуры

Процедура СогласованоКураторомПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)

	Результат = СогласованоКуратором;
	
КонецПроцедуры

Процедура СогласованоАндерайтетормПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = СогласованоАндерайтером;
	
КонецПроцедуры

Процедура СогласованоДиректоромФилиалаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = СогласованоДиректором;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаСоздаваемыхЗадач(Согласующий, ФормируемыеЗадачи)

	ВедущийПроцесс = ВедущаяЗадача.БизнесПроцесс;
	
	Для каждого ЗадачаПользователя Из ФормируемыеЗадачи Цикл
	
		ЗаполнитьЗначенияСвойств(ЗадачаПользователя, ВедущийПроцесс);
	    ЗадачаПользователя.Номер 		   = Неопределено;
		ЗадачаПользователя.Исполнитель	   = Неопределено;
		ЗадачаПользователя.РольИсполнителя = Согласующий;
		ЗадачаПользователя.Процесс		   = Справочники.Процессы.УтверждениеЗаявкиНаИзменениеАД;
		ЗадачаПользователя.УстановитьСсылкуНового(Задачи.ЗадачаИсполнителя.ПолучитьСсылку(Новый УникальныйИдентификатор));
		
		ПроцессыСогласованияЗаявкиСервер.СоздатьЗадачиСогласующим(Основание, Согласующий, ЗадачаПользователя.ПолучитьСсылкуНового());
		
	КонецЦикла;

КонецПроцедуры	

Процедура СогласованиеКураторомКаналаПродажПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ОтправленоНаДоработку = Задача.ОтправленоНаДоработку;
	СогласованоКуратором = Задача.Согласована;
КонецПроцедуры

Процедура СогласованиеАндеррайтеромПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ОтправленоНаДоработку = Задача.ОтправленоНаДоработку;
	СогласованоАндерайтером = Задача.Согласована;
КонецПроцедуры

Процедура СогласованиеДиректоромФилиалаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ОтправленоНаДоработку = Задача.ОтправленоНаДоработку;
	СогласованоДиректором = Задача.Согласована;
КонецПроцедуры

Процедура СогласованиеРуководителемРегиональнойДирекцииПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ОтправленоНаДоработку = Задача.ОтправленоНаДоработку;
	СогласованоРуководителемДирекции = Задача.Согласована;
КонецПроцедуры
	
#КонецОбласти

#Область Инициализация

#КонецОбласти