#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Период", КонецДня(ТекущаяДатаСеанса()));
	
КонецПроцедуры
	
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Изменить(Команда)
	
	СтрокиДляИзменения = Элементы.Список.ВыделенныеСтроки;
	
	Для каждого ВыделеннаяСтрока Из СтрокиДляИзменения Цикл
	
		СтрокаСостояния = "Обрабатывается продавец " + ВыделеннаяСтрока;
		Состояние(СтрокаСостояния);
		ИзменитьДанныеПродавцаНаСервере(ВыделеннаяСтрока, ИзменяемыйРеквизит, НовоеЗначение);
	
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура ОтборКураторПриИзменении(Элемент)
	
	ИзменитьОтборСписка("Куратор", ОтборКуратор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборАгентПриИзменении(Элемент)
	
	ИзменитьОтборСписка("Агент", ОтборАгент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборФилиалПриИзменении(Элемент)
	
	ИзменитьОтборСписка("Филиал", ОтборФилиал);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКураторОчистка(Элемент, СтандартнаяОбработка)
	
	УдалитьОтборСписка("Куратор");	

КонецПроцедуры

&НаКлиенте
Процедура ОтборАгентОчистка(Элемент, СтандартнаяОбработка)
	
	УдалитьОтборСписка("Агент");

КонецПроцедуры

&НаКлиенте
Процедура ОтборФилиалОчистка(Элемент, СтандартнаяОбработка)
	
	УдалитьОтборСписка("Филиал");	

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтборСписка(Поле, Значение)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	УдалитьОтборСписка(Поле);
	
	ОбщегоНазначенияКлиентСервер
		.УстановитьЭлементОтбораДинамическогоСписка(Список, Поле, Значение, 
						ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтборСписка(Поле)

	ОбщегоНазначенияКлиентСервер
		.УдалитьЭлементыГруппыОтбора(Список.Отбор, Поле);
		
КонецПроцедуры	

&НаКлиенте
Процедура ИзменяемыйРеквизитПриИзменении(Элемент)
	
	Если ИзменяемыйРеквизит = "Куратор" Тогда
		
		Элементы.НовоеЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.AMS_Агенты");
		
	ИначеЕсли ИзменяемыйРеквизит = "КаналПродаж" ИЛИ ИзменяемыйРеквизит = "ПодканалПродаж" Тогда
		
		Элементы.НовоеЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.AMS_КаналыПродаж");
		
	ИначеЕсли ИзменяемыйРеквизит = "ВидТерритории" Тогда
		
		Элементы.НовоеЗначение.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.AMS_ВидТерриторииКонтрагента");
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберете изменяемый реквизит", , "ИзменяемыйРеквизит", "ИзменяемыйРеквизит");
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ИзменитьДанныеПродавцаНаСервере(Продавец, ИзменяемыйРеквизит, НовоеЗначение)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ИнформацияОПродавцеСрезПоследних.Продавец КАК Продавец,
		|	AMS_ИнформацияОПродавцеСрезПоследних.Агент КАК Агент,
		|	AMS_ИнформацияОПродавцеСрезПоследних.АгентскийДоговор КАК АгентскийДоговор,
		|	AMS_ИнформацияОПродавцеСрезПоследних.Уволен КАК Уволен,
		|	AMS_ИнформацияОПродавцеСрезПоследних.Куратор КАК Куратор,
		|	AMS_ИнформацияОПродавцеСрезПоследних.ВидТерритории КАК ВидТерритории,
		|	AMS_ИнформацияОПродавцеСрезПоследних.КаналПродаж КАК КаналПродаж,
		|	AMS_ИнформацияОПродавцеСрезПоследних.ПодканалПродаж КАК ПодканалПродаж,
		|	AMS_ИнформацияОПродавцеСрезПоследних.ФункциональнаяПринадлежность КАК ФункциональнаяПринадлежность,
		|	AMS_ИнформацияОПродавцеСрезПоследних.АгентскийДоговор.Организация КАК Организация,
		|	AMS_ИнформацияОПродавцеСрезПоследних.АгентскийДоговор.Филиал КАК Филиал,
		|	AMS_ИнформацияОПродавцеСрезПоследних.АгентскийДоговор.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.AMS_ИнформацияОПродавце.СрезПоследних(&ТекущаяДата, ) КАК AMS_ИнформацияОПродавцеСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.AMS_СостояниеАгентскогоДоговора.СрезПоследних(&ТекущаяДата, ) КАК AMS_СостояниеАгентскогоДоговораСрезПоследних
		|		ПО AMS_ИнформацияОПродавцеСрезПоследних.АгентскийДоговор = AMS_СостояниеАгентскогоДоговораСрезПоследних.АгентскийДоговор
		|ГДЕ
		|	AMS_СостояниеАгентскогоДоговораСрезПоследних.Действует
		|	И AMS_ИнформацияОПродавцеСрезПоследних.Продавец = &Продавец";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	НачатьТранзакцию();
	Попытка
		
		ДатаДокумента  = ТекущаяДатаСеанса();
		ДокументОбъект = Документы.AMS_ИзмененияДанныхПродавцов.СоздатьДокумент();
		ДокументОбъект.Дата = ДатаДокумента;
		ДокументОбъект.ВидОперации = Перечисления.AMS_ВидИзмененияОперацииОПродавце.ИзменениеИнформации;
		ДокументОбъект.Агент 			= ВыборкаДетальныеЗаписи.Агент;
		ДокументОбъект.АгентскийДоговор = ВыборкаДетальныеЗаписи.АгентскийДоговор; 
		ДокументОбъект.Организация 		= ВыборкаДетальныеЗаписи.Организация;
		ДокументОбъект.Филиал			 = ВыборкаДетальныеЗаписи.Филиал;
		ДокументОбъект.Подразделение	 = ВыборкаДетальныеЗаписи.Подразделение;
		ДокументОбъект.ДатаВступленияВСилу = ДатаДокумента;
		
		СтрокаДокумента = ДокументОбъект.Продавцы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВыборкаДетальныеЗаписи);
		
		Если ИзменяемыйРеквизит = "КаналПродаж" Тогда
			
			СтрокаДокумента.КаналПродаж = НовоеЗначение;
			
		ИначеЕсли ИзменяемыйРеквизит = "ПодканалПродаж" Тогда
			
			СтрокаДокумента.ПодканалПродаж = НовоеЗначение;
			
		ИначеЕсли ИзменяемыйРеквизит = "ВидТерритории" Тогда
			
			СтрокаДокумента.ВидТерритории = НовоеЗначение;	
			
		ИначеЕсли ИзменяемыйРеквизит = "Куратор" Тогда
			
			СтрокаДокумента.Куратор = НовоеЗначение;
			ДокументОбъект.ВидОперации = Перечисления.AMS_ВидИзмененияОперацииОПродавце.СменаКуратора;
			
		КонецЕсли;	
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры	

#КонецОбласти