#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
		
	Для Каждого Строка Из ИсходныеДанные Цикл 
		
	
		СправочникЭлемент = Справочники
				.AMS_РеестрыВознагражденийПоМотивационнымПрограммамДляПередачивЦССУ
				.НайтиПоРеквизиту("ГУИД", Строка.DocumentGUID); 
		
		Если СправочникЭлемент.Пустая() Тогда 
			
			Продолжить;
			
		Иначе
			
			СправочникОбъект = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		Для каждого СтрокаРеестра Из СправочникОбъект.ВознагражденияАгентов Цикл
			
			СтрокаРеестра.ПринятВЦССУ = Истина;
		
		КонецЦикла;
				
		СправочникОбъект.ПричинаОтклоненияРеестра = Строка.Comment;
		
		Для каждого СтрокаОшибки Из Строка.Errors Цикл
		
			Реестр = Документы.AMS_РеестрПоПремиальнымПрограммам.НайтиПоРеквизиту("ГУИД", СтрокаОшибки.ReestrGUID);
			Агент  = Справочники.AMS_Агенты.НайтиПоРеквизиту("ГУИД", СтрокаОшибки.AgentGUID);
			
			КлючПоиска = Новый Структура;
			КлючПоиска.Вставить("Реестр", Реестр);
			КлючПоиска.Вставить("Агент", Агент);
			
			СтрокиРеестра = СправочникОбъект.ВознагражденияАгентов.НайтиСтроки(КлючПоиска);
			
			Для каждого СтрокаРеестра Из СтрокиРеестра Цикл
			
				СтрокаРеестра.ПринятВЦССУ = Ложь;
			    СтрокаРеестра.ОписаниеОшибки = СтрокаОшибки.ErrorText;
				
			КонецЦикла;
			
		КонецЦикла;
		
		СправочникОбъект.Отправлен = (Строка.Result = "success");		
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	

#КонецОбласти

#КонецЕсли
