
&НаСервере
Процедура ЗапуститьОбновлениеПредопределенныхНаСервере()
	ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ВыполнитьОбновлениеПредопределенных();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбновлениеПредопределенныхAMS_ПараметрыДополнительныхУсловий(Команда)
	ЗапуститьОбновлениеПредопределенныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбновлениеПредопределенныхAMS_ВидыСтраховыхПродуктовНаСервере()
	Справочники.AMS_ВидыСтраховыхПродуктов.ВыполнитьОбновлениеПредопределенных();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбновлениеПредопределенныхAMS_ВидыСтраховыхПродуктов(Команда)
	ЗапуститьОбновлениеПредопределенныхAMS_ВидыСтраховыхПродуктовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбновлениеПредопределенныхAMS_ВидыСравненияНаСервере()
	Справочники.AMS_ВидыСравнения.ВыполнитьОбновлениеПредопределенных();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбновлениеПредопределенныхAMS_ВидыСравнения(Команда)
	ЗапуститьОбновлениеПредопределенныхAMS_ВидыСравненияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбновлениеПредопределенныхAMS_ОрганизацииНаСервере()
	Справочники.AMS_Организации.ВыполнитьОбновлениеПредопределенных();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбновлениеПредопределенныхAMS_Организации(Команда)
	ЗапуститьОбновлениеПредопределенныхAMS_ОрганизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСтраховойПродуктНаСервере()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.ОСАГО,						Справочники.AMS_ВидыСтраховыхПродуктов.ОСАГО);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.КАСКО,						Справочники.AMS_ВидыСтраховыхПродуктов.КАСКО);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.ОСГОП,						Справочники.AMS_ВидыСтраховыхПродуктов.ОСГОП);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.ОСОПО,						Справочники.AMS_ВидыСтраховыхПродуктов.ОСОПО);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.Ответственность,				Справочники.AMS_ВидыСтраховыхПродуктов.Ответственность);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.НесчастныеСлучаи,			Справочники.AMS_ВидыСтраховыхПродуктов.НС);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.ПредпринимательскиеРиски,	Справочники.AMS_ВидыСтраховыхПродуктов.ПредпринимательскиеРиски);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.ДГО,							Справочники.AMS_ВидыСтраховыхПродуктов.ДГО);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.ЗКАСКО,						Справочники.AMS_ВидыСтраховыхПродуктов.ЗКАСКО);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.Грузы,						Справочники.AMS_ВидыСтраховыхПродуктов.Грузы);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.КУГИ,						Справочники.AMS_ВидыСтраховыхПродуктов.КУГИ);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.Произвольный,				Справочники.AMS_ВидыСтраховыхПродуктов.Прочее);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.ЗК,							Справочники.AMS_ВидыСтраховыхПродуктов.ЗК);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.ЛичноеСтрахование,			Справочники.AMS_ВидыСтраховыхПродуктов.ЛичноеCтрахование);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.СтрахованиеИмущества,		Справочники.AMS_ВидыСтраховыхПродуктов.Имущество);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.Ипотека,						Справочники.AMS_ВидыСтраховыхПродуктов.Ипотека);
	Результат.Вставить(Перечисления.AMS_ВидыСтраховыхПродуктов.ВЗР,							Справочники.AMS_ВидыСтраховыхПродуктов.ВЗР);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_СтраховыеПродукты.Ссылка КАК Ссылка,
		|	AMS_СтраховыеПродукты.ВидСтраховогоПродукта_Удалить КАК ВидСтраховогоПродукта_Удалить,
		|	AMS_СтраховыеПродукты.ВидСтраховогоПродукта КАК ВидСтраховогоПродукта
		|ИЗ
		|	Справочник.AMS_СтраховыеПродукты КАК AMS_СтраховыеПродукты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Ссылка.ЭтоГруппа Тогда
			Продолжить
		Иначе
			
		СсылкаПродукт = ВыборкаДетальныеЗаписи.Ссылка;
		ОбъектПродукт = СсылкаПродукт.ПолучитьОбъект();
		ПеречислениеПродукт = ВыборкаДетальныеЗаписи.ВидСтраховогоПродукта_Удалить;
		ОбъектПродукт.ВидСтраховогоПродукта = Результат.Получить(ПеречислениеПродукт);
		ОбъектПродукт.Записать();
		
	КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСтраховойПродукт(Команда)
	ПерезаполнитьСтраховойПродуктНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонстантуОрганизацииНаСервере()
	Константы.AMS_ОрганизацияПоУмолчанию.ЗаполнитьОрганизациюПоУмолчаниюПрограммно();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонстантуОрганизации(Команда)
	ЗаполнитьКонстантуОрганизацииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗапуститьОбновлениеПредопределенныхAMS_ВидыВознагражденийНаСервере()
	Справочники.AMS_ВидыВознаграждений.ВыполнитьОбновлениеПредопределенных();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбновлениеПредопределенныхAMS_ВидыВознаграждений(Команда)
	ЗапуститьОбновлениеПредопределенныхAMS_ВидыВознагражденийНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРеквизитОбязательноеСтрахованиеAMS_СтраховыеПродуктыНаСервере()
	Справочники.AMS_СтраховыеПродукты.ЗаполнитьРеквизитОбязательноеСтрахованиеВпервые();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьРеквизитОбязательноеСтрахованиеAMS_СтраховыеПродукты(Команда)
	ЗаполнитьРеквизитОбязательноеСтрахованиеAMS_СтраховыеПродуктыНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПредопределенныеМероприятияНаСервере()
	Справочники.AMS_Мероприятия.ВыполнитьОбновлениеПредопределенногоЭлемента();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПредопределенныеМероприятия(Команда)
	ЗаполнитьПредопределенныеМероприятияНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗапуститьОбновлениеПредопределенныхСтатусыАгентовНаСервере()
	Справочники.СтатусыАгентов.ВыполнитьОбновлениеПредопределенных();
КонецПроцедуры


&НаКлиенте
Процедура ЗапуститьОбновлениеПредопределенныхСтатусыАгентов(Команда)
	ЗапуститьОбновлениеПредопределенныхСтатусыАгентовНаСервере();
КонецПроцедуры


&НаСервере
Процедура ИнструментыСтатусовАгентовНаСервере()
	Справочники.ИнструментыСтатусовАгентов.ВыполнитьОбновлениеПредопределенных();
КонецПроцедуры


&НаКлиенте
Процедура ИнструментыСтатусовАгентов(Команда)
	ИнструментыСтатусовАгентовНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНастройкиДляСервисовПРОДНаСервере()
	
	Менеджер = РегистрыСведений.НастройкиДляСервисов.СоздатьМенеджерЗаписи();
	Менеджер.Наименование = "RatingsPositions";
	Менеджер.СредаЗапуска = Перечисления.AMS_СредыЗапуска.Прод;
	Менеджер.Сервис = Перечисления.Сервисы.МАМС;
	Менеджер.АдресСайта = "pro.ugsk.ru/master-ams";
	Менеджер.API = "/api/v1/integrations/reports/ratings/%1/positions";
	Менеджер.Параметр = "ratingGuid";
	Менеджер.APIKEY = "42226887-6458-42f3-a24d-a7ae242c9630";
	Менеджер.Метод = Перечисления.МетодыОбмена.GET;
	
	Менеджер.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьНастройкиДляСервисовПРОД(Команда)
	ЗаполнитьНастройкиДляСервисовПРОДНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНастройкиДляСервисовТЕСТНаСервере()

	Менеджер = РегистрыСведений.НастройкиДляСервисов.СоздатьМенеджерЗаписи();
	Менеджер.Наименование = "RatingsPositions";
	Менеджер.СредаЗапуска = Перечисления.AMS_СредыЗапуска.Тест;
	Менеджер.Сервис = Перечисления.Сервисы.МАМС;
	Менеджер.АдресСайта = "k8s-dev.ugsk.ru/develop/master-ams";
	Менеджер.API = "/api/v1/integrations/reports/ratings/%1/positions";
	Менеджер.Параметр = "ratingGuid";
	Менеджер.APIKEY = "762ed1bd-392c-406d-bc3f-f43af0790ba2";
	Менеджер.Метод = Перечисления.МетодыОбмена.GET;
	
	Менеджер.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиДляСервисовТЕСТ(Команда)
	ЗаполнитьНастройкиДляСервисовТЕСТНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбновлениеПредопределенныхУслугиИКУНаСервере()
	Справочники.КонсультационныеУслуги.ВыполнитьОбновлениеПредопределенных();
КонецПроцедуры


&НаКлиенте
Процедура ЗапуститьОбновлениеПредопределенныхУслугиИКУ(Команда)
	ЗапуститьОбновлениеПредопределенныхУслугиИКУНаСервере();
КонецПроцедуры


&НаСервере
Процедура СрокДействияПриростаНаСервере()
	Обработки.AMS_СлужебнаяОбработкаОбновления.СрокДействияПриростаОбновлениеПредопределенных();
КонецПроцедуры


&НаКлиенте
Процедура СрокДействияПрироста(Команда)
	СрокДействияПриростаНаСервере();
КонецПроцедуры

