&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("Запись_УзелПланаОбмена");
КонецПроцедуры // ПриЗакрытии()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
КонецПроцедуры // ПриЗаписиНаСервере()

&НаСервере
Процедура ПроверитьПодключениеRabbitMQНаСервере()
		
	ОбменДаннымиAMS.ПроверитьПодключениеСервер(ПараметрыПодключения());
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеRabbitMQ(Команда)
	ПроверитьПодключениеRabbitMQНаСервере();
КонецПроцедуры

&НаСервере
Функция ПараметрыПодключения()

	Результат = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост");
	ЗаполнитьЗначенияСвойств(Результат, Объект);
	Возврат Результат;
	
КонецФункции
