#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеПоАгентам() Экспорт

	ДанныеДляВыгрузки = СобратьДанныеПоВыгрузке();	
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СобратьДанныеПоВыгрузке()
	
	Результат = Новый Массив;
	АгентскиеДоговора = ПолучитьАгентскиеДоговора();	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_АгентскиеДоговоры.РегистрационныйНомер КАК РегистрационныйНомер,
		|	AMS_АгентскиеДоговоры.Владелец.НаименованиеПолное КАК ВладелецНаименованиеПолное,
		|	AMS_СоответствиеБрокеровАгентам.Брокер.НаименованиеПолное КАК БрокерНаименованиеПолное,
		|	AMS_АгентскиеДоговоры.Владелец.ИНН КАК ВладелецИНН
		|ИЗ
		|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.AMS_СоответствиеБрокеровАгентам КАК AMS_СоответствиеБрокеровАгентам
		|		ПО AMS_АгентскиеДоговоры.Владелец = AMS_СоответствиеБрокеровАгентам.ПодчиненныйАгент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецФункции	

Функция ПолучитьАгентскиеДоговора()
	
	Узлы = ПолучитьУзлыРегистрации();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_АгентскиеДоговорыИзменения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AMS_АгентскиеДоговоры.Изменения КАК AMS_АгентскиеДоговорыИзменения
		|ГДЕ
		|	AMS_АгентскиеДоговорыИзменения.Узел В(&Узлы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	AMS_АгентскиеДоговоры.Ссылка
		|ИЗ
		|	Справочник.AMS_Агенты.Изменения КАК AMS_АгентыИзменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
		|		ПО AMS_АгентыИзменения.Ссылка = AMS_АгентскиеДоговоры.Владелец
		|ГДЕ
		|	AMS_АгентыИзменения.Узел В(&Узлы)";
	
	Запрос.УстановитьПараметр("Узлы", Узлы);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат РезультатЗапроса;
		
КонецФункции

Функция ПолучитьУзлыРегистрации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АгентыДляСайта.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.АгентыДляСайта КАК АгентыДляСайта
		|ГДЕ
		|	НЕ АгентыДляСайта.ЭтотУзел";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат РезультатЗапроса;
	
КонецФункции	

#КонецОбласти