#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтеграцияМАМС
Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт
	
	 Результат = ПолучитьСтруктуруСообщения();
	 ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);
	 
	 Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	 
	 Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)

	ДанныеБанк = ДанныеПоСсылке(ОбъектСсылка);	
	
	ЗаполнитьЗначенияСвойств(Результат, ДанныеБанк); 
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "Bank");
	Результат.Вставить("id");
	Результат.Вставить("name");
	Результат.Вставить("inn");
	Результат.Вставить("cssuGuid");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ДанныеПоСсылке(СсылкаНаБанк)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_Банки.ГУИДЦССУ КАК cssuGuid,
		|	AMS_Банки.ИНН КАК inn,
		|	AMS_Банки.ИдентификаторКИАС КАК id,
		|	AMS_Банки.НаименованиеПолное КАК name
		|ИЗ
		|	Справочник.AMS_Банки КАК AMS_Банки
		|ГДЕ
		|	AMS_Банки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаБанк);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции	

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьПровестиДокуметКВБанка(Банк, Вознаграждение) Экспорт
	
	БанкСсылка = Банк.Ссылка;
	
	ТЗТекущиеВознаграждения = ТекущиеВознаграждения(БанкСсылка);
	ТЗНовыеВознаграждения 	= НовыеВознаграждения(Вознаграждение);
	
	ДанныеДляКВ = СравнитьЗначения(ТЗТекущиеВознаграждения, ТЗНовыеВознаграждения);
	
	СоздатьДокументИзменениеКВБанка(БанкСсылка, ДанныеДляКВ);
	
КонецПроцедуры

Процедура СоздатьДокументИзменениеКВБанка(Банк, МассивКЗаполнению)
	
	Если МассивКЗаполнению.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	ДокументОбъект = Документы.AMS_ИзменениеКВБанка.СоздатьДокумент();
	ДокументОбъект.Банк = Банк;
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	Для Каждого СтрокаЗаполнения Из МассивКЗаполнению Цикл
		
		ДокументТЧ = ДокументОбъект.Вознаграждение.Добавить();
		ДокументТЧ.ДатаНачалаДействия = СтрокаЗаполнения.НачалоДействияРазмераКВ;
		ДокументТЧ.РазмерКВ = СтрокаЗаполнения.РазмерКВ;
		ДокументТЧ.Риск = СтрокаЗаполнения.Риск;
		
	КонецЦикла;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный)
	
КонецПроцедуры

Функция СравнитьЗначения(СтарыеДанные, НовыеДанные)
	
	МассивКЗаполнению = Новый Массив;
	
	Для Каждого СтрокаКВ Из НовыеДанные Цикл
		
		Отбор = Новый Структура("Риск, РазмерКВ, НачалоДействияРазмераКВ", СтрокаКВ.Риск, СтрокаКВ.РазмерКВ, СтрокаКВ.НачалоДействияРазмераКВ);
		СтрокаТЧ = СтарыеДанные.НайтиСтроки(Отбор);
		
		Если СтрокаТЧ.Количество() = 0 Тогда
			МассивКЗаполнению.Добавить(Отбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивКЗаполнению;
	
КонецФункции

Функция НовыеВознаграждения(Вознаграждение)
	
	ВознаграждениеНовые = Вознаграждение.Выгрузить();
	Возврат ВознаграждениеНовые;
	
КонецФункции

Функция ТекущиеВознаграждения(Банк)

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТаблицыДокумента();
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("ДатаОкончания", Дата(1, 1, 1));
	
	ВознагражденияПолученные = Запрос.Выполнить().Выгрузить();
	
	Возврат ВознагражденияПолученные;
	
КонецФункции

Функция ТекстЗапросаТаблицыДокумента()
	
	Результат = 
	"ВЫБРАТЬ
	|	AMS_РазмерыКВБанковСрезПоследних.Риск КАК Риск,
	|	AMS_РазмерыКВБанковСрезПоследних.РазмерКВ КАК РазмерКВ,
	|	AMS_РазмерыКВБанковСрезПоследних.ДатаНачалаДействия КАК НачалоДействияРазмераКВ
	|ИЗ
	|	РегистрСведений.AMS_РазмерыКВБанков.СрезПоследних(
	|			,
	|			Банк = &Банк
	|				И ДатаОкончанияДействия = &ДатаОкончания) КАК AMS_РазмерыКВБанковСрезПоследних";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли