#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт

	ГУИД = ИсходныеДанные.registryGuid;
	
	СсылкаНаДокумент = Документы.AMS_РеестрПоПремиальнымПрограммам.НайтиПоРеквизиту("ГУИД", ГУИД);
	
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		
		ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
		ДокументОбъект.МотивационныеПрограммы.Очистить();
		ДокументОбъект.Договоры.Очистить();
		
	Иначе
		
		ДокументОбъект = Документы.AMS_РеестрПоПремиальнымПрограммам.СоздатьДокумент();
		ДокументОбъект.ГУИД = ГУИД;
		
	КонецЕсли;
	
	// Данные шапки
	ДокументОбъект.Дата = ДатаИзСтроки(ИсходныеДанные.createDate); 
	ДокументОбъект.НачалоПериода    = ДатаИзСтроки(ИсходныеДанные.from);
	ДокументОбъект.ОкончаниеПериода = ДатаИзСтроки(ИсходныеДанные.to);
	ДокументОбъект.Агент 			= ЭлементСправочникаПоЦССУ("AMS_Агенты", ИсходныеДанные.agentGuid);
	ДокументОбъект.СуммаВознаграждения = ИсходныеДанные.rewardSum;
	ДокументОбъект.Статус              = Перечисления.AMS_СтатусыРеестра.Создан;
	
	Для каждого СтрокаТаблицы Из ИсходныеДанные.Data Цикл
	
		МотивационнаяПрограмма = ПолучитьМотивационнуюПрограмму(СтрокаТаблицы.guid, СтрокаТаблицы.name);
		СтрокаМотивации = ДокументОбъект.МотивационныеПрограммы.Добавить();
		СтрокаМотивации.МотивационнаяПрограмма = МотивационнаяПрограмма;
		СтрокаМотивации.СуммаВознаграждения    = СтрокаТаблицы.reward;
		СтрокаМотивации.СуммаПремии			   = СтрокаТаблицы.premium;
		
		Для каждого РасшифровкаПоДоговорам Из СтрокаТаблицы.commissions Цикл
			
			СтрокаДоговоров = ДокументОбъект.Договоры.Добавить();
			СтрокаДоговоров.МотивационнаяПрограмма = МотивационнаяПрограмма;
			СтрокаДоговоров.ВознаграждениеПроцент  = РасшифровкаПоДоговорам.percent;
			СтрокаДоговоров.ИдентификаторРасчета   = РасшифровкаПоДоговорам.guid;
			СтрокаДоговоров.Премия				   = РасшифровкаПоДоговорам.premium;
		    СтрокаДоговоров.ВознагражденийСумма	   = РасшифровкаПоДоговорам.reward;
			СтрокаДоговоров.ДоговорСтрахования	   = СоздатьНайтиДоговорСтрахования(РасшифровкаПоДоговорам.contract, 
														ДокументОбъект.Агент, 
														СтрокаМотивации.СуммаПремии);
		КонецЦикла;
		
	КонецЦикла;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

Функция ИнициализироватьПараметрыСписка() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПоискАгент");
	Результат.Вставить("ПоискФилиал");
	Результат.Вставить("ПоискСтатус");
	Результат.Вставить("ПоискПериод");
	Результат.Вставить("ПоискДоговор");
	Результат.Вставить("ПоискДоговоры");
	
	Возврат Результат;
	
КонецФункции	

Функция ТекстЗапросаСписокОтбора(Параметры) Экспорт
	
	Результат = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_РеестрПоПремиальнымПрограммам.Агент КАК Агент,
	|	AMS_РеестрПоПремиальнымПрограммам.НачалоПериода КАК НачалоПериода,
	|	AMS_РеестрПоПремиальнымПрограммам.ОкончаниеПериода КАК ОкончаниеПериода,
	|	AMS_РеестрПоПремиальнымПрограммам.Статус КАК Статус,
	|	AMS_РеестрПоПремиальнымПрограммам.СуммаВознаграждения КАК СуммаВознаграждения,
	|	AMS_РеестрПоПремиальнымПрограммам.ГУИД КАК ГУИД,
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал
	|ИЗ
	|	Документ.AMS_РеестрПоПремиальнымПрограммам КАК AMS_РеестрПоПремиальнымПрограммам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ПО AMS_РеестрПоПремиальнымПрограммам.Агент = AMS_АгентскиеДоговоры.Владелец
	|			И (AMS_АгентскиеДоговоры.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыАД.Действует)) И (AMS_АгентскиеДоговоры.Ссылка.Филиал <> ЗНАЧЕНИЕ(Справочник.AMS_Филиалы.ПустаяСсылка)) 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_РеестрПоПремиальнымПрограммам.Договоры КАК AMS_РеестрПоПремиальнымПрограммамДоговоры
	|		ПО AMS_РеестрПоПремиальнымПрограммам.Ссылка = AMS_РеестрПоПремиальнымПрограммамДоговоры.Ссылка
	|ГДЕ
	|	&УсловиеАгент
	|	И &УсловияФилиал
	|	И &УсловияСтатус
	|	И &УсловияПериодНачала
	|	И &УсловияПериодОкончания
	|	И &УсловияДоговорСтрахования
	|	И &УсловияДоговорыСтрахования";
	
	Если ЗначениеЗаполнено(Параметры.ПоискАгент) Тогда
		УсловияАгент = " AMS_РеестрПоПремиальнымПрограммам.Агент = &Агент "
	Иначе
		УсловияАгент = " Истина "
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ПоискФилиал) Тогда
		УсловияФилиал = " AMS_АгентскиеДоговоры.Филиал = &Филиал "
	Иначе
		УсловияФилиал = " Истина ";
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ПоискСтатус) Тогда
		УсловияСтатус = " AMS_РеестрПоПремиальнымПрограммам.Статус = &Статус "
	Иначе
		УсловияСтатус = " Истина ";
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ПоискПериод.ДатаНачала) Тогда
		УсловияПериодНачала = " AMS_РеестрПоПремиальнымПрограммам.НачалоПериода >= &ПериодНачала "
	Иначе
		УсловияПериодНачала = " Истина ";
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ПоискПериод.ДатаОкончания) Тогда
		УсловияПериодОкончания = " AMS_РеестрПоПремиальнымПрограммам.ОкончаниеПериода <= &ПериодОкончания "
	Иначе
		УсловияПериодОкончания = " Истина ";
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ПоискДоговор) Тогда
		УсловияДоговорСтрахования = " AMS_РеестрПоПремиальнымПрограммамДоговоры.ДоговорСтрахования = &ДоговорСтрахования "
	Иначе
		УсловияДоговорСтрахования = " Истина ";
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ПоискДоговоры) Тогда
		УсловияДоговорыСтрахования = " AMS_РеестрПоПремиальнымПрограммамДоговоры.ДоговорСтрахования.Наименование ПОДОБНО ""%" + Параметры.ПоискДоговоры + "%""";
	Иначе
		УсловияДоговорыСтрахования = " Истина ";
	КонецЕсли;

	Результат = СтрЗаменить(Результат, "&УсловиеАгент", УсловияАгент);
	Результат = СтрЗаменить(Результат, "&УсловияФилиал", УсловияФилиал);
	Результат = СтрЗаменить(Результат, "&УсловияСтатус", УсловияСтатус);
	Результат = СтрЗаменить(Результат, "&УсловияПериодНачала", УсловияПериодНачала);
	Результат = СтрЗаменить(Результат, "&УсловияПериодОкончания", УсловияПериодОкончания);
	Результат = СтрЗаменить(Результат, "&УсловияДоговорСтрахования", УсловияДоговорСтрахования);
	Результат = СтрЗаменить(Результат, "&УсловияДоговорыСтрахования", УсловияДоговорыСтрахования);

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьНайтиДоговорСтрахования(ДанныеДоговора, Агент, СтраховаяПремия)

	ГУИД = ДанныеДоговора.guid;
	
	ДС = Справочники.AMS_ДоговорыСтрахования.НайтиПоРеквизиту("ГУИД", ГУИД);
	
	Если ЗначениеЗаполнено(ДС) Тогда
		
		ДСОбъект = ДС.ПолучитьОбъект();
		
	Иначе
		
		ДСОбъект = Справочники.AMS_ДоговорыСтрахования.СоздатьЭлемент();	
		
	КонецЕсли;	
	
	ДСОбъект.ГУИД = ГУИД;
	ДСОбъект.Наименование = ДанныеДоговора.insurantName 
						+ " №" + ДанныеДоговора.number;
	ДСОбъект.НомерДоговора = ДанныеДоговора.number;
	ДСОбъект.Страхователь = ДанныеДоговора.insurantName;
	ДСОбъект.ДатаЗаключения 		= ДатаИзСтроки(ДанныеДоговора.conclusionDate);
	ДСОбъект.ДатаНачалаДействия 	= ДатаИзСтроки(ДанныеДоговора.startDate);
	ДСОбъект.ДатаОкончанияДействия	= ДатаИзСтроки(ДанныеДоговора.endDate);
	ДСОбъект.Продукт                = ЭлементСправочникаПоЦССУ("AMS_СтраховыеПродукты", ДанныеДоговора.productGuid);
	ДСОбъект.Агент					= Агент;
	ДСОбъект.СтраховаяПремия		= СтраховаяПремия;
	ДСОбъект.Записать();
	
	Возврат ДСОбъект.Ссылка;
	
КонецФункции	

Функция ПолучитьМотивационнуюПрограмму(ГУИД, Наименование)
	
	Результат = Справочники.AMS_МотивационныеПрограммы.НайтиПоРеквизиту("ГУИД", ГУИД);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Справочники.AMS_МотивационныеПрограммы.СоздатьЭлемент();
	Результат.Наименование = Наименование;
	Результат.ОфициальноеНаименование = Наименование;
	Результат.ГУИД = ГУИД;
	Результат.ОбменДанными.Загрузка = Истина;
	Результат.Записать();
	
	Возврат Результат.Ссылка;
	
КонецФункции	

Функция ДатаИзСтроки(СтрокаДаты)
	
	Год = Сред(СтрокаДаты, 1, 4);
	Месяц = Сред(СтрокаДаты, 6, 2);
	День  = Сред(СтрокаДаты, 9, 2);
	
	Возврат Год + Месяц + День;
	
КонецФункции	

#КонецОбласти

#КонецЕсли