#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьПредставления();
	УстановитьОграниченияПользователя();
	УстановитьВидимостьУстановкиКВ();
	УстановитьВидимостьСогласованиеЗаявки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОграниченияПользователя();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриИзменении(Элемент)
	УстановитьКлючиСтрокСтраховыеПродукты();
	УстановитьКлючиСтрокУсловия();
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПередУдалением(Элемент, Отказ)
	
	ИндексСтроки = Объект.СтраховыеПродукты.Индекс(Элементы.СтраховыеПродукты.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.СтраховыеПродукты.Получить(ИндексСтроки);
	КлючСвязи = ВыделеннаяСтрока.КлючСвязи;
	
	НулевыеСтроки = Условия.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
	
	Для каждого СтрокаТаблицы Из НулевыеСтроки Цикл
		
		Условия.Удалить(СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Объект.СтраховыеПродукты[Объект.СтраховыеПродукты.Количество()-1].КлючСвязи = ПолучитьУИД();
		
	КонецЕсли;
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Попытка
		
		ИндексСтрокиУсловия = Объект.СтраховыеПродукты.Индекс(Элементы.СтраховыеПродукты.ТекущиеДанные);
		ВыделеннаяСтрока = Объект.СтраховыеПродукты.Получить(ИндексСтрокиУсловия);
		
	Исключение
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Требуется добавить данные в табличной части ""Страховые продукты""",,,,Истина);
		Отказ = Истина;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПриАктивизацииСтроки(Элемент)
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПриИзменении(Элемент)
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаСервере
Процедура УсловияПараметрПриИзмененииНаСервере()
	
	Для каждого Строка Из Условия Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.ОператорСравнения) Тогда
			
			Строка.ОператорСравнения = Справочники.AMS_ВидыСравнения.Равно;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_ВидыСтраховыхПродуктов") Тогда
		
		МассивАгентов = ПолучитьСтраховыеПродуктыПоВидамСтраховыхПродуктов(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_СтраховыеПродукты") Тогда
		
		МассивАгентов = ПолучитьСтраховыеПродуктыПоСтраховымПродуктам(ВыбранноеЗначение);

	КонецЕсли;
	
	ЗаполнитьСтраховыеПродукты(МассивАгентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Для Каждого Продукт Из Объект.СтраховыеПродукты Цикл
		
		Индекс = Продукт.НомерСтроки - 1;
		
		Если НЕ ЗначениеЗаполнено(Продукт.ДатаОкончанияДействия) 
			И Продукт.Отменен Тогда
			
			ТекстСообщения	 = "Не заполнено поле ""Дата окончания действия""";
			Поле			 = "Объект.СтраховыеПродукты[" + Индекс + "].ДатаОкончанияДействия";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Поле,,Истина);
			Отказ = Истина;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Продукт.ДатаНачалаДействия) 
			И ЗначениеЗаполнено(Продукт.ДатаОкончанияДействия) Тогда
			Если Продукт.ДатаНачалаДействия > Продукт.ДатаОкончанияДействия Тогда
				ТекстСообщения = "Дата окончания действия не должна быть меньше даты начала действия";
				Поле = "Объект.СтраховыеПродукты[" + Индекс + "].ДатаОкончанияДействия";
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Поле,,Истина);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОрганизацию();
	ДобавитьКлючиСвязи();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ЗадачаИспонителя") Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;	
	
	ЗадачаИсполнителя = Параметры.ЗадачаИспонителя;  
		
	Если ЗадачаИсполнителя.Выполнена Тогда
		
		Элементы.ДействияСогласования.Видимость = Ложь;
	КонецЕсли;	
	
	Если ПолучитьДанныеДляСогласования() = Неопределено Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;	
	
	ОбновлениеВидимостиПоСогласующему();
	
	ОтборКлючей = Объект.Показатели.Выгрузить().ВыгрузитьКолонку("КлючСвязи");
	
	Если ОтборКлючей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьУсловияПриСоздании(ОтборКлючей);
	
	ЗаполнитьОрганизацию();
	СостояниеЗаявки = РегистрыСведений.СостояниеЗаявокНаИзменениеАД.ТекущийСтатус(Объект.Ссылка);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеРазмеровКВАгентаПриИзменении(Элемент)
	
	УстановитьВидимостьУстановкиКВ();
	
	Если Объект.ИзменениеРазмеровКВАгента Тогда
		
		Объект.КаналПродаж 		 = Неопределено;
		Объект.ПодканалПродаж	 = Неопределено;
		Объект.КатегорияПродавца = Неопределено;
		
		Объект.Филиал = AMS_КомиссионноеВознаграждение.ФилиалАгента(Объект.Агент);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ИзменениеРазмеровКВАгента 
		И НЕ ЗначениеЗаполнено(Объект.Агент) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить агента"
					,ЭтаФорма
					,"Агент"
					,"Объект.Агент"
					, Отказ);
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗамечанияЗамечаниеПриИзменении(Элемент)
	
	ДанныеЗамечаний = Элементы.Замечания.ТекущиеДанные;
	Если ДанныеЗамечаний = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеЗамечаний.Пользователь = ПользователиКлиент.АвторизованныйПользователь();
		
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура АгентПриИзменении(Элемент)
	Если Объект.ИзменениеРазмеровКВАгента Тогда
		
		Объект.КаналПродаж 		 = Неопределено;
		Объект.ПодканалПродаж	 = Неопределено;
		Объект.КатегорияПродавца = Неопределено;
		
		Объект.Филиал = AMS_КомиссионноеВознаграждение.ФилиалАгента(Объект.Агент);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтраховойПродукт(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	ОткрытьФорму("Справочник.AMS_СтраховыеПродукты.Форма.ФормаВыбора", ПараметрыФормы, 
			ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВидыСтраховыхПродуктов(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	ОткрытьФорму("Справочник.AMS_ВидыСтраховыхПродуктов.Форма.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуНачалаДействия(Команда)
	ПослеВводаДаты = Новый ОписаниеОповещения("ПерезаполнитьДату", ЭтотОбъект);
	ПоказатьВводДаты(ПослеВводаДаты,,"Выберите дату");
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСогласование(Команда)
	
	Объект.ЗаявкаНаСогласовании = Истина;
	Записать();
	ПроцессыСогласованияЗаявкиКлиентСервер.СоздатьИСтартоватьПроцессСогласования(Объект.Ссылка);
	УстановитьВидимостьСогласованиеЗаявки();
	
КонецПроцедуры

#Область СогласованиеДокумента

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОбработатьДействиеСогласования("Отклонить");
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаДоработку(Команда)
	
	ОбработатьДействиеСогласования("НаДоработку");
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	
	ОбработатьДействиеСогласования("Согласовать");
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ФункциональностьВключена(Параметр)
	Возврат ФункциональностьAMSДоступна(Параметр)
КонецФункции

&НаСервере
Функция ПолучитьПараметрыОтбора(ПараметрОтбора)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить(ПараметрОтбора, ПараметрыСеанса.AMS_ПараметрыПользователя.ДоступныеСтраховыеПродукты);
	
	Возврат ПараметрыОтбора;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОграниченияПользователя()
	
	Если НЕ Объект.Проведен Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ЭтоПолноправныйПользователь()
	Возврат ПараметрыСеанса.AMS_ПараметрыПользователя.ЭтоПолноправныйПользователь
КонецФункции

&НаСервере
Процедура ЗаполнитьОрганизацию()
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Константы.AMS_ОрганизацияПоУмолчанию.Получить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючиСтрокСтраховыеПродукты()
	
	Для каждого Стр Из Объект.СтраховыеПродукты Цикл
		
		Если Не ЗначениеЗаполнено(Стр.КлючСвязи) Тогда
			
			Стр.КлючСвязи = Стр.ПолучитьИдентификатор();
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтрок()
	
	ТекущиеДанные = Элементы.СтраховыеПродукты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСвязи = ТекущиеДанные.КлючСвязи;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("КлючСвязи", КлючСвязи);
	Элементы.Условия.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючиСтрокУсловия()
	
	ИндексСтрокиУсловия = Объект.СтраховыеПродукты.Индекс(Элементы.СтраховыеПродукты.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.СтраховыеПродукты.Получить(ИндексСтрокиУсловия);
	КлючСвязи = ВыделеннаяСтрока.КлючСвязи;
	
	Для каждого Стр Из Условия Цикл
		
		Если Не ЗначениеЗаполнено(Стр.КлючСвязи) Тогда
			
			Стр.КлючСвязи = КлючСвязи;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УсловияПараметрПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУИД()
	Возврат Новый УникальныйИдентификатор();
КонецФункции

&НаСервере
Функция ПолучитьСтраховыеПродуктыПоСтраховымПродуктам(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AMS_СтраховыеПродукты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.AMS_СтраховыеПродукты КАК AMS_СтраховыеПродукты
	|ГДЕ
	|	AMS_СтраховыеПродукты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранноеЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("СтраховойПродукт", 	 Выборка.Ссылка);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСтраховыеПродуктыПоВидамСтраховыхПродуктов(ВыбранноеЗначение)

	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AMS_СтраховыеПродукты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.AMS_СтраховыеПродукты КАК AMS_СтраховыеПродукты
	|ГДЕ
	|	AMS_СтраховыеПродукты.ВидСтраховогоПродукта = &ВидСтраховогоПродукта";
	
	Запрос.УстановитьПараметр("ВидСтраховогоПродукта", ВыбранноеЗначение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("СтраховойПродукт", 	 Выборка.Ссылка);
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтраховыеПродукты(СтраховыеПродукты)	
	Для каждого Продукт Из СтраховыеПродукты Цикл 
		
		Отбор = Новый Структура("СтраховойПродукт", Продукт.СтраховойПродукт);
		ЕстьСтраховойПродукт = Объект.СтраховыеПродукты.НайтиСтроки(Отбор).Количество() > 0;
		Если ЕстьСтраховойПродукт Тогда
			Продолжить;
		КонецЕсли;	
		
		СтрокаСтраховойПродукт = Объект.СтраховыеПродукты.Добавить();
		СтрокаСтраховойПродукт.СтраховойПродукт = Продукт.СтраховойПродукт;
		СтрокаСтраховойПродукт.ДатаНачалаДействия = КонецДня(ТекущаяДатаСеанса()) + 1;
		
		Если НЕ ЗначениеЗаполнено(СтрокаСтраховойПродукт.КлючСвязи) Тогда
			СтрокаСтраховойПродукт.КлючСвязи = ПолучитьУИД();
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ДобавитьКлючиСвязи()
	
	Объект.Показатели.Очистить();
	
	Для Каждого Продукт Из Объект.СтраховыеПродукты Цикл
		
		Отбор = Новый Структура("КлючСвязи", Продукт.КлючСвязи);
		СтрокаТабличнойЧасти = Условия.НайтиСтроки(Отбор);
		
		МассивПараметров = Новый Массив;
		
		Для Каждого Параметр Из СтрокаТабличнойЧасти Цикл
			
			СтруктураПростыхУсловий = СтруктураПростыхУсловий();
			ЗаполнитьЗначенияСвойств(СтруктураПростыхУсловий, Параметр);
			
			//--------------Удалить?
			Если СтруктураПростыхУсловий.Значение = Неопределено Тогда
				СтруктураПростыхУсловий.Значение = Параметр.ПредставлениеУсловия;
			КонецЕсли;
			//--------------Удалить?
			
			МассивПараметров.Добавить(СтруктураПростыхУсловий);
			
		КонецЦикла;
		
		КонтрольноеЧисло = Справочники.AMS_КлючиУсловий.СоздатьКлючУсловий(МассивПараметров);
		
		ЗаполнитьДанныеФормы(КонтрольноеЧисло, Продукт.КлючСвязи);
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы(КонтрольноеЧисло, КлючСвязи);
	
	ЗаполнитьПоказатели = Объект.Показатели.Добавить();
	ЗаполнитьПоказатели.КлючСвязи = КлючСвязи;
	ЗаполнитьПоказатели.КлючУсловий = Справочники.AMS_КлючиУсловий.НайтиПоРеквизиту("КонтрольноеЧисло", Строка(КонтрольноеЧисло));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСправочникКлючиУсловий(КонтрольноеЧисло, МассивПараметров)	
	
	СправочникОбъект = Справочники.AMS_КлючиУсловий.НайтиПоРеквизиту("КонтрольноеЧисло", Строка(КонтрольноеЧисло));
	
	Если НЕ ЗначениеЗаполнено(СправочникОбъект) Тогда
		
		НовыйСправочник = Справочники.AMS_КлючиУсловий.СоздатьЭлемент();
		НовыйСправочник.КонтрольноеЧисло = КонтрольноеЧисло;
		
		Для каждого НоваяСтрока Из МассивПараметров Цикл
			
			СтрокаТЧ = НовыйСправочник.НаборУсловий.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, НоваяСтрока);
			НовыйСправочник.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловияПриСоздании(ОтборКлючей);
	
	Для каждого Показатель Из Объект.Показатели Цикл
	
		Для Каждого Выборка Из Показатель.КлючУсловий.НаборУсловий Цикл
			
			УсловияТЧ = Условия.Добавить();
			ЗаполнитьЗначенияСвойств(УсловияТЧ, Выборка);
			Если ЗначениеЗаполнено(Выборка.ЗначениеПроизвольногоТипа) Тогда
				УсловияТЧ.ЗначениеПроизвольногоТипа = Выборка.ЗначениеПроизвольногоТипа.Получить();
			КонецЕсли;	
			УсловияТЧ.КлючСвязи = Показатель.КлючСвязи;
			
		КонецЦикла;
			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура УсловияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
		ИЛИ ТекущиеДанные.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
		Тогда
		
		ВыбратьЗначенияПараметра(ТекущиеДанные.ЗначениеПроизвольногоТипа,
								 		ТекущиеДанные.Параметр);
		
	Иначе
		
		ВыбратьФиксированныйТипЗначениеПараметра(ТекущиеДанные.Значение,
								 		ТекущиеДанные.Параметр);
		
	КонецЕсли;	
	
	ОбновитьВидимостьПредставления();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФиксированныйТипЗначениеПараметра(ТекущиеЗначения, Параметр) Экспорт
	
	ТипЗначенияСписка = AMS_РаботаСДиалогамиСервер.ТипПоПВХ(Параметр);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьФиксированныйТипЗначениеПараметраЗавершение",
												ЭтотОбъект);
	
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущиеЗначения, , ТипЗначенияСписка); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФиксированныйТипЗначениеПараметраЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	ТекущиеДанные.Значение = Результат;
	ОбновитьВидимостьПредставления();
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьВидимостьПредставления()
		
	Для каждого СтрокаУсловий Из Условия Цикл
	
		Если СтрокаУсловий.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
			ИЛИ СтрокаУсловий.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
			Тогда
			
			СтрокаУсловий.ПредставлениеУсловия = СтрокаУсловий.ЗначениеПроизвольногоТипа;		
		Иначе
			
			СтрокаУсловий.ПредставлениеУсловия = СтрокаУсловий.Значение; 
			
		КонецЕсли;	
		
	КонецЦикла;
	Элементы.Условия.Обновить();
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьЗначенияПараметра(ТекущиеЗначения, Параметр) Экспорт
	
	ТипЗначенияСписка = AMS_РаботаСДиалогамиСервер.ТипПоПВХ(Параметр); 
	
	СписокРезультат = Новый СписокЗначений;
	СписокРезультат.ТипЗначения = ТипЗначенияСписка;
	
	Для каждого ЭлементСписка Из ТекущиеЗначения Цикл
	
		СписокРезультат.Добавить(ЭлементСписка.Значение);	
	
	КонецЦикла;
	
	ПараметрыВыбораТекущегоСписка = Новый Структура("СписокДанных", СписокРезультат);
	ОткрытьФорму("ОбщаяФорма.AMS_ВводСпискаЗначений", ПараметрыВыбораТекущегоСписка,,,,, Новый ОписаниеОповещения("ВыбратьЗначенияПараметраЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначенияПараметраЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
		И ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
		Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекущиеДанные.ЗначениеПроизвольногоТипа = Результат;
	ОбновитьВидимостьПредставления();	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СтруктураПростыхУсловий()

	Возврат AMS_КлючиУсловийСервер.СтруктураПростыхУсловий();
	
КонецФункции

&НаКлиенте
Процедура ПерезаполнитьДату(Дата, ДополнительныеПараметры) Экспорт
	
	Если Дата = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого СтрокаПродукт Из Объект.СтраховыеПродукты Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаПродукт.ДатаНачалаДействия) Тогда
			СтрокаПродукт.ДатаНачалаДействия = Дата;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьУстановкиКВ()

	Элементы.КаналПродаж.Видимость = НЕ Объект.ИзменениеРазмеровКВАгента;
	Элементы.ПодканалПродаж.Видимость = НЕ Объект.ИзменениеРазмеровКВАгента;
	Элементы.КатегорияПродавца.Видимость = НЕ Объект.ИзменениеРазмеровКВАгента;
	
	Элементы.Филиал.Доступность = НЕ Объект.ИзменениеРазмеровКВАгента;
	Элементы.ИзменениеРазмеровКВАгента.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСогласованиеЗаявки()

	Если ЗаявкаСогласована() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ЗаявкаСогласована()
	
	Если РегистрыСведений.СостояниеЗаявокНаИзменениеАД.ТекущийСтатус(Объект.Ссылка) = ПредопределенноеЗначение("Справочник.СтатусыЗаявок.Согласована") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОбработатьДействиеСогласования(Действие)

	ЗадачаОбъект = ЗадачаИсполнителя.ПолучитьОбъект();

	ДанныеДляСогласования = ПолучитьДанныеДляСогласования();
	
	Резолюция = Перечисления.РезультатВыполненияЗадачиСогласования.Выполнено;
	
	Если Действие = "Согласовать" Тогда
		
		ЗадачаОбъект.Согласована = Истина;
		ЗадачаОбъект.Записать();
		ЗадачаОбъект.ВыполнитьЗадачу();
		
	ИначеЕсли Действие = "НаДоработку" Тогда
		
		Объект.НаДоработку = Истина;
		Объект.ЗаявкаНаСогласовании = Ложь;
		
		ЗадачаОбъект.ОтправленоНаДоработку = Истина;
		ЗадачаОбъект.Записать();
		ЗадачаОбъект.ВыполнитьЗадачу();
		УстановитьСтатусЗаявки(ПредопределенноеЗначение("Справочник.СтатусыЗаявок.Новая"));
		Резолюция = Перечисления.РезультатВыполненияЗадачиСогласования.ОтправленоНаДоработку;
		
		Контекст = Новый Структура("Номер", Объект.Номер);
		СообщенияПользователямКлиентСервер.СоздатьСообщение(Справочники.ШаблоныПисем.ДоработкаКВ,
						Объект.Ответственный, Контекст);
		
	ИначеЕсли Действие = "Отклонить" Тогда
		
		Объект.Отклонена = Истина;
		ЗадачаОбъект.Записать();
		ЗадачаОбъект.ВыполнитьЗадачу();
		УстановитьСтатусЗаявки(ПредопределенноеЗначение("Справочник.СтатусыЗаявок.Отклонена"));
		Резолюция = Перечисления.РезультатВыполненияЗадачиСогласования.Отклонено;
		
	КонецЕсли;	
	
	ЗаполнитьРезолюцию(ЗадачаИсполнителя, Резолюция);
	
	Если ДанныеДляСогласования.СогласовыватьВедущую Тогда
		
		ВЗадача = ДанныеДляСогласования.ГоловнаяЗадача.ПолучитьОбъект();
		ВЗадача.ОтправленоНаДоработку = ЗадачаОбъект.ОтправленоНаДоработку;
		ВЗадача.Согласована = ЗадачаОбъект.Согласована;
		ВЗадача.Записать();
		ВЗадача.ВыполнитьЗадачу();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезолюцию(ЗадачаИсполнителя, Резолюция)
	
	 Отбор = Новый Структура("ЗадачаПользователю", ЗадачаИсполнителя);
	 СтрокиСогласования = Объект.СогласующиеЛица.НайтиСтроки(Отбор);
	 
	 Для каждого СтрокаСогласования Из СтрокиСогласования Цикл
	 
	 	 СтрокаСогласования.Резолюция = Резолюция;
	 
	 КонецЦикла;
	 
	 Записать();
	 
КонецПроцедуры	

&НаСервере
Процедура УстановитьСтатусЗаявки(Статус)

	РегистрыСведений.СостояниеЗаявокНаИзменениеАД.УстановитьСтатус(Объект.Ссылка, Статус);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляСогласования()
	
	СтрокиСогласования = Объект.СогласующиеЛица.НайтиСтроки(Новый Структура("ЗадачаПользователю", ЗадачаИсполнителя));	
	
	Если СтрокиСогласования.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЗадачаИсполнителя", ЗадачаИсполнителя);
	Результат.Вставить("ГоловнаяЗадача", СтрокиСогласования[0].ВедущаяЗадачаПроцесса);
	
	Роль = СтрокиСогласования[0].Роль;
	СтрокиПоРолям = Объект.СогласующиеЛица.НайтиСтроки(Новый Структура("Роль", Роль));
	
	СогласовыватьВедущую = Истина;
	
	Для каждого СтрокаПоРоли Из СтрокиПоРолям Цикл
	
		Если СтрокаПоРоли.ЗадачаПользователю = ЗадачаИсполнителя Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если НЕ СтрокаПоРоли.ЗадачаПользователю.Выполнена Тогда
			
			СогласовыватьВедущую = Ложь;
			
		КонецЕсли;	
	
	КонецЦикла;
	
	Результат.Вставить("СогласовыватьВедущую", СогласовыватьВедущую);
	
	Возврат Результат;
	
КонецФункции	

&НаСервере
Процедура ОбновлениеВидимостиПоСогласующему()
	
КонецПроцедуры

#КонецОбласти
