#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедуры
// Первая версия модуля 29.08.2024

Процедура СформироватьИзменитьЭлементСправочника(Знач ИсходныеДанные) Экспорт
	
	Если Не ИсходныеДанные.Свойство("UUID") Тогда
		
		Комментарий = "Для справочника не заполнен обязательный реквизит ГУИД";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Пользователи систем", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		
		Возврат;
		
	КонецЕсли;	
		
	СсылкаНаОбъект = XMLЗначение(Тип("СправочникСсылка.AMS_ПользователиСистем"), ИсходныеДанные.UUID); 
	
	ПользователиСистемОбъект				  = СсылкаНаОбъект.ПолучитьОбъект(); 
	
	Если ПользователиСистемОбъект = Неопределено Тогда 
		
		ПользователиСистемОбъект = Справочники.AMS_ПользователиСистем.СоздатьЭлемент();
		ПользователиСистемОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
		ПользователиСистемОбъект.Заполнить(ИсходныеДанные);
		
	Иначе
		
		ПользователиСистемОбъект.Заполнить(ИсходныеДанные);
		
	КонецЕсли;
	
	Попытка 
		
		ПользователиСистемОбъект.Записать();
		
		Комментарий = СтрШаблон("Успешно записан пользователь систем с УИД %1", ИсходныеДанные.УИД);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Пользователи систем", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_ПользователиСистем, ПользователиСистемОбъект.Ссылка, Комментарий);
			
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Пользователи систем", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_ПользователиСистем, ПользователиСистемОбъект.Ссылка, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры  

Функция ИнициализироватьСтруктуруЗаполнения() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("UUID");
	Результат.Вставить("Наименование");
	Результат.Вставить("Активен");
	Результат.Вставить("НаименованиеПолное");
	Результат.Вставить("Логин");
	Результат.Вставить("Роль");
	Результат.Вставить("НомерТелефонаПодтвержден");
	Результат.Вставить("АутентификацияПоСМС");
	Результат.Вставить("АутентификацияВПриложении");
	Результат.Вставить("ДоступенПросмотрРеестровКВ");
	Результат.Вставить("ДоступноПодписаниеРеестровКВ");
	Результат.Вставить("НомерТелефона");
	Результат.Вставить("АдресЭлектроннойПочты");
    Результат.Вставить("Продавец");
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#КонецЕсли