#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ГУИД = "";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		 ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		 
		 ВидКИТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонПользователяСистем;
		 ВидКИПочта	  = Справочники.ВидыКонтактнойИнформации.EmailПользователяСистем;
		 
		 ЗаполнитьКИПоВиду(ВидКИТелефон, ДанныеЗаполнения.НомерТелефона);
		 ЗаполнитьКИПоВиду(ВидКИПочта, ДанныеЗаполнения.АдресЭлектроннойПочты);
		
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКИПоВиду(Вид, Значение)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтрокиКИ = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Вид));
	Если СтрокиКИ.Количество() = 0 Тогда
		
		СтрокаКИ = КонтактнаяИнформация.Добавить();
		СтрокаКИ.Вид = Вид;
		СтрокаКИ.Тип = Вид.Тип;
		
	Иначе
		
		СтрокаКИ = СтрокиКИ[0];
		
	КонецЕсли;
	
	СтрокаКИ.Представление = Значение;
		
КонецПроцедуры	

#КонецОбласти