#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфей

Процедура СрокДействияПриростаОбновлениеПредопределенных() Экспорт;
	
	ИдентификаторыНаименование			 = ИдентификаторыПредопределенногоЭлементаНаименование();
	
	Для каждого КлючЗначение Из ИдентификаторыНаименование Цикл
		
		ПараметрыОбъект						 = КлючЗначение.Ключ.ПолучитьОбъект();
		ПараметрыОбъект.ВСистемеМастерАМС	 = КлючЗначение.Значение;
		ПараметрыОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыПредопределенногоЭлементаНаименование()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.СрокДействияПрироста.Недельный,					"WEEKLY");
	Результат.Вставить(Справочники.СрокДействияПрироста.Месячный,					"MONTHLY");
	Результат.Вставить(Справочники.СрокДействияПрироста.КвартальныйРасчетный,		"QUARTERLY");
	Результат.Вставить(Справочники.СрокДействияПрироста.КвартальныйКалендарный	,	"MONTHLY_CALENDAR_FULL");
	Результат.Вставить(Справочники.СрокДействияПрироста.МесячныйКалендарный,		"QUARTERLY_CALENDAR_FULL");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли