#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДоговор();
	ЗаполнитьВознаграждения();
	ЗаполнитьУслуги();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ПричинаВнесенияИзменений.Видимость = ДополнительноеСоглашение;
	Элементы.ДатаДосрочногоРасторжения.Видимость = ДополнительноеСоглашение;
	Элементы.ПричинаРасторжения.Видимость = ДополнительноеСоглашение;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
Процедура ЗаполнитьДоговор()
	
	ВыборкаДокумент = Справочники.ДоговорИКУ.ДанныеДокумента(Объект.Ссылка);
	
	Пока ВыборкаДокумент.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ВыборкаДокумент);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВознаграждения()
	
	ВыборкаВознаграждение = Справочники.ДоговорИКУ.ДанныеДокументаВознаграждения(Объект.Ссылка);
	
	Пока ВыборкаВознаграждение.Следующий() Цикл
		Вознаграждение = УсловияВознаграждения.Добавить();
		ЗаполнитьЗначенияСвойств(Вознаграждение, ВыборкаВознаграждение);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслуги()

	ВыборкаУслуги = Справочники.ДоговорИКУ.ДанныеДокументаУслуги(Объект.Ссылка);
	
	Пока ВыборкаУслуги.Следующий() Цикл
		Услуга = ПереченьУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(Услуга, ВыборкаУслуги);
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти

