#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт
	
	Результат = Новый Массив;
	
	ЗаполнитьДанныеПродукта(ОбъектСсылка, Результат);
	
	Возврат Результат;
	
КонецФункции

#Область СообщениеДляМАМС

Функция ПолучитьСтруктуруСообщенияПродукты()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "ProductMapping");
	Результат.Вставить("guid");
	Результат.Вставить("productGuid");
	Результат.Вставить("name");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеПродукта(ОбъектСсылка, Результат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеСтраховыхПродуктов.НаименованиеПродукта КАК name,
		|	СоответствиеСтраховыхПродуктов.Идентификатор КАК guid,
		|	СоответствиеСтраховыхПродуктов.СтраховойПродукт.ГУИД КАК productGuid
		|ИЗ
		|	РегистрСведений.СоответствиеСтраховыхПродуктов КАК СоответствиеСтраховыхПродуктов
		|ГДЕ
		|	СоответствиеСтраховыхПродуктов.СтраховойПродукт = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Продукты = ПолучитьСтруктуруСообщенияПродукты();
	ЗаполнитьЗначенияСвойств(Продукты, Выборка);

	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Продукты, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	Результат.Добавить(Данные);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
