#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БазаДанных   = Константы.ВитринаБазаДанных.Получить();
	СерверСУБД   = Константы.ВитринаСерверСУБД.Получить();
	Логин 		 = Константы.ВитринаПользователь.Получить();
	Пароль		 = Константы.ВитринаПароль.Получить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	СохранитьДанныеНаСервере(СерверСУБД, БазаДанных, Логин, Пароль);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СохранитьДанныеНаСервере(СерверСУБД, БазаДанных, Логин, Пароль)

	Константы.ВитринаБазаДанных.Установить(БазаДанных);
	Константы.ВитринаСерверСУБД.Установить(СерверСУБД);
	Константы.ВитринаПользователь.Установить(Логин);
	Константы.ВитринаПароль.Установить(Пароль);

КонецПроцедуры


#КонецОбласти