#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииИсточниковДанныхПечати
Процедура ПриОпределенииИсточниковДанныхПечати(Объект, ИсточникиДанныхПечати) Экспорт
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
				
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//  Параметры                  - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ОтзывСогласияНаОбработкуПерсональныхДанных.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
//  Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.AMS_ИзмененияДанныхПродавцов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
// Совмещаем интерфейс
Процедура СформироватьИзменитьЭлементСправочника(ОписаниеОбъектов) Экспорт

	СозданиеИзменениеДокумента(ОписаниеОбъектов);
	
КонецПроцедуры	

Процедура СозданиеИзменениеДокумента(ВнешниеДанные) Экспорт
	
	Организация = Константы.AMS_ОрганизацияПоУмолчанию.Получить();
	МетаданныеДокумента = Метаданные.Документы.AMS_ИзменениеУсловийАгентскогоДоговора;
	
	СменаКуратора = Перечисления.AMS_ОснованияИзмененияАД.СменаКуратора;
	ИзменениеПродавца = Перечисления.AMS_ОснованияИзмененияАД.ДобавлениеПродавца;
	
	ОшибкаЖР = УровеньЖурналаРегистрации.Ошибка;
	ИнфЖР = УровеньЖурналаРегистрации.Информация;
	
	Для Каждого Данные Из ВнешниеДанные Цикл
		
		Если Не Данные.Свойство("ДопСоглашение") Тогда
			
			ТекстСообщения = "Не задан обязательный реквизит ""ДопСоглашение""";
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка документа Изменение Условий Агентского Договора", ОшибкаЖР, МетаданныеДокумента, , ТекстСообщения);
			
			Продолжить;
			
		КонецЕсли; 
		
		СтруктураШапки = ПодготовитьСтруктурШапкиДокумента(Данные, Организация);
		
		Если СтруктураШапки.ВидОперации = СменаКуратора
			или СтруктураШапки.ВидОперации = ИзменениеПродавца Тогда 
			
			Документы.AMS_ИзмененияДанныхПродавцов.СоздатьДокументИзменениеДанныхПродавцов(СтруктураШапки, Данные.Продавцы); 
			
			Продолжить;
			
		КонецЕсли;	
		
		ДокументСсылка = Документы.AMS_ИзменениеУсловийАгентскогоДоговора.НайтиПоРеквизиту("ГУИДЦССУ", Данные.ДопСоглашение);
		
		Если ДокументСсылка.Пустая() Тогда
			
			ДокументОбъект = Документы.AMS_ИзменениеУсловийАгентскогоДоговора.СоздатьДокумент();
			
		Иначе
			
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
						
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Данные);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураШапки);
		
		ДокументОбъект.Организация = Организация;
		
		ДозаполнитьДанные(ДокументОбъект, Данные); 
		
		Попытка 
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка документа Изменение Условий Агентского Договора", ИнфЖР, МетаданныеДокумента, ДокументОбъект.Ссылка, "Документ проведен " + Данные.ДопСоглашение);
			
		Исключение
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка документа Изменение Условий Агентского Договора", ОшибкаЖР, МетаданныеДокумента, ДокументОбъект.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;	
		
КонецПроцедуры

Процедура ДозаполнитьДанные(ДокументОбъект, Данные) 
	
	Для Каждого СтрокаУсловиеДоговора Из Данные.УсловияДоговора Цикл
		
		НоваяСтрока = ДокументОбъект.УсловияДоговора.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУсловиеДоговора);
		
		НоваяСтрока.СтраховойПродукт = ЭлементСправочникаПоЦССУ("AMS_СтраховыеПродукты", СтрокаУсловиеДоговора.СтраховойПродукт);
		НоваяСтрока.Риск 			 = ЭлементСправочникаПоЦССУ("AMS_СтраховыеРиски", СтрокаУсловиеДоговора.Риск);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПодготовитьСтруктурШапкиДокумента(Данные, Организация)
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("ВидОперации");
	
	Если Не Данные.ПричинаВнесенияИзменений = "" Тогда
		СтруктураВозврата.ВидОперации = Перечисления.AMS_ОснованияИзмененияАД[СтрЗаменить(Данные.ПричинаВнесенияИзменений, " ", "")];
	КонецЕсли;
	
	СтруктураВозврата.Вставить("Организация", Организация); 

	СтруктураВозврата.Вставить("ДатаПодписанияАгентом", Данные.ДатаНачалаДействия);
	СтруктураВозврата.Вставить("ДатаВступленияВСилу", Данные.Дата);
	
	СтруктураВозврата.Вставить("АгентскийДоговор", ЭлементСправочникаПоЦССУ("AMS_АгентскиеДоговоры", Данные.АгентскийДоговор));
	СтруктураВозврата.Вставить("ДопСоглашение", Данные.ДопСоглашение);
	СтруктураВозврата.Вставить("Агент", ЭлементСправочникаПоЦССУ("AMS_Агенты", Данные.Агент));
	
	СтруктураВозврата.Вставить("Филиал", ЭлементСправочникаПоЦССУ("AMS_Филиалы",Данные.Филиал));
	
	СтруктураВозврата.Вставить("Подразделение", ЭлементСправочникаПоЦССУ("AMS_Подразделения", Данные.Подразделение));
	СтруктураВозврата.Вставить("ПериодичностьВыплатыКВ", ПолучитьПериодичностьВыплат(Данные.ПериодичностьВыплатыКВ));
	
	СтруктураВозврата.Вставить("КатегорияАгента", Перечисления.AMS_КатегорииПродавца[Данные.КатегорияАгента]);		
	СтруктураВозврата.Вставить("КатегорияАгентаДляПоказателейКачества", ЭлементСправочникаПоЦССУ("AMS_КатегорияАгентовДляПоказателейКачества", Данные.КатегорияАгентаДляKPI));
	
	СтруктураВозврата.Вставить("ТипАгента", Перечисления.AMS_ТипыАгентовПоСпособуПродаж[Данные.ТипАгента]);
	СтруктураВозврата.Вставить("ГУИДЦССУ", Данные.ДопСоглашение);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьПериодичностьВыплат(Периодичность)
	
	Данные = Новый Соответствие;
	Данные.Вставить("ОдинРазВНеделю", Перечисления.AMS_РасписаниеВыплатыКВ.Еженедельно);
	Данные.Вставить("ОдинРазВМесяц", Перечисления.AMS_РасписаниеВыплатыКВ.Ежемесячно);
	Данные.Вставить("ОдинРазВДвеНедели", Перечисления.AMS_РасписаниеВыплатыКВ.РазВДвеНедели);
	
	Возврат Данные.Получить(Периодичность);
	
КонецФункции	

#КонецОбласти

#КонецЕсли