#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
		
	Если Не ЗначениеЗаполнено(ГУИД) Тогда
		ГУИД = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)  
	
	Движения.AMS_УсловияДоговораАгента.Записывать = Истина;
	Движение = Движения.AMS_УсловияДоговораАгента.Добавить();
	
	Движение.Период = ДатаВступленияВСилу;
	Движение.Агент = Агент;
	Движение.АгентскийДоговор = АгентскийДоговор;
	Движение.Организация = Организация;
	Движение.Филиал = Филиал;
	
	Движение.КатегорияКонтрагента = КатегорияАгента;
	Движение.ПериодичностьВыплатыКВ = ПериодичностьВыплатыКВ;
	Движение.МегаБрокер = МегаБрокер;
	Движение.ТиповойДоговор = ТиповойДоговор;
	Движение.ФедеральныйАгентскийДоговор = ФедеральныйАгентскийДоговор;
	Движение.УдержаниеКомиссии = УдержаниеКомиссии;
	Движение.НеУдерживаетПВ = НеУдерживаетПВ;
	Движение.ПВПоДопСоглашениям = ПВПоДопСоглашениям;
	Движение.СрокОплатыОА = СрокОплатыОА;
	Движение.КоличествоДнейОборотаБСООСАГО = КоличествоДнейОборотаБСООСАГО;
	Движение.КоличествоДнейОборотаБСОПрочие = КоличествоДнейОборотаБСОПрочие;
	Движение.ДатаПодписания = ДатаПодписанияАгентом;
	Движение.ОбязательноДополнительноеСоглашение = ОбязательноДополнительноеСоглашение;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ГУИД = "";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаИзменениеАД") Тогда
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли


