
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ПодготовкаФормы();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ВидимостьЭлементовБлокировки();
	ОбновитьВидимостьДатыВыплаты();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
		МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьТЧПродавцыНаСервере();
	
	ПодготовкаФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) 
	
	Если ИмяСобытия = "AMS_ОбновленаИнформацияОПродавцах" Тогда
		ЗаполнитьТЧПродавцыНаСервере();
	КонецЕсли;
	
	Если ИмяСобытия = "AMS_ИзменениеДействияДоговора" Тогда
		ИзменениеСостоянияДоговораНаСервере(Параметр);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура БлокировкаАГДПриИзменении(Элемент)
	ВидимостьЭлементовБлокировки();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Объект.БлокировкаАГД Тогда
		Объект.ДатаОкончанияДействияБлокировки = '00010101';
		Объект.ДатаОкончанияДействияБлокировки = '00010101';
		Объект.Комментарий = "";
	КонецЕсли;
	
	ВидимыеПоля = СоответствиеПолей(Объект.ПериодичностьВыплатыКВ);
	ИменаПолей = ПоляДатыВыплаты();

	Для Каждого ИмяПоля Из ИменаПолей Цикл
		
		Если ВидимыеПоля.Найти(ИмяПоля) = Неопределено Тогда
			Объект[ИмяПоля] = "";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ИмяПоля]) 
			И Элементы[ИмяПоля].Видимость Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена дата выплаты",,,"Объект." + ИмяПоля, Истина);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьВыплатыКВПриИзменении(Элемент)
	
	ОбновитьВидимостьДатыВыплаты();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегистрационныйНомерПриИзменении(Элемент)
	
	Объект.Наименование = СтрШаблон("Договор № %1", Объект.РегистрационныйНомер); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДействияПриИзменении(Элемент)
	
	Если Объект.ДатаОкончанияДействия <= Объект.ДатаНачалаДействия Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата окончания действия не может быть меньше или равна дате начала действия", Объект.Ссылка, "ДатаОкончанияДействия", "Объект.ДатаОкончанияДействия");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаПодписанияАгентомПриИзменении(Элемент)
	
	Если Объект.ДатаПодписанияАгентом < Объект.ДатаНачалаДействия Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата подписания агентом не может быть меньше даты начала действия", Объект.Ссылка, "ДатаПодписанияАгентом", "Объект.ДатаПодписанияАгентом");
	КонецЕсли;
	
	Если Объект.ДатаПодписанияАгентом >= Объект.ДатаОкончанияДействия Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата подписания агентом не может быть больше даты окончания действия", Объект.Ссылка, "ДатаПодписанияАгентом", "Объект.ДатаПодписанияАгентом");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
	//	
	//	Филиал = ПолучитьЗначениеРеквизиты(ВыбранноеЗначение, "Владелец");
	//	
	//КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура АгентОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И
		ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_Агенты") Тогда
		
		РеквизитыОбъекта = ПолучитьЗначениеРеквизитов(ВыбранноеЗначение, "ТабельныйНомер, ТипАгента");
		Объект.ТабельныйНомерАгента = РеквизитыОбъекта.ТабельныйНомер;
		Объект.ТипАгента = РеквизитыОбъекта.ТипАгента; 
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ДобавитьПродавца(Команда) 
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать агентский договор");
		Возврат;
	КонецЕсли;	
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменениеДанныхПоПродавцамПродолжение", ЭтаФорма);
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.AMS_ВидИзмененияОперацииОПродавце.ДобавлениеПродавцов"));
	
	ДополнитьСтруктуруЗаполнения("ДобавлениеПродавца", СтруктураЗаполнения);
	
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
	
	ОткрытьФорму("Документ.AMS_ИзмененияДанныхПродавцов.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма,,,, ОповещениеОЗакрытии);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПродавца(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать агентский договор");
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменениеДанныхПоПродавцамПродолжение", ЭтаФорма);
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.AMS_ВидИзмененияОперацииОПродавце.ИзменениеИнформации"));
	
	ДополнитьСтруктуруЗаполнения("ИзменениеИнформации", СтруктураЗаполнения);
	
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
	
	ОткрытьФорму("Документ.AMS_ИзмененияДанныхПродавцов.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма,,,, ОповещениеОЗакрытии); 
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьКуратора(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать агентский договор");
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменениеДанныхПоПродавцамПродолжение", ЭтаФорма);
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.AMS_ВидИзмененияОперацииОПродавце.СменаКуратора"));
	
	ДополнитьСтруктуруЗаполнения("СменаКуратора", СтруктураЗаполнения);
	
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
	
	ОткрытьФорму("Документ.AMS_ИзмененияДанныхПродавцов.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьДоговор(Команда)
	
	АктивироватьДоговорНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура АктивироватьДоговорНаСервере() 
	
	Объект.Статус = Перечисления.AMS_СтатусыАД.Действует;
	
	ПодготовкаФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВозобновлениеДействия(Команда)  
	
	ПараметрыФормы = Новый Структура("ТипОперации", "ВозобновлениеДействия"); 
	
	ОткрытьФорму("Справочник.AMS_АгентскиеДоговоры.Форма.ФормаИзменениеДействияДоговора", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриостановкаДействия(Команда)
	
	ПараметрыФормы = Новый Структура("ТипОперации", "ПриостановкаДействия"); 
	
	ОткрытьФорму("Справочник.AMS_АгентскиеДоговоры.Форма.ФормаИзменениеДействияДоговора", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовкаФормы()
	
	ЭтоАктивныйДоговор = Объект.Статус = Перечисления.AMS_СтатусыАД.Действует;
	ЭтоПроект = Объект.Статус = Перечисления.AMS_СтатусыАД.Проект;
	
	Если ЭтоПроект Тогда 
		
		Элементы.ФормаАктивироватьДоговор.Видимость = Истина;
		Элементы.ФормаПриостановкаДействия.Видимость = Ложь;
		Элементы.ФормаВозобновлениеДействия.Видимость = Ложь;
		
	Иначе
		
		Элементы.ФормаАктивироватьДоговор.Видимость = Ложь;
		Элементы.ФормаПриостановкаДействия.Видимость = ЭтоАктивныйДоговор;
		Элементы.ФормаВозобновлениеДействия.Видимость = Не ЭтоАктивныйДоговор;
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
Процедура ДополнитьСтруктуруЗаполнения(ИмяОперации, СтруктураЗаполнения)
	
	Если Не ТипЗнч(СтруктураЗаполнения) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения.Вставить("Агент", Объект.Владелец);
	СтруктураЗаполнения.Вставить("АгентскийДоговор", Объект.Ссылка);
	СтруктураЗаполнения.Вставить("Организация", Объект.Организация);
	СтруктураЗаполнения.Вставить("Филиал", Филиал);
	СтруктураЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	
	Если Не ИмяОперации = "ДобавлениеПродавца" Тогда
		
		СтруктураЗаполнения.Вставить("Продавцы", ЗаполнитьМассивПродавцов());
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьМассивПродавцов()
	
	МассивПродавцов =  Новый Массив;
	
	Для Каждого Строка Из Элементы.Продавцы.ВыделенныеСтроки Цикл
		
		СтруктураСтроки = Новый Структура("Продавец, Уволен, Куратор, ВидТерритории, КаналПродаж, ПодканалПродаж, ФункциональнаяПринадлежность");
		
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Продавцы.НайтиПоИдентификатору(Строка));
		
		МассивПродавцов.Добавить(СтруктураСтроки);
		
	КонецЦикла;	
	
	Возврат МассивПродавцов;
	
КонецФункции

&НаКлиенте
Процедура ИзменениеДанныхПоПродавцамПродолжение(Параметры, ДопПараметры) Экспорт
	
	ЗаполнитьТЧПродавцыНаСервере();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТЧПродавцыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AMS_ИнформацияОПродавцеСрезПоследних.Продавец КАК Продавец,
	|	AMS_ИнформацияОПродавцеСрезПоследних.Уволен КАК Уволен,
	|	AMS_ИнформацияОПродавцеСрезПоследних.Куратор КАК Куратор,
	|	AMS_ИнформацияОПродавцеСрезПоследних.ВидТерритории КАК ВидТерритории,
	|	AMS_ИнформацияОПродавцеСрезПоследних.КаналПродаж КАК КаналПродаж,
	|	AMS_ИнформацияОПродавцеСрезПоследних.ПодканалПродаж КАК ПодканалПродаж,
	|	AMS_ИнформацияОПродавцеСрезПоследних.ФункциональнаяПринадлежность КАК ФункциональнаяПринадлежность
	|ИЗ
	|	РегистрСведений.AMS_ИнформацияОПродавце.СрезПоследних(&ДатаСреза, АгентскийДоговор = &АгентскийДоговор) КАК AMS_ИнформацияОПродавцеСрезПоследних";
	
	Запрос.УстановитьПараметр("АгентскийДоговор", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДатаСеанса());
	
	Результат = запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Продавцы.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Продавцы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСостоянияДоговораНаСервере(Параметр)
	
	Если Параметр.Свойство("Статус") И Параметр.Статус.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметр.ТипОперации = "ВозобновлениеДействия" Тогда 
		
		Объект.ДатаПрекращенияДействия = Дата(1,1,1);
		Объект.ПричинаРасторжения = "";
		Статус = Перечисления.AMS_СтатусыАД.Действует;
		
	КонецЕсли;	
	
	Если Параметр.ТипОперации = "ПриостановкаДействия" Тогда 
		
		Объект.ДатаПрекращенияДействия = Параметр.Дата;
		Объект.ПричинаРасторжения = Параметр;
		Статус = Параметр.Статус; 
		
	КонецЕсли;
	
	Объект.Статус = Статус; 
	
	ПодготовкаФормы();
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизиты(Ссылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитов(Ссылка, ИменаРеквизитов)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКВНаСервере()
	
	Отбор = ДанныеКВСервер.ИнициализироватьСтруктуруОтбора();
	Отбор.Агент = Объект.Владелец;
	ТаблицаКВДанные = ДанныеКВСервер.ПолучитьТаблицуБазовогоКВИндивидуального(Отбор);
	
	Если Элементы.Найти("ТаблицаКВ") <> Неопределено Тогда
		
		УдаляемыеРеквизиты = Новый Массив;
		УдаляемыеРеквизиты.Добавить("ТаблицаКВ");
		ИзменитьРеквизиты(, УдаляемыеРеквизиты);	
		Элементы.Удалить(Элементы["ТаблицаКВ"]);
		
	КонецЕсли;
	
	РеквизитыФормы = Новый Массив;
	РеквизитыФормы.Добавить(Новый РеквизитФормы("ТаблицаКВ", Новый ОписаниеТипов("ТаблицаЗначений")));
	Для каждого Колонка Из ТаблицаКВДанные.Колонки Цикл
	
		РеквизитыФормы.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаКВ"));
	
	КонецЦикла;
	ИзменитьРеквизиты(РеквизитыФормы);
				
	Таблица = Элементы.Добавить("ТаблицаКВ", Тип("ТаблицаФормы"), Элементы.РазмерыБазовогоКВ);
	Таблица.ПутьКДанным = "ТаблицаКВ";
	Таблица.УстановитьДействие("Выбор", "ПоказатьРасшифровкуКВ");
	
	
	Для каждого Колонка Из ТаблицаКВДанные.Колонки Цикл
	
		Реквизит = Элементы.Добавить("Колонка" + Колонка.Имя, Тип("ПолеФормы"), Таблица);;
	    Реквизит.Вид = ВидПоляФормы.ПолеНадписи;
		Реквизит.ПутьКДанным = "ТаблицаКВ." + Колонка.Имя;
		Реквизит.Заголовок   = Колонка.Имя;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаКВДанные, "ТаблицаКВ");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасшифровкуКВ()
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКВ(Команда)
	
	ЗаполнитьКВНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПериодМотивационнойПрограммы(МотивационнаяПрограмма, Агент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммамСрезПоследних.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ВЫБОР
		|		КОГДА AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммамСрезПоследних.ДатаИсключения <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммамСрезПоследних.ДатаИсключения
		|	КОНЕЦ КАК ДатаОкончанияДействия
		|ИЗ
		|	РегистрСведений.AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.СрезПоследних КАК AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммамСрезПоследних
		|ГДЕ
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммамСрезПоследних.МотивационнаяПрограмма = &МотивационнаяПрограмма
		|	И AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммамСрезПоследних.Агент = &Агент";
	
	Запрос.УстановитьПараметр("Агент", Агент);
	Запрос.УстановитьПараметр("АгентИсключен", Ложь);
	Запрос.УстановитьПараметр("МотивационнаяПрограмма", МотивационнаяПрограмма);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДат = Новый Структура("ДатаНачалаДействия, ДатаОкончанияДействия");
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураДат, ВыборкаДетальныеЗаписи);
		
	КонецЕсли;
	
	Возврат СтруктураДат;
	
КонецФункции

&НаКлиенте
Процедура МотивационныеПрограммыМотивационнаяПрограммаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтруктураПоиска = Новый Структура("МотивационнаяПрограмма", ВыбранноеЗначение);
	Дубль = Объект.МотивационныеПрограммы.НайтиСтроки(СтруктураПоиска);
	
	Если Дубль.Количество() = 0 Тогда
		
		Период = ПериодМотивационнойПрограммы(ВыбранноеЗначение, Объект.Владелец);
		Строка = Элементы.МотивационныеПрограммы.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(Строка, Период);
		
	Иначе
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовБлокировки()
	Элементы.ДатаНачалаДействияБлокировки.Видимость		 = Объект.БлокировкаАГД;
	Элементы.ДатаОкончанияДействияБлокировки.Видимость	 = Объект.БлокировкаАГД;
	Элементы.Комментарий.Видимость						 = Объект.БлокировкаАГД;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДатыВыплаты()

	ВидимыеПоля = СоответствиеПолей(Объект.ПериодичностьВыплатыКВ);
	ИменаПолей = ПоляДатыВыплаты();
	
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ЭлементДаты = Элементы[ИмяПоля];
		ЭлементДаты.Видимость = ВидимыеПоля.Найти(ИмяПоля) <> Неопределено;
		ЭлементДаты.АвтоОтметкаНезаполненного = ЭлементДаты.Видимость;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ПоляДатыВыплаты()

	Результат = Новый Массив;
	
	Результат.Добавить("ДатаВыплаты1");
	Результат.Добавить("ДатаВыплаты2");
	Результат.Добавить("ДатаВыплаты3");
	Результат.Добавить("ДатаВыплаты4");
	
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция СоответствиеПолей(ПереодичностьВыплатыКВ)
	
	ИменаПолей = Новый Соответствие;
	
	ИменаПолей.Вставить(Перечисления.AMS_РасписаниеВыплатыКВ.Ежемесячно, "ДатаВыплаты1");
	ИменаПолей.Вставить(Перечисления.AMS_РасписаниеВыплатыКВ.Ежеквартально, "ДатаВыплаты1");
	ИменаПолей.Вставить(Перечисления.AMS_РасписаниеВыплатыКВ.РазВДвеНедели, "ДатаВыплаты1, ДатаВыплаты2");
	ИменаПолей.Вставить(Перечисления.AMS_РасписаниеВыплатыКВ.ДваРазаВМесяц, "ДатаВыплаты1, ДатаВыплаты2");
	ИменаПолей.Вставить(Перечисления.AMS_РасписаниеВыплатыКВ.Еженедельно, "ДатаВыплаты1, ДатаВыплаты2, ДатаВыплаты3, ДатаВыплаты4");

	ИменаВидимыхПолей = ИменаПолей.Получить(ПереодичностьВыплатыКВ);
	
	Если ИменаВидимыхПолей = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат СтрРазделить(ИменаВидимыхПолей, ", ", Ложь);

КонецФункции

#КонецОбласти


