#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс  

Процедура СформироватьИзменитьЭлементСправочника(ОписаниеОбъектов) Экспорт
	
	Если ОписаниеОбъектов.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого Объект Из ОписаниеОбъектов Цикл
		
		Если ЗначениеЗаполнено(Объект.МаксимальныйПроцентКомиссии) Тогда	
			ДобавитьЗаписьВРегистр(Справочники.AMS_ВидыВознаграждений.ПустаяСсылка(), 
									Объект.МаксимальныйПроцентКомиссии, Объект);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.МаксимальныйПроцентБазКВ) Тогда
			
			ДобавитьЗаписьВРегистр(Справочники.AMS_ВидыВознаграждений.БКВ, 
									Объект.МаксимальныйПроцентБазКВ, Объект);
			
		КонецЕсли;							
		
		Если ЗначениеЗаполнено(Объект.МаксимальныйПроцентДопКВ) Тогда
			
			ДобавитьЗаписьВРегистр(Справочники.AMS_ВидыВознаграждений.ДКВ, 
									Объект.МаксимальныйПроцентДопКВ, Объект);
			
		КонецЕсли;	
		
	КонецЦикла;
	
		
КонецПроцедуры	

Процедура ДобавитьЗаписьВРегистр(ВидВознаграждения, МаксимальныПроцент, ОписаниеОбъектов)

	Менеджер = РегистрыСведений.AMS_ОграниченияВознагражденийПоПродукту.СоздатьМенеджерЗаписи();
	Если ОписаниеОбъектов.Свойство("Дата") Тогда
		Менеджер.Период = ОписаниеОбъектов.Дата;
	Иначе
		Менеджер.Период = ТекущаяДатаСеанса();
	КонецЕсли;	
	Менеджер.СтраховойПродукт = ЭлементСправочникаПоЦССУ("AMS_СтраховыеПродукты", ОписаниеОбъектов.СтраховойПродукт);
	Менеджер.СтраховойРиск 	  = ЭлементСправочникаПоЦССУ("AMS_СтраховыеРиски", ОписаниеОбъектов.СтраховойРиск);
	Менеджер.ВидВознаграждения = ВидВознаграждения;
	Менеджер.БазовыйПроцент 	= ОписаниеОбъектов.БазовыйПроцентКомиссии;
	Менеджер.МаксимальныПроцент = МаксимальныПроцент;
	Менеджер.МаксимальноеВознаграждение = 0;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры	

Функция ПроверитьОграниченияМаксимальногоКВ(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(AMS_ОграниченияВознагражденийПоПродуктуСрезПоследних.МаксимальныПроцент) КАК МаксимальныПроцент,
		|	МИНИМУМ(AMS_ОграниченияВознагражденийПоПродуктуСрезПоследних.МаксимальноеВознаграждение) КАК МаксимальноеВознаграждение
		|ИЗ
		|	РегистрСведений.AMS_ОграниченияВознагражденийПоПродукту.СрезПоследних(&Дата, СтраховойПродукт = &СтраховойПродукт) КАК AMS_ОграниченияВознагражденийПоПродуктуСрезПоследних
		|ГДЕ
		|	AMS_ОграниченияВознагражденийПоПродуктуСрезПоследних.ВидВознаграждения = ЗНАЧЕНИЕ(Справочник.AMS_ВидыВознаграждений.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Дата", Параметры.Период);
	Запрос.УстановитьПараметр("СтраховойПродукт", Параметры.СтраховойПродукт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КонтролируемоеЗначение = 0;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МаксимальныПроцент) Тогда
			КонтролируемоеЗначение = ВыборкаДетальныеЗаписи.МаксимальныПроцент;
		КонецЕсли;	
	КонецЕсли;
	
	Результат = КонтролируемоеЗначение >= Параметры.РазмерПремии;
	Возврат Результат;

КонецФункции	

Функция ПараметрыПроверкиОграничений() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СтраховойПродукт");
	Результат.Вставить("Период");
	Результат.Вставить("РазмерПремии");
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
	
	
#КонецОбласти

#КонецЕсли