#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ОпределитьИсполнителяНаМаршруте(ОбъектСогласования, ТочкаМаршрута) Экспорт
	
	Результат = Неопределено;
	
	Результат = ПолучитьОтветственноеЛицоПоПроцессуУтверждения(ОбъектСогласования, ТочкаМаршрута);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОтветственноеЛицоПоПроцессуУтверждения(ОбъектСогласования, ТочкаМаршрута)

	Если ТочкаМаршрута = БизнесПроцессы.УтверждениеУсловийВознаграждения.ТочкиМаршрута.СогласованиеАндеррайтером Тогда
		
		 Результат = ПолучитьАндеррайтера(ОбъектСогласования);
		 
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.УтверждениеУсловийВознаграждения.ТочкиМаршрута.СогласованиеДиректоромФилиала Тогда
		 
		 Результат = ПолучитьДиректораФилиала(ОбъектСогласования);
		 
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.УтверждениеУсловийВознаграждения.ТочкиМаршрута.СогласованиеКураторомКаналаПродаж Тогда
		 
		 Результат = ПолучитьККК(ОбъектСогласования);
		 
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.УтверждениеУсловийВознаграждения.ТочкиМаршрута.СогласованиеРуководителемРегиональнойДирекции Тогда
		 
		 Результат = ПолучитьРРД(ОбъектСогласования);
		 
	Иначе
		
		Результат = Справочники.Пользователи.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

#Область СогласованиеПоУтверждениюУсловийВознаграждения

Функция ПолучитьАндеррайтера(ОбъектСогласования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутизацияСогласованияИПодписания.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.МаршрутизацияСогласованияИПодписания КАК МаршрутизацияСогласованияИПодписания
		|ГДЕ
		|	МаршрутизацияСогласованияИПодписания.Процесс = &Процесс
		|	И ВЫБОР
		|			КОГДА &Лимит > 0
		|				ТОГДА МаршрутизацияСогласованияИПодписания.РольИсполнителя = &РольУправляющийПродуктом
		|			ИНАЧЕ МаршрутизацияСогласованияИПодписания.РольИсполнителя = &РольАндерайтер
		|		КОНЕЦ
		|	И МаршрутизацияСогласованияИПодписания.ВидСтраховогоПродукта = &ВидСтраховогоПродукта
		|	И МаршрутизацияСогласованияИПодписания.ЛимитСогласования >= &Лимит
		|	И МаршрутизацияСогласованияИПодписания.Филиал = &Филиал
		|	И МаршрутизацияСогласованияИПодписания.РегиональнаяДирекция = &РегиональнаяДирекция";
	
	// Запрос.УстановитьПараметр("ВидСтраховогоПродукта", ВидСтраховогоПродукта);
	// Запрос.УстановитьПараметр("Лимит", Лимит);
	Запрос.УстановитьПараметр("Процесс", Справочники.Процессы.СогласованиеЗаявкиОИзмененииАД);
	Запрос.УстановитьПараметр("РегиональнаяДирекция", ОбъектСогласования.Филиал.Владелец);
	Запрос.УстановитьПараметр("РольАндерайтер", Справочники.РолиСогласующихЛиц.Андеррайтер);
	Запрос.УстановитьПараметр("РольУправляющийПродуктом", Справочники.РолиСогласующихЛиц.УправляющийПродуктом);
	Запрос.УстановитьПараметр("Филиал", ОбъектСогласования.Филиал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
КонецФункции	

Функция ПолучитьДиректораФилиала(ОбъектСогласования)
	
КонецФункции

Функция ПолучитьККК(ОбъектСогласования)
	
КонецФункции

Функция ПолучитьРРД(ОбъектСогласования)
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли