
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборАгент") Тогда
		
		Отчет.ОтборАгент = Параметры.ОтборАгент;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Отчет.ОтборАгент) Тогда
		ЭлементыОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		Если ЭлементыОтбора.Количество() > 0 Тогда
			
			 ЭлементыОтбора[0].ПравоеЗначение = Отчет.ОтборАгент;
			 
		КонецЕсли;
		Настройки = Отчет.КомпоновщикНастроек.Настройки; 
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки); 
		 
		СкомпоноватьРезультат(РежимКомпоновкиРезультата.Непосредственно);
    КонецЕсли;
КонецПроцедуры
