#Область ПрограммныйИнтерфейс

// Формирует записи в регистрах актуального КВ
//
// Параметры:
//  Объект  - ДокументОбъект, ДокументСсылка - Документ 
//                 установки правил КВ
//
Процедура СформироватьЗаписиАктуальногоКВ(Объект) Экспорт
	
	СсылкаНаДокумент = Объект.Ссылка;
	ТаблицаДвижений = ПолучитьТаблицуДвижений(СсылкаНаДокумент);
		
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.AMS_ИзменениеДополнительногоКВОбщее") Тогда
		
		Набор = РегистрыСведений.AMS_АктуальныеОбщиеРазмерыДополнительногоКВПоИпотеке.СоздатьНаборЗаписей();
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.AMS_ИзменениеКВОбщее") Тогда
		
		Набор = РегистрыСведений.AMS_АктуальныеОбщиеРазмерыКВПоИпотеке.СоздатьНаборЗаписей();
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.AMS_ИзменениеДополнительногоКВИндивидуальное") Тогда
		
		Набор = РегистрыСведений.AMS_АктуальныеИндивидуальныеРазмерыДополнительногоКВПоИпотеке.СоздатьНаборЗаписей();	
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.AMS_ИзменениеКВИндивидуальное") Тогда		
		
		Набор = РегистрыСведений.AMS_АктуальныеИндивидуальныеРазмерыКВПоИпотеке.СоздатьНаборЗаписей();
		
	Иначе 
		
		Возврат;
		
	КонецЕсли;
	
	Набор.Отбор.Регистратор.Установить(Объект);
	Набор.Загрузить(ТаблицаДвижений);
	
	Попытка
		Набор.Записать(Истина);
	Исключение
		Сообщить("Не удалось записать данные по ипотеке по причине: " + ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуДвижений(СсылкаНаДокумент)
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.AMS_ИзменениеДополнительногоКВОбщее")
		ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.AMS_ИзменениеКВОбщее") Тогда
		
		Результат = СобратьДанныеОбщееКВ(СсылкаНаДокумент);
		
	Иначе
		
		Результат = СобратьДанныеИндивидуальноеКВ(СсылкаНаДокумент);
		
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция СобратьДанныеОбщееКВ(СсылкаНаДокумент)

	Результат = НовыйТаблицаОбщегоКВ();	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент,
		"Дата, Филиал, КаналПродаж, ПодканалПродаж, КатегорияПродавца");
	
	ЗаполнитьРезультат(Результат, РеквизитыДокумента, СсылкаНаДокумент);
	
	Возврат Результат;
	
КонецФункции

Функция СобратьДанныеИндивидуальноеКВ(СсылкаНаДокумент)

	Результат = НовыйТаблицаИнивидуальногоКВ();	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент,
		"Дата, Агент");
	
	ЗаполнитьРезультат(Результат, РеквизитыДокумента, СсылкаНаДокумент);	
	
	Возврат Результат;
	
КонецФункции

Функция НовыйТаблицаОбщегоКВ()

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Период");
	Результат.Колонки.Добавить("КаналПродаж");
	Результат.Колонки.Добавить("Филиал");
	Результат.Колонки.Добавить("ПодканалПродаж");
	Результат.Колонки.Добавить("СтраховойПродукт");
	Результат.Колонки.Добавить("КатегорияПродавца");
	Результат.Колонки.Добавить("Банк");
	Результат.Колонки.Добавить("Процент");
	Результат.Колонки.Добавить("ДатаОкончанияДействия");
	
	Возврат Результат;
	
КонецФункции

Функция НовыйТаблицаИнивидуальногоКВ()

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Период");
	Результат.Колонки.Добавить("Агент");
	Результат.Колонки.Добавить("СтраховойПродукт");
	Результат.Колонки.Добавить("Банк");
	Результат.Колонки.Добавить("Процент");
	Результат.Колонки.Добавить("ДатаОкончанияДействия");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИмяДокумента(СсылкаНаДокумент)
	
	Возврат СсылкаНаДокумент.Метаданные().Имя;
	
КонецФункции

Функция ПолучитьТекстЗапросаКВ(СсылкаНаДокумент)
	
	ИмяДокумента = ПолучитьИмяДокумента(СсылкаНаДокумент);
		
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	AMS_ИзменениеКВОбщееСтраховыеПродукты.СтраховойПродукт КАК СтраховойПродукт,
		|	AMS_ИзменениеКВОбщееСтраховыеПродукты.КлючСвязи КАК КлючСвязи,
		|	AMS_ИзменениеКВОбщееСтраховыеПродукты.Процент КАК Процент,
		|	AMS_ИзменениеКВОбщееСтраховыеПродукты.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ПОМЕСТИТЬ ВТ_СтраховыеПродукты
		|ИЗ
		|	Документ.%ИмяДокумента%.СтраховыеПродукты КАК AMS_ИзменениеКВОбщееСтраховыеПродукты
		|ГДЕ
		|	AMS_ИзменениеКВОбщееСтраховыеПродукты.Ссылка = &Ссылка
		|	И AMS_ИзменениеКВОбщееСтраховыеПродукты.СтраховойПродукт.ВидСтраховогоПродукта = &ВидСтраховогоПродукта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	AMS_ИзменениеКВОбщееПоказатели.КлючСвязи КАК КлючСвязи,
		|	AMS_ИзменениеКВОбщееПоказатели.КлючУсловий КАК КлючУсловий
		|ПОМЕСТИТЬ ВТ_УсловияДокумента
		|ИЗ
		|	Документ.%ИмяДокумента%.Показатели КАК AMS_ИзменениеКВОбщееПоказатели
		|ГДЕ
		|	AMS_ИзменениеКВОбщееПоказатели.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	AMS_КлючиУсловийНаборУсловий.Значение КАК БанкИНН,
		|	ВТ_УсловияДокумента.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ ВТ_БанкиУсловий
		|ИЗ
		|	ВТ_УсловияДокумента КАК ВТ_УсловияДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_КлючиУсловий.НаборУсловий КАК AMS_КлючиУсловийНаборУсловий
		|		ПО ВТ_УсловияДокумента.КлючУсловий = AMS_КлючиУсловийНаборУсловий.Ссылка
		|ГДЕ
		|	AMS_КлючиУсловийНаборУсловий.Параметр = &ПараметрБанк
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтраховыеПродукты.СтраховойПродукт КАК СтраховойПродукт,
		|	МАКСИМУМ(ВТ_СтраховыеПродукты.Процент) КАК Процент,
		|	МАКСИМУМ(ВТ_СтраховыеПродукты.ДатаОкончанияДействия) КАК ДатаОкончанияДействия,
		|	AMS_Банки.Ссылка КАК Банк
		|ИЗ
		|	ВТ_СтраховыеПродукты КАК ВТ_СтраховыеПродукты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БанкиУсловий КАК ВТ_БанкиУсловий
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Банки КАК AMS_Банки
		|			ПО ВТ_БанкиУсловий.БанкИНН = AMS_Банки.ИНН
		|		ПО ВТ_СтраховыеПродукты.КлючСвязи = ВТ_БанкиУсловий.КлючСвязи
		|
		|СГРУППИРОВАТЬ ПО
		|	AMS_Банки.Ссылка,
		|	ВТ_СтраховыеПродукты.СтраховойПродукт";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяДокумента%", ИмяДокумента);
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Процедура ЗаполнитьРезультат(Результат, РеквизитыДокумента, СсылкаНаДокумент)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = ПолучитьТекстЗапросаКВ(СсылкаНаДокумент); 
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ВидСтраховогоПродукта", Справочники.AMS_ВидыСтраховыхПродуктов.Ипотека);
	Запрос.УстановитьПараметр("ПараметрБанк", ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Запись = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, РеквизитыДокумента);
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Запись.Период = РеквизитыДокумента.Дата;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти