#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьСтатус(Реестр, Статус) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ИсторияСтатусовРеестровСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.AMS_ИсторияСтатусовРеестров.СрезПоследних(, Реестр = &Реестр) КАК AMS_ИсторияСтатусовРеестровСрезПоследних";
	
	Запрос.УстановитьПараметр("Реестр", Реестр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		УстановитьСтатусРеестра(Реестр, Статус);
		Возврат;
		
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.Статус <> Статус Тогда
		
		УстановитьСтатусРеестра(Реестр, Статус);
		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСтатусРеестра(Реестр, Статус)
	
	Менеджер = РегистрыСведений.AMS_ИсторияСтатусовРеестров.СоздатьМенеджерЗаписи();
	Менеджер.Период = ТекущаяДатаСеанса();
	Менеджер.Реестр = Реестр;
	Менеджер.Статус = Статус;
	Менеджер.Записать(Истина);
			  
КонецПроцедуры	

#КонецОбласти

#КонецЕсли