
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Движения.AMS_ОбщиеПравилаРасчетаДополнительногоКВ.Записывать = Истина;
	
	AMS_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ПараметрыПроведедения = Документы.AMS_ИзменениеДополнительногоКВОбщее.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	AMS_ПроведениеСервер.ПроведениеПоРегистрам(ЭтотОбъект, ПараметрыПроведедения);
	AMS_АктуализацияКВПоИпотеке.СформироватьЗаписиАктуальногоКВ(Ссылка);
	
КонецПроцедуры

#КонецОбласти