#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьПредставления();
	УстановитьОграниченияПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОграниченияПользователя();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриИзменении(Элемент)
	УстановитьКлючиСтрокСтраховыеПродукты();
	УстановитьКлючиСтрокУсловия();
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПередУдалением(Элемент, Отказ)
	
	ИндексСтроки = Объект.СтраховыеПродукты.Индекс(Элементы.СтраховыеПродукты.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.СтраховыеПродукты.Получить(ИндексСтроки);
	КлючСвязи = ВыделеннаяСтрока.КлючСвязи;
	
	НулевыеСтроки = Условия.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
	
	Для каждого СтрокаТаблицы Из НулевыеСтроки Цикл
		
		Условия.Удалить(СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Объект.СтраховыеПродукты[Объект.СтраховыеПродукты.Количество()-1].КлючСвязи = ПолучитьУИД();
		
	КонецЕсли;
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Попытка
		
		ИндексСтрокиУсловия = Объект.СтраховыеПродукты.Индекс(Элементы.СтраховыеПродукты.ТекущиеДанные);
		ВыделеннаяСтрока = Объект.СтраховыеПродукты.Получить(ИндексСтрокиУсловия);
		
	Исключение
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Требуется добавить данные в табличной части ""Страховые продукты""",,,,Истина);
		Отказ = Истина;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПриАктивизацииСтроки(Элемент)
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПриИзменении(Элемент)
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаСервере
Процедура УсловияПараметрПриИзмененииНаСервере()
	
	Для каждого Строка Из Условия Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.ОператорСравнения) Тогда
			
			Строка.ОператорСравнения = Справочники.AMS_ВидыСравнения.Равно;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_ВидыСтраховыхПродуктов") Тогда
		
		МассивАгентов = ПолучитьСтраховыеПродуктыПоВидамСтраховыхПродуктов(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_СтраховыеПродукты") Тогда
		
		МассивАгентов = ПолучитьСтраховыеПродуктыПоСтраховымПродуктам(ВыбранноеЗначение);

	КонецЕсли;
	
	ЗаполнитьСтраховыеПродукты(МассивАгентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого Продукт Из Объект.СтраховыеПродукты Цикл
		
		Индекс = Продукт.НомерСтроки - 1;
		
		Если НЕ ЗначениеЗаполнено(Продукт.ДатаОкончанияДействия) 
			И Продукт.Отменен Тогда
			
			ТекстСообщения	 = "Не заполнено поле ""Дата окончания действия""";
			Поле			 = "Объект.СтраховыеПродукты[" + Индекс + "].ДатаОкончанияДействия";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Поле,,Истина);
			Отказ = Истина;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Продукт.ДатаНачалаДействия) 
			И ЗначениеЗаполнено(Продукт.ДатаОкончанияДействия) Тогда
			Если Продукт.ДатаНачалаДействия > Продукт.ДатаОкончанияДействия Тогда
				ТекстСообщения = "Дата окончания действия не должна быть меньше даты начала действия";
				Поле = "Объект.СтраховыеПродукты[" + Индекс + "].ДатаОкончанияДействия";
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Поле,,Истина);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОрганизацию();
	ДобавитьКлючиСвязи();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборКлючей = Объект.Показатели.Выгрузить().ВыгрузитьКолонку("КлючСвязи");
	
	Если ОтборКлючей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьУсловияПриСоздании(ОтборКлючей);
	
	ЗаполнитьОрганизацию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтраховойПродукт(Команда)
	
	ПараметрыОтбора = ПолучитьПараметрыОтбора("ВидСтраховогоПродукта");
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	Если ФункциональностьВключена("AGENTS-2529") Тогда
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.AMS_СтраховыеПродукты.Форма.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВидыСтраховыхПродуктов(Команда)
	
	ПараметрыОтбора = ПолучитьПараметрыОтбора("Ссылка");
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	Если ФункциональностьВключена("AGENTS-2529") Тогда
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.AMS_ВидыСтраховыхПродуктов.Форма.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуНачалаДействия(Команда)
	ПослеВводаДаты = Новый ОписаниеОповещения("ПерезаполнитьДату", ЭтотОбъект);
	ПоказатьВводДаты(ПослеВводаДаты,,"Выберите дату");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ФункциональностьВключена(Параметр)
	Возврат ФункциональностьAMSДоступна(Параметр)
КонецФункции

&НаСервере
Функция ПолучитьПараметрыОтбора(ПараметрОтбора)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить(ПараметрОтбора, ПараметрыСеанса.AMS_ПараметрыПользователя.ДоступныеСтраховыеПродукты);
	
	Возврат ПараметрыОтбора;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОграниченияПользователя()
	
	Если НЕ Объект.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЭтоПолноправныйПользователь()
	Возврат ПараметрыСеанса.AMS_ПараметрыПользователя.ЭтоПолноправныйПользователь
КонецФункции

&НаСервере
Процедура ЗаполнитьОрганизацию()
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Константы.AMS_ОрганизацияПоУмолчанию.Получить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючиСтрокСтраховыеПродукты()
	
	Для каждого Стр Из Объект.СтраховыеПродукты Цикл
		
		Если Не ЗначениеЗаполнено(Стр.КлючСвязи) Тогда
			
			Стр.КлючСвязи = Стр.ПолучитьИдентификатор();
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтрок()
	
	ТекущиеДанные = Элементы.СтраховыеПродукты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСвязи = ТекущиеДанные.КлючСвязи;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("КлючСвязи", КлючСвязи);
	Элементы.Условия.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючиСтрокУсловия()
	
	ИндексСтрокиУсловия = Объект.СтраховыеПродукты.Индекс(Элементы.СтраховыеПродукты.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.СтраховыеПродукты.Получить(ИндексСтрокиУсловия);
	КлючСвязи = ВыделеннаяСтрока.КлючСвязи;
	
	Для каждого Стр Из Условия Цикл
		
		Если Не ЗначениеЗаполнено(Стр.КлючСвязи) Тогда
			
			Стр.КлючСвязи = КлючСвязи;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УсловияПараметрПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУИД()
	Возврат Новый УникальныйИдентификатор();
КонецФункции

&НаСервере
Функция ПолучитьСтраховыеПродуктыПоСтраховымПродуктам(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AMS_СтраховыеПродукты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.AMS_СтраховыеПродукты КАК AMS_СтраховыеПродукты
	|ГДЕ
	|	AMS_СтраховыеПродукты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранноеЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("СтраховойПродукт", 	 Выборка.Ссылка);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСтраховыеПродуктыПоВидамСтраховыхПродуктов(ВыбранноеЗначение)

	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AMS_СтраховыеПродукты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.AMS_СтраховыеПродукты КАК AMS_СтраховыеПродукты
	|ГДЕ
	|	AMS_СтраховыеПродукты.ВидСтраховогоПродукта = &ВидСтраховогоПродукта";
	
	Запрос.УстановитьПараметр("ВидСтраховогоПродукта", ВыбранноеЗначение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("СтраховойПродукт", 	 Выборка.Ссылка);
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтраховыеПродукты(СтраховыеПродукты)
	
	Для Каждого Продукт Из СтраховыеПродукты Цикл 
		
			СтрокаСтраховойПродукт = Объект.СтраховыеПродукты.Добавить();
			СтрокаСтраховойПродукт.СтраховойПродукт = Продукт.СтраховойПродукт;
			СтрокаСтраховойПродукт.ДатаНачалаДействия = КонецДня(ТекущаяДатаСеанса()) + 1;
			
			Если НЕ ЗначениеЗаполнено(СтрокаСтраховойПродукт.КлючСвязи) Тогда
				СтрокаСтраховойПродукт.КлючСвязи = ПолучитьУИД();
			КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКлючиСвязи()
	
	Объект.Показатели.Очистить();
	
	Для Каждого Продукт Из Объект.СтраховыеПродукты Цикл
		
		Отбор = Новый Структура("КлючСвязи", Продукт.КлючСвязи);
		СтрокаТабличнойЧасти = Условия.НайтиСтроки(Отбор);
		
		МассивПараметров = Новый Массив;
		
		Для Каждого Параметр Из СтрокаТабличнойЧасти Цикл
			
			СтруктураПростыхУсловий = СтруктураПростыхУсловий();
			ЗаполнитьЗначенияСвойств(СтруктураПростыхУсловий, Параметр);
			//--------------Удалить?
			Если СтруктураПростыхУсловий.Значение = Неопределено Тогда
				СтруктураПростыхУсловий.Значение = Параметр.ПредставлениеУсловия;
			КонецЕсли;
			//--------------Удалить?
			МассивПараметров.Добавить(СтруктураПростыхУсловий);
			
		КонецЦикла;
		
		КонтрольноеЧисло = Справочники.AMS_КлючиУсловий.СоздатьКлючУсловий(МассивПараметров);
		
		ЗаполнитьДанныеФормы(КонтрольноеЧисло, Продукт.КлючСвязи);
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы(КонтрольноеЧисло, КлючСвязи);
	
	ЗаполнитьПоказатели = Объект.Показатели.Добавить();
	ЗаполнитьПоказатели.КлючСвязи = КлючСвязи;
	ЗаполнитьПоказатели.КлючУсловий = Справочники.AMS_КлючиУсловий.НайтиПоРеквизиту("КонтрольноеЧисло", Строка(КонтрольноеЧисло));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСправочникКлючиУсловий(КонтрольноеЧисло, МассивПараметров)	
	
	СправочникОбъект = Справочники.AMS_КлючиУсловий.НайтиПоРеквизиту("КонтрольноеЧисло", Строка(КонтрольноеЧисло));
	
	Если НЕ ЗначениеЗаполнено(СправочникОбъект) Тогда
		
		НовыйСправочник = Справочники.AMS_КлючиУсловий.СоздатьЭлемент();
		НовыйСправочник.КонтрольноеЧисло = КонтрольноеЧисло;
		
		Для каждого НоваяСтрока Из МассивПараметров Цикл
			
			СтрокаТЧ = НовыйСправочник.НаборУсловий.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, НоваяСтрока);
			НовыйСправочник.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловияПриСоздании(ОтборКлючей);
	
	Для каждого Показатель Из Объект.Показатели Цикл
	
		Для Каждого Выборка Из Показатель.КлючУсловий.НаборУсловий Цикл
			
			УсловияТЧ = Условия.Добавить();
			ЗаполнитьЗначенияСвойств(УсловияТЧ, Выборка);
			Если ЗначениеЗаполнено(Выборка.ЗначениеПроизвольногоТипа) Тогда
				УсловияТЧ.ЗначениеПроизвольногоТипа = Выборка.ЗначениеПроизвольногоТипа.Получить();
			КонецЕсли;	
			УсловияТЧ.КлючСвязи = Показатель.КлючСвязи;
			
		КонецЦикла;
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура АгентПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
		|	AMS_АгентскиеДоговоры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Агенты КАК AMS_Агенты
		|		ПО AMS_АгентскиеДоговоры.Владелец = AMS_Агенты.Ссылка
		|ГДЕ
		|	AMS_АгентскиеДоговоры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Агент);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	Объект.Филиал = РезультатЗапроса.Филиал;
	Объект.АгентскийДоговор = РезультатЗапроса.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура АгентПриИзменении(Элемент)
	АгентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеПродуктыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура УсловияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
		ИЛИ ТекущиеДанные.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
		Тогда
		
		ВыбратьЗначенияПараметра(ТекущиеДанные.ЗначениеПроизвольногоТипа,
								 		ТекущиеДанные.Параметр);
		
	Иначе
		
		ВыбратьФиксированныйТипЗначениеПараметра(ТекущиеДанные.Значение,
								 		ТекущиеДанные.Параметр);
		
	КонецЕсли;	
	
	ОбновитьВидимостьПредставления();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФиксированныйТипЗначениеПараметра(ТекущиеЗначения, Параметр) Экспорт
	
	ТипЗначенияСписка = AMS_РаботаСДиалогамиСервер.ТипПоПВХ(Параметр);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьФиксированныйТипЗначениеПараметраЗавершение",
												ЭтотОбъект);
	
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущиеЗначения, , ТипЗначенияСписка); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФиксированныйТипЗначениеПараметраЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	ТекущиеДанные.Значение = Результат;
	ОбновитьВидимостьПредставления();
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьВидимостьПредставления()
		
	Для каждого СтрокаУсловий Из Условия Цикл
	
		Если СтрокаУсловий.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
			ИЛИ СтрокаУсловий.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
			Тогда
			
			СтрокаУсловий.ПредставлениеУсловия = СтрокаУсловий.ЗначениеПроизвольногоТипа;		
		Иначе
			
			СтрокаУсловий.ПредставлениеУсловия = СтрокаУсловий.Значение; 
			
		КонецЕсли;	
		
	КонецЦикла;
	Элементы.Условия.Обновить();
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьЗначенияПараметра(ТекущиеЗначения, Параметр) Экспорт
	
	ТипЗначенияСписка = AMS_РаботаСДиалогамиСервер.ТипПоПВХ(Параметр); 
	
	СписокРезультат = Новый СписокЗначений;
	СписокРезультат.ТипЗначения = ТипЗначенияСписка;
	
	Для каждого ЭлементСписка Из ТекущиеЗначения Цикл
	
		СписокРезультат.Добавить(ЭлементСписка.Значение);	
	
	КонецЦикла;
	
	ПараметрыВыбораТекущегоСписка = Новый Структура("СписокДанных", СписокРезультат);
	ОткрытьФорму("ОбщаяФорма.AMS_ВводСпискаЗначений", ПараметрыВыбораТекущегоСписка,,,,, Новый ОписаниеОповещения("ВыбратьЗначенияПараметраЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураПростыхУсловий()

	Возврат AMS_КлючиУсловийСервер.СтруктураПростыхУсловий();
	
КонецФункции

&НаКлиенте
Процедура ВыбратьЗначенияПараметраЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
		И ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
		Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекущиеДанные.ЗначениеПроизвольногоТипа = Результат;
	ОбновитьВидимостьПредставления();	
КонецПроцедуры 

&НаКлиенте
Процедура ПерезаполнитьДату(Дата, ДополнительныеПараметры) Экспорт
	
	Если Дата = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого СтрокаПродукт Из Объект.СтраховыеПродукты Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаПродукт.ДатаНачалаДействия) Тогда
			СтрокаПродукт.ДатаНачалаДействия = Дата;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
