#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОтмененаПриИзменении(Элемент)
	
	Если Объект.Отменена Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОтменаПрограммы", ЭтотОбъект);
		
		ТекстВопроса = "Мотивационная программа будет отменена. Потребуется заполнить дату отмены. Продолжить операцию?";
		ТекстЗаголовка = "Отмена мотивационной программы: " + Объект.Наименование;
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 0,,ТекстЗаголовка);
		
	КонецЕсли;
	
	Элементы.ДатаОкончанияДействия.Видимость = Объект.Отменена;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Уникальный = ПроверкаУникальностиНаСервере();
	
	Если Не Уникальный Тогда
		ТекстСообщения	 = "Наименование мотивационной программы не уникально";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.Наименование",,Истина);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.Отменена И НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияДействия) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните дату окончания действия",, "Объект.ДатаОкончанияДействия");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Объект.Отменена Тогда
		Объект.ДатаОкончанияДействия = Дата(1,1,1);
	КонецЕсли;
	
	Если Объект.Отменена И ЗначениеЗаполнено(Объект.ДатаОкончанияДействия) Тогда
		ОтменитьДокумент();
		ЭтаФорма.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Доступность = НЕ Объект.Отменена И НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияДействия);
	Элементы.ДатаОкончанияДействия.Видимость = Объект.Отменена;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИДобавитьУсловия(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если НЕ ПроверкаНаДубль(Объект.Ссылка) Тогда

			ОчиститьСообщения();
			ТекстСообщения	 = "Документ уже создан.";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Истина);
			Возврат;
			
		КонецЕсли;
		
		Записать();
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
		ПараметрыФормы.Вставить("РежимВыбора", Ложь);
		ПараметрыФормы.Вставить("НаменованиеМотивационнойПрограммы", Объект.Ссылка);
		
		ОткрытьФорму("Документ.AMS_ИзменениеУсловийМотивационнойПрограммы.Форма.ФормаДокумента", ПараметрыФормы, 
						ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМотивационнуюПрограмму(Команда)
	
	Если Объект.Отменена И ЗначениеЗаполнено(Объект.ДатаОкончанияДействия) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияЗаписиФормыОтменаПрограммы", ЭтотОбъект);
		
		ТекстВопроса = "Внимание! Действие мотивационной программы будет отменено. Вы уверены?";
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 0,,Объект.Наименование);
	Иначе
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю("Требуется установить флаг отмены и заполнить дату",, "Объект.Отменена");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТекущиеУсловия(Команда)
	
	СсылкаДокумент = ПолучитьСсылкуНаДокументРегистратор(Объект.Ссылка);
	
	Если ПроверкаТекущихУсловий(СсылкаДокумент) Тогда
		
		ОчиститьСообщения();
		ТекстСообщения	 = "Документ не найден. Попробуйте записать и добавить условие.";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Истина);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", СсылкаДокумент);
	
	ОткрытьФорму("Документ.AMS_ИзменениеУсловийМотивационнойПрограммы.Форма.ФормаДокумента", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодичностьВыплаты)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаНачалаВыплаты) Тогда
		Возврат;
	КонецЕсли;	
	
	Объект.График.Очистить();
	
	КонтрольнаяДатаОкончания = КонецГода(Объект.ДатаНачалаВыплаты);
	ДатаОкончания = Объект.ДатаНачалаВыплаты;
	Пока ДатаОкончания <= КонтрольнаяДатаОкончания Цикл
		
		СтрокаГрафика = Объект.График.Добавить();
		СтрокаГрафика.НачалоПериода 	= ДатаОкончания;
		СтрокаГрафика.ОкончаниеПериода  = ПолучитьОкончаниеПериода(ДатаОкончания, Объект.ПериодичностьВыплаты);
		СтрокаГрафика.ИдентификаторСтроки = ПолучитьНовыйИдентификатор();
		
		ДатаОкончания = КонецДня(СтрокаГрафика.ОкончаниеПериода) + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуРасчета(Команда)
	
	ДатаРасчета = Объект.ДатаНачалаВыплаты;
	
	ПоказатьВводДаты(Новый ОписаниеОповещения("ЗаполнитьДатуРасчетаЗавершение", ЭтотОбъект, Новый Структура("ДатаРасчета", ДатаРасчета)), ДатаРасчета, "Введите дату расчета");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаОтменаПрограммы(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Элементы.ДатаОкончанияДействия.Видимость = Истина;
	Иначе
		Элементы.ДатаОкончанияДействия.Видимость = Ложь;
		Объект.Отменена = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаУникальностиНаСервере();
	
	СтрРеквизитов = Новый Структура;
	СтрРеквизитов.Вставить("Наименование", Объект.Наименование);
	
	Уникальный = ОбщегоНазначенияAMS.ПрошелКонтрольУникальностиСправочникаПоРеквизиту("AMS_МотивационныеПрограммы", СтрРеквизитов, Объект.Ссылка);
	Возврат Уникальный;
	
КонецФункции

&НаСервере
Процедура ОтменитьДокумент()
	
	ОтмененныйДокумент = ПолучитьСсылкуНаДокументРегистратор(Объект.Ссылка);
	
	Если НЕ ПроверкаТекущихУсловий(ОтмененныйДокумент) Тогда
		
		ОбъектДокумент = ОтмененныйДокумент.ПолучитьОбъект();
		
		Для Каждого Вознаграждение Из ОбъектДокумент.Вознаграждения Цикл
			
			Вознаграждение.Отменено = Истина;
			Если НЕ ЗначениеЗаполнено(Вознаграждение.ДатаОтмены) Тогда
				Вознаграждение.ДатаОтмены = ТекущаяДата();
			КонецЕсли;
			
		КонецЦикла;
		
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияЗаписиФормыОтменаПрограммы(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтменитьДокумент();
		Записать();
		ЭтаФорма.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаНаДубль(МотивационнаяПрограмма)
	
	НетТакойМотивации = Документы.AMS_ИзменениеУсловийМотивационнойПрограммы.ПустаяСсылка() = ПолучитьСсылкуНаДокументРегистратор(МотивационнаяПрограмма);
	Возврат НетТакойМотивации;
	
КонецФункции

Функция ПроверкаТекущихУсловий(СсылкаДокумент)

	Проверка = Документы.AMS_ИзменениеУсловийМотивационнойПрограммы.ПустаяСсылка() = СсылкаДокумент;	
	Возврат Проверка;
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаДокументРегистратор(МотивационнаяПрограмма)
	
	Результат = Документы.AMS_ИзменениеУсловийМотивационнойПрограммы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммамСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммам.СрезПоследних КАК AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммамСрезПоследних
		|ГДЕ
		|	AMS_ПравилаРасчетаВознагражденияПоМотивационнымПрограммамСрезПоследних.МотивационнаяПрограмма = &МотивационнаяПрограмма";
	
	Запрос.УстановитьПараметр("МотивационнаяПрограмма", МотивационнаяПрограмма);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Если ЗначениеЗаполнено(РезультатЗапроса.Регистратор) Тогда
		Результат = РезультатЗапроса.Регистратор;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОкончаниеПериода(Дата, ПериодичностьВыплаты)
	
	Результат = Дата;
	
	Если ПериодичностьВыплаты = ПредопределенноеЗначение("Перечисление.AMS_РасписаниеВыплатыКВ.РазВДвеНедели") Тогда
		
		Результат = Результат + 14 * 24 * 3600 - 1;
		
	ИначеЕсли ПериодичностьВыплаты = ПредопределенноеЗначение("Перечисление.AMS_РасписаниеВыплатыКВ.Еженедельно") Тогда
		
		Результат = Результат + 7 * 24 * 3600 - 1;
		
	ИначеЕсли ПериодичностьВыплаты = ПредопределенноеЗначение("Перечисление.AMS_РасписаниеВыплатыКВ.Ежемесячно") Тогда
		
		Результат = ДобавитьМесяц(Результат, 1) - 1;
		
	ИначеЕсли ПериодичностьВыплаты = ПредопределенноеЗначение("Перечисление.AMS_РасписаниеВыплатыКВ.Ежеквартально") Тогда
		
		Результат = ДобавитьМесяц(Результат, 3) - 1;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДатуРасчетаЗавершение(Дата, ДополнительныеПараметры) Экспорт
	
	ДатаРасчета = ?(Дата = Неопределено, ДополнительныеПараметры.ДатаРасчета, Дата);
	Если НЕ ЗначениеЗаполнено(ДатаРасчета) Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого СтрокаГрафика Из Объект.График Цикл
	
		СтрокаГрафика.ДатаРасчета = ДатаРасчета;
		ДатаРасчета = ПолучитьОкончаниеПериода(ДатаРасчета, Объект.ПериодичностьВыплаты) + 1;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНовыйИдентификатор()

	Возврат XMLСтрока(Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
