
&НаСервере
Процедура ВыгрузитьДанныеНаСервере(УзелОбменаСОРВ)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КоличествоОтправленныхОбъектов = 0;
	ОбработкаОбъект.ВыгрузкаЗагрузкаДанных(Ложь,
								УзелОбменаСОРВ,
								"",
								"",
								"",
								"ОбменССОРВ",
								КоличествоОтправленныхОбъектов,
								"Обмен с СОРВ",
								"Выгрузка",
								Ложь,
								Неопределено);
								
	Сообщить(КоличествоОтправленныхОбъектов);							
								
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	ВыгрузитьДанныеНаСервере(УзелОбменаСОРВ);
КонецПроцедуры
