#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфей

Процедура ВыполнитьОбновлениеПредопределенногоЭлемента() Экспорт;
	
	Идентификаторы					 = ИдентификаторыПредопределенногоЭлементаГУИД();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		ПараметрыДополнительныхУсловийОбъект				 = КлючЗначение.Ключ.ПолучитьОбъект();
		ПараметрыДополнительныхУсловийОбъект.ГУИД			 = КлючЗначение.Значение;
		ПараметрыДополнительныхУсловийОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыПредопределенногоЭлементаГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_Мероприятия.Конкурс,							 "873f0d26-caf5-48f4-b7b9-8e6623dba51d");
	Результат.Вставить(Справочники.AMS_Мероприятия.Рейтинг,							 "ea17a622-9821-444b-bfae-59b8b922125c");
	Возврат Результат;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли