#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ВидимостьЭлементовФормы();
	
	Если ФункциональностьAMSДоступна("AGENTS-2529") Тогда
		ПрименитьОграниченияПользователя();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПараметрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДопПараметры = Новый Структура("СтраховойПродукт", Объект.Ссылка);	
	ОткрытьФорму("ПланВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ФормаВыбора", ДопПараметры, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

//Определяет видимость элементов формы (вызывается в "ПриСозданииНаСервере")
Процедура ВидимостьЭлементовФормы()

	Если Пользователи.РолиДоступны("ЧтениеГуидОбъекта", ПользователиКлиентСервер.ТекущийПользователь(), Ложь) Тогда
		Элементы.ГУИД.Видимость = Истина;
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("ИзменениеОтветственного", ПользователиКлиентСервер.ТекущийПользователь(), Ложь) Тогда
		Элементы.Ответственный.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрименитьОграниченияПользователя()
	
	Ограничения = ПараметрыСеанса.AMS_ПараметрыПользователя.ДоступныеСтраховыеПродукты;
	
	СтраховойПродукт = Ограничения.Найти(Объект.ВидСтраховогоПродукта);
	
	Если СтраховойПродукт = Неопределено Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти