#Область ПрограммныйИнтерфейс

//Входная точка для нетиповых обменов в подсистеме "Обмен данными" БСП
Процедура ВыгрузкаЗагрузкаДанных(СтандартнаяОбработка,
								ПланОбмена,
								ИмяФайлаСообщения,
								ДанныеСообщения,
								КоличествоЭлементовВТранзакции,
								ИмяСобытияЖурналаРегистрации,
								КоличествоОтправленныхОбъектов,
								НаименованиеПланаОбмена,
								ВидПроцедуры,
								Отладка = Ложь,
								ОтладочноеСообщение = Неопределено) Экспорт
								
	СтандартнаяОбработка = Ложь;
	
	ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзлаЮПРО(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение);
	
КонецПроцедуры

#Область ОбработкаДанных

Функция ОбработатьСообщение(Идентификатор) Экспорт
	
	Попытка
	     ВыполнитьОбработкуПакетаИзОчереди(Идентификатор);
	Исключение
		 ЗаписьЖурналаРегистрации("ОбменСЮпро", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось обработать " + Идентификатор);
	     РегистрыСведений.AMS_ЖурналСообщений.ЗафиксироватьОбработку(Идентификатор);
	КонецПопытки;	 
		 
КонецФункции	

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьОбработкуПакетаИзОчереди(Идентификатор)

	ДанныеСообщения = AMS_ОбменДаннымиОбщегоНазначенияСервер.ПолучитьСообщение(Идентификатор);	
	
	ДанныеПользователя = ДанныеСообщения.Данные.value.EmployeeDto;
	ДанныеАвторизации  = ДанныеСообщения.Данные.value.AccessUsersDto;
	
	ДанныеЗаполнения = Справочники.AMS_ПользователиСистем.ИнициализироватьСтруктуруЗаполнения();
	ДанныеЗаполнения.UUID 				= ДанныеПользователя.UUID;
	ДанныеЗаполнения.Наименование 		= ДанныеПользователя.Name;
	ДанныеЗаполнения.НаименованиеПолное = ДанныеПользователя.Name;
	ДанныеЗаполнения.Роль			    = ДанныеПользователя.Position.Name;
	ДанныеЗаполнения.Активен 						= ДанныеПользователя.IsActive;
	ДанныеЗаполнения.ДоступенПросмотрРеестровКВ		= ДанныеПользователя.AllowShowKV;
	ДанныеЗаполнения.ДоступноПодписаниеРеестровКВ	= ДанныеПользователя.AllowSignKV;
	
	Если ДанныеПользователя.Свойство("PointOfSale")
		И ДанныеПользователя.PointOfSale.Свойство("Guid") Тогда
		
		ДанныеЗаполнения.Продавец = ЭлементСправочникаПоЦССУ("AMS_Продавцы", ДанныеПользователя.PointOfSale.Guid);
		
	КонецЕсли;	
	
	Если ДанныеАвторизации.Количество() > 0 Тогда
		
		Авторизация = ДанныеАвторизации[0];
		
		ДанныеЗаполнения.Логин			    		= Авторизация.Login;
		ДанныеЗаполнения.НомерТелефонаПодтвержден 	= Авторизация.IsPhoneConfirmed;
		ДанныеЗаполнения.НомерТелефона				= Авторизация.PhoneNumber;
		ДанныеЗаполнения.АдресЭлектроннойПочты		= Авторизация.Email;
		ДанныеЗаполнения.АутентификацияПоСМС		= Авторизация.IsTwoFactorSmsRequired;
		ДанныеЗаполнения.АутентификацияВПриложении	= Авторизация.IsTwoFactorActivated;
		
	КонецЕсли;	

	Справочники.AMS_ПользователиСистем.СформироватьИзменитьЭлементСправочника(ДанныеЗаполнения);
	РегистрыСведений.AMS_ЖурналСообщений.ЗафиксироватьОбработку(Идентификатор);
	
КонецПроцедуры	

Процедура ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзлаЮПРО(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение)
						
	Если ВидПроцедуры = "Выгрузка" Тогда
		
		ВыполнитьВыгрузкуИзмененийДляУзлаЮПРО(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение)
		
	ИначеЕсли ВидПроцедуры = "Загрузка" Тогда
		
		ВыполнитьЗагрузкуИзмененийДляУзлаЮПРО(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение)
		
	Иначе
		
	КонецЕсли;	
						
КонецПроцедуры						

Процедура ВыполнитьВыгрузкуИзмененийДляУзлаЮПРО(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение)
	
	СоздатьФайлВыгрузкиДляОбменаНаБСП(ИмяФайлаСообщения);

КонецПроцедуры
					
Процедура ВыполнитьЗагрузкуИзмененийДляУзлаЮПРО(УзелИнформационнойБазы, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
						ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение)
						
	ОбработаноСообщений  		= 0;
	ОбработаноСОшибкой 	 		= 0;
	
	
	Если Отладка Тогда
		
		ВходящиеСообщения = ОтладочноеСообщение;
		
	Иначе 
		
		ПараметрыПодключения = ОбменДаннымиAMS.ПараметрыПодключенияRabbitMQ(УзелИнформационнойБазы, ВидПроцедуры);
		ВходящиеСообщения	 = ПолучитьСообщенияИзRabbitMQ(ПараметрыПодключения); 
		
	КонецЕсли;
	
	Для Каждого Сообщение Из ВходящиеСообщения Цикл
		
		ВходящееСообщение = Сообщение.ВходящееСообщение;
		
		Если НЕ ВходящееСообщение = "" Тогда
			
			РегистрыСведений.AMS_ЖурналСообщений.ДобавитьЗапись(УзелИнформационнойБазы, 
								Перечисления.AMS_ВидСообщенияИнтеграции.Входящее, 
								ВходящееСообщение);
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры						

Процедура СоздатьФайлВыгрузкиДляОбменаНаБСП(ИмяФайлаСообщения)

	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайлаСообщения);
	ТекстЗаглушка = "Этот файл создаётся типовым механизмом обмена БСП. Его следует игнорировать. Можно удалять.";
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Данные");
	ЗаписьХМЛ.ЗаписатьТекст(ТекстЗаглушка);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.Закрыть();
	
КонецПроцедуры

//Отправка сообщения в очередь RabbitMQ
Функция ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения)
	
	Результат = ОбменДаннымиAMS.ОтправитьСообщениеСервер(ПараметрыСообщения);	
	
	Возврат Результат;	

КонецФункции

//Отправка сообщения в очередь RabbitMQ
Функция ПолучитьСообщенияИзRabbitMQ(ПараметрыСообщения) 
	
	Результат = ОбменДаннымиAMS.ПолучитьСообщениеСервер(ПараметрыСообщения);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти