
&НаСервере
Процедура ЗагрузитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КоличествоОтправленныхОбъектов = 0;
	
	ОбработкаОбъект.ВыгрузкаЗагрузкаДанных(Ложь,
								УзелОбмена,
								"",
								"",
								"",
								"ЗагрузкаЮПро",
								КоличествоОтправленныхОбъектов,
								"Обмен с ЮПро",
								"Загрузка",
								Ложь,
								Неопределено);
								
	Сообщить(КоличествоОтправленныхОбъектов);

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
