#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт
	
	Результат = Новый Массив;
	
	ЗаполнитьДанныеСтатусыАгентов(ОбъектСсылка, Результат);
	
	Возврат Результат;
	
КонецФункции	

#Область СообщениеДляМАМС

Функция ПолучитьСтруктуруСообщенияИнструментов()
	
	Результат = Новый Структура;
	Результат.Вставить("toolGuid");
	Результат.Вставить("isSpecific");
	
	Возврат Результат;
	
КонецФункции // ПолучитьСтруктуруСообщенияСтатусыАгентов()()

Функция ПолучитьСтруктуруСообщенияСтатусыАгентов()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "AgentStatus");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	Результат.Вставить("externalId");
	Результат.Вставить("minimumAmount");
	Результат.Вставить("maximumAmount");
	Результат.Вставить("description");
	Результат.Вставить("tools", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДанныеСтатусыАгентов(ОбъектСсылка, Результат)
	
	СтатусыАгентов 			 = ПолучитьСтруктуруСообщенияСтатусыАгентов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыАгентов.ГУИД КАК guid,
		|	СтатусыАгентов.Наименование КАК name,
		|	СтатусыАгентов.ВнешнийИдентификатор КАК externalId,
		|	СтатусыАгентов.МинимальнаяСуммаСборов КАК minimumAmount,
		|	СтатусыАгентов.МаксимальнаяСуммаСборов КАК maximumAmount,
		|	СтатусыАгентов.Описание КАК description,
		|	СтатусыАгентовИнструменты.Инструмент.ГУИД КАК toolGuid,
		|	СтатусыАгентовИнструменты.Специфический КАК isSpecific,
		|	СтатусыАгентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатусыАгентов КАК СтатусыАгентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатусыАгентов.Инструменты КАК СтатусыАгентовИнструменты
		|		ПО СтатусыАгентов.Ссылка = СтатусыАгентовИнструменты.Ссылка
		|ГДЕ
		|	СтатусыАгентов.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	ВыборкаДокумента = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаДокумента.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтатусыАгентов, ВыборкаДокумента);
	
	Если ВыборкаДокумента.maximumAmount = 0 Тогда
		 СтатусыАгентов.maximumAmount = Неопределено;
	КонецЕсли;	 
	
	ВыборкаТЧ = ВыборкаДокумента.Выбрать();
	
	МассивИнструментов = Новый Массив;
	
	Пока ВыборкаТЧ.Следующий() Цикл
			
		СтруктураИнструментов = ПолучитьСтруктуруСообщенияИнструментов();
		ЗаполнитьЗначенияСвойств(СтруктураИнструментов, ВыборкаТЧ);
		
		МассивИнструментов.Добавить(СтруктураИнструментов);
		
	КонецЦикла;
	
	СтатусыАгентов.tools = МассивИнструментов;
	
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(СтатусыАгентов, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	Результат.Добавить(Данные);
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфей

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	Идентификаторы				 = ИдентификаторыПредопределенныхДанныхГУИД();
	ВнешнийИдентификатор		 = ИдентификаторыПредопределенныхДанныхВнешнийИдентификатор(); 
	МинимальнаяСуммаСборов		 = ИдентификаторыПредопределенныхДанныхМинимальнаяСуммаСборов();
	МаксимальнаяСуммаСборов		 = ИдентификаторыПредопределенныхДанныхВнешнийМаксимальнаяСуммаСборов();
	Описание					 = ИдентификаторыПредопределенныхДанныхВнешнийОписание();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		ВидыСравненияОбъект							 = КлючЗначение.Ключ.ПолучитьОбъект();
		ВидыСравненияОбъект.ГУИД					 = КлючЗначение.Значение;
		ВидыСравненияОбъект.ВнешнийИдентификатор	 = ВнешнийИдентификатор.Получить(КлючЗначение.Ключ);
		ВидыСравненияОбъект.МинимальнаяСуммаСборов	 = МинимальнаяСуммаСборов.Получить(КлючЗначение.Ключ);
		ВидыСравненияОбъект.МаксимальнаяСуммаСборов	 = МаксимальнаяСуммаСборов.Получить(КлючЗначение.Ключ);
		ВидыСравненияОбъект.Описание				 = Описание.Получить(КлючЗначение.Ключ);
		ВидыСравненияОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыПредопределенныхДанныхГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.СтатусыАгентов.Активный,					 "94b05ddf-b051-4b40-98c3-02cecde5d568");
	Результат.Вставить(Справочники.СтатусыАгентов.АктивныйПредприниматель,	 "29b4bcb1-31ec-4720-b61b-a0083e509388");
	Результат.Вставить(Справочники.СтатусыАгентов.ПрофессионалЮгории,		 "e5a12ccc-1c63-4f1a-9aac-77a816723397");
	Результат.Вставить(Справочники.СтатусыАгентов.ПартнерЛидер,				 "71adce7f-a36c-44d2-8a4a-5430267bb907");
	Результат.Вставить(Справочники.СтатусыАгентов.ТопАгент,					 "eb11a22c-73a9-4150-a8af-512d6185f4a9");
	
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхВнешнийИдентификатор()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.СтатусыАгентов.Активный,					 1);
	Результат.Вставить(Справочники.СтатусыАгентов.АктивныйПредприниматель,	 2);
	Результат.Вставить(Справочники.СтатусыАгентов.ПрофессионалЮгории,		 3);
	Результат.Вставить(Справочники.СтатусыАгентов.ПартнерЛидер,				 4);
	Результат.Вставить(Справочники.СтатусыАгентов.ТопАгент,					 5);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхМинимальнаяСуммаСборов()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.СтатусыАгентов.Активный,					 0);
	Результат.Вставить(Справочники.СтатусыАгентов.АктивныйПредприниматель,	 20000);
	Результат.Вставить(Справочники.СтатусыАгентов.ПрофессионалЮгории,		 100000);
	Результат.Вставить(Справочники.СтатусыАгентов.ПартнерЛидер,				 300000);
	Результат.Вставить(Справочники.СтатусыАгентов.ТопАгент,					 1000000);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхВнешнийМаксимальнаяСуммаСборов()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.СтатусыАгентов.Активный,					 19999.99);
	Результат.Вставить(Справочники.СтатусыАгентов.АктивныйПредприниматель,	 99999.99);
	Результат.Вставить(Справочники.СтатусыАгентов.ПрофессионалЮгории,		 299999.99);
	Результат.Вставить(Справочники.СтатусыАгентов.ПартнерЛидер,				 999999.99);
	Результат.Вставить(Справочники.СтатусыАгентов.ТопАгент,					 );
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхВнешнийОписание()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.СтатусыАгентов.Активный,					 "Ваши усилия не останутся незамеченными – каждый шаг приближает Вас к успеху!");
	Результат.Вставить(Справочники.СтатусыАгентов.АктивныйПредприниматель,	 "Вы способны на великие дела! Верьте в себя и свои возможности!");
	Результат.Вставить(Справочники.СтатусыАгентов.ПрофессионалЮгории,		 "Вы эффективнее, чем 73% страховых предпринимателей страны");
	Результат.Вставить(Справочники.СтатусыАгентов.ПартнерЛидер,				 "Ваш профессионализм покорит любые вершины!");
	Результат.Вставить(Справочники.СтатусыАгентов.ТопАгент,					 "Мы гордимся Вашими достижениями! Держите этот темп!");
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти

#КонецЕсли