#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Список  условий сравнения для параметра или типа значений
// Возвращаемое значение:
//  Массив из Строка
//
Функция ПолучитьДоступныеУсловияСравнения(ДляКого) Экспорт

	
	Условия = Новый Массив;

	Если ТипЗнч(ДляКого) = Тип("ПланВидовХарактеристикСсылка.AMS_ПараметрыДополнительныхУсловий") Тогда
			
		//   
		Если ДляКого.ДоступныеУсловияСравнения.Количество()>0 тогда
			
			Для каждого Строка из ДляКого.ДоступныеУсловияСравнения    цикл
				
				Условия.Добавить(Строка.УсловиеСравнения);
				
			Конеццикла;
			
			Возврат Условия;
					
		конецесли;	
		
		ТипС = ДляКого.ТипЗначения;
		
	Иначе
		
		ТипС = ДляКого; 
		
	конецесли;
	
	
	Если  ТипС.СодержитТип(Тип("Булево")) Тогда	
		
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.Равно); 
		
	ИначеЕсли  ТипС.СодержитТип(Тип("Строка")) Тогда	
		
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.Равно);
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.НеРавно); 
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.Заполнено);
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.НеЗаполнено);
		
	ИначеЕсли  ТипС.СодержитТип(Тип("Дата")) или ТипС.СодержитТип(Тип("Число")) Тогда		    
		
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.Равно); 
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.НеРавно);
		
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.БольшеИлиРавно); 
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.МеньшеИлиРавно);
		
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.Больше); 
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.Меньше);
		
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.Заполнено);
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.НеЗаполнено);
		
	Иначе  //ссылочные типы
		
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.Равно);
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.НеРавно); 
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.Заполнено);
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.НеЗаполнено);
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.ВСписке);
		Условия.Добавить(Перечисления.AMS_ВидыСравнения.НеВСписке);
		
	КонецЕсли;
			
	
	Возврат Условия;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	Идентификаторы					 = ИдентификаторыПредопределенныхДанныхГУИД();
	ИдентификаторыПуть				 = ИдентификаторыПредопределенныхДанныхПутьКДанным(); 
	ИдентификаторыТипДанных			 = ИдентификаторыПредопределенныхДанныхТипыГУИД();
	ИдентификаторыМотивация			 = ИдентификаторыПредопределенныхДанныхМотивация();
	ИдентификаторыОсновной			 = ИдентификаторыПредопределенныхДанныхОсновной();
	ИдентификаторыДополнительный	 = ИдентификаторыПредопределенныхДанныхДополнительный();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		ПараметрыДополнительныхУсловийОбъект				 = КлючЗначение.Ключ.ПолучитьОбъект();
		ПараметрыДополнительныхУсловийОбъект.ГУИД			 = КлючЗначение.Значение;
		ПараметрыДополнительныхУсловийОбъект.ПутьКданным	 = ИдентификаторыПуть.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.ТипДанныхСОРВ	 = ИдентификаторыТипДанных.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.Мотивация		 = ИдентификаторыМотивация.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.Основной		 = ИдентификаторыОсновной.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.Дополнительный	 = ИдентификаторыДополнительный.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыПредопределенныхДанныхОсновной()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипАгента,					 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойРиск,				 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойПродукт,				 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Верификация,					 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ГодСтрахования,				 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КатегорияДоговора,			 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КБМ,							 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия,						 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПеревод,				 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Пролонгация,					 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСтрахователя,	 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ФормаВыплаты,					 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Франшиза,						 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЭтоЕОСАГО,					 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПереход,				 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЦельИспользованияТС,			 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипТС,						 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.РегионСобственника,			 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСобственника,	 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность, Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ВидСтраховогоПродукта,		 Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхДополнительный()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипАгента,					 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойРиск,				 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойПродукт,				 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Верификация,					 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ГодСтрахования,				 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КатегорияДоговора,			 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КБМ,							 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия,						 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПеревод,				 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Пролонгация,					 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСтрахователя,	 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ФормаВыплаты,					 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Франшиза,						 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЭтоЕОСАГО,					 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПереход,				 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЦельИспользованияТС,			 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипТС,						 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.РегионСобственника,			 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСобственника,	 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность, Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ВидСтраховогоПродукта,		 Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхМотивация()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипАгента,					 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойРиск,				 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойПродукт,				 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Верификация,					 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ГодСтрахования,				 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КатегорияДоговора,			 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КБМ,							 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия,						 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПеревод,				 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Пролонгация,					 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСтрахователя,	 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ФормаВыплаты,					 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Франшиза,						 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЭтоЕОСАГО,					 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПереход,				 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЦельИспользованияТС,			 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипТС,						 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.РегионСобственника,			 Ложь);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСобственника,	 Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность, Истина);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ВидСтраховогоПродукта,		 Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхТипыГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипАгента,					 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойРиск,				 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойПродукт,				 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Верификация,					 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхБулево);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ГодСтрахования,				 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхЧисло);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КатегорияДоговора,			 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КБМ,							 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхЧисло);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия,						 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхЧисло);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПеревод,				 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхБулево);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Пролонгация,					 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхБулево);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСтрахователя,	 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ФормаВыплаты,					 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Франшиза,						 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхБулево);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЭтоЕОСАГО,					 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхБулево);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПереход,				 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхБулево);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЦельИспользованияТС,			 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипТС,						 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.РегионСобственника,			 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхGUID);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСобственника,	 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность, Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхЧисло);
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ВидСтраховогоПродукта,		 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхПутьКДанным()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 "additionalParameters.additionalAgent");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипАгента,					 "seller.partnerTypeId");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойРиск,				 "additionalParameters.risk");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойПродукт,				 "additionalParameters.productId");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Верификация,					 "additionalParameters.verification");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ГодСтрахования,				 "additionalParameters.yearOfInsurance");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КатегорияДоговора,			 "additionalParameters.сategoryСontract");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КБМ,							 "additionalParameters.KBM");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия,						 "additionalParameters.premium");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПеревод,				 "additionalParameters.transference");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Пролонгация,					 "additionalParameters.prolongation");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСтрахователя,	 "additionalParameters.insuredType");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ФормаВыплаты,					 "additionalParameters.payoutForm");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Франшиза,						 "additionalParameters.franchise");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЭтоЕОСАГО,					 "additionalParameters.eOsago");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПереход,				 "additionalParameters.transit");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЦельИспользованияТС,			 "additionalParameters.purposeOfUsing");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипТС,						 "additionalParameters.vehicleType");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.РегионСобственника,			 "additionalParameters.ownerRegion");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСобственника,	 "additionalParameters.ownerType");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность, "additionalParameters.receivables");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ВидСтраховогоПродукта,		 "additionalParameters.productTypeId");
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 "33b5c3a6-d3ca-4f2b-9893-a7dbe0613960");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипАгента,					 "e3c6222c-4630-4cc3-bfc3-3e4984498c2d");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойРиск,				 "e4da4c35-fb57-4927-ac0e-f13c8ae022bc");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.СтраховойПродукт,				 "c79aae47-ce6a-4d52-becb-86ec7258362a");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Верификация,					 "f335f473-ccb8-46f4-953e-7538130036c7");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ГодСтрахования,				 "65efdb31-1326-41a8-b88d-6e04f27e26a1	");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КатегорияДоговора,			 "61477d14-4c7b-432d-9de1-0c0fbe4576da");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.КБМ,							 "7e576719-930a-47fb-a7b0-5ba31174ac0c");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Премия,						 "71568fef-e9fe-4434-84f2-6c864f563d2d");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПеревод,				 "fc3ca284-903e-4bd4-ab7f-ad7f0b938117");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Пролонгация,					 "dab2389d-236c-4f5a-b5da-c5ef2e6ba8da");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСтрахователя,	 "a5081c1a-0763-426f-914d-6b90e02c3283");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ФормаВыплаты,					 "82458300-712b-4b94-93a6-ba9524e4bb0e");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Франшиза,						 "8cd32720-8b15-4cf3-8043-6a39511bc28d");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЭтоЕОСАГО,					 "bc38bd7f-309d-4671-b81a-8aaea17ce4c3");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ПрограммаПереход,				 "c62895ee-29ef-4e31-88fd-93a5eaddcd3b");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ЦельИспользованияТС,			 "34d1b050-468c-4e48-9bd5-56e516c0b8ec");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипТС,						 "fb5dd865-d171-4ccd-87f0-508c866af4f4");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.РегионСобственника,			 "8a412911-69ec-44d3-a399-8279be092b8e");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ТипКонтрагентаСобственника,	 "0e9dc182-f57d-441e-a38e-6f5b179bb872");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ДебиторскаяЗадолженность, "90e23427-ce71-45cd-8f13-e6dee11aa1b3");
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.ВидСтраховогоПродукта,		 "8880f6fa-5f4b-4d49-a341-8d6c0173e284");
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьОбновлениеПредопределенногоЭлемента() Экспорт;
	
	Идентификаторы					 = ИдентификаторыПредопределенногоЭлементаГУИД();
	ИдентификаторыПуть				 = ИдентификаторыПредопределенногоЭлементаПутьКДанным(); 
	ИдентификаторыТипДанных			 = ИдентификаторыПредопределенногоЭлементаТипыГУИД();
	ИдентификаторыМотивация			 = ИдентификаторыПредопределенногоЭлементаМотивация();
	ИдентификаторыОсновной			 = ИдентификаторыПредопределенногоЭлементаОсновной();
	ИдентификаторыДополнительный	 = ИдентификаторыПредопределенногоЭлементаДополнительный();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		ПараметрыДополнительныхУсловийОбъект				 = КлючЗначение.Ключ.ПолучитьОбъект();
		ПараметрыДополнительныхУсловийОбъект.ГУИД			 = КлючЗначение.Значение;
		ПараметрыДополнительныхУсловийОбъект.ПутьКданным	 = ИдентификаторыПуть.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.ТипДанныхСОРВ	 = ИдентификаторыТипДанных.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.Мотивация		 = ИдентификаторыМотивация.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.Основной		 = ИдентификаторыОсновной.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.Дополнительный	 = ИдентификаторыДополнительный.Получить(КлючЗначение.Ключ);
		ПараметрыДополнительныхУсловийОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыПредопределенногоЭлементаОсновной()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенногоЭлементаДополнительный()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенногоЭлементаМотивация()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенногоЭлементаТипыГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенногоЭлементаПутьКДанным()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 "additionalParameters.bankINN");
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенногоЭлементаГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(ПланыВидовХарактеристик.AMS_ПараметрыДополнительныхУсловий.Банк,							 "33b5c3a6-d3ca-4f2b-9893-a7dbe0613960");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
