#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	Идентификаторы		 = ИдентификаторыПредопределенныхДанныхГУИД();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		СправочникОбъект = КлючЗначение.Ключ.ПолучитьОбъект();
		СправочникОбъект.ГУИД = КлючЗначение.Значение;
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыПредопределенныхДанныхГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхGUID, "d1dfcc87-1214-4c1d-bf39-c118d9cca002");
	Результат.Вставить(Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхДатаИВремя, "26edea1a-a16c-42a2-b57d-a4592bd6569f");
	Результат.Вставить(Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхБулево, "eafdc1b8-1d5a-45c2-902c-df29a5d98bae");
	Результат.Вставить(Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхСтрока, "7c1461c9-9cfa-4bb9-9cfe-4e6d6cdf560a");
	Результат.Вставить(Справочники.AMS_ТипыДанныхСОРВ.ТипДанныхЧисло, "a7166d6e-ffd9-4f84-8598-994a05d59c6b");
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли