#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедуры
// Первая версия модуля 29.08.2024

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Если Не ИсходныеДанные.Свойство("GUID") Тогда
		
		Комментарий = "Для справочника не заполнен обязательный реквизит ГУИД";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Сотрудники организации", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		
		Возврат;
		
	КонецЕсли;	
		
	ИсходныеДанные		  = СериализацияИсходныхДанных(ИсходныеДанные);
		
	СсылкаНаОбъект 		  = Справочники.AMS_СотрудникиОрганизации.ПолучитьСсылку(ИсходныеДанные.УИД); 
	
	СотрудникиОрганизацииОбъект				  = СсылкаНаОбъект.ПолучитьОбъект(); 
	
	Если СотрудникиОрганизацииОбъект = Неопределено Тогда 
		
		СотрудникиОрганизацииОбъект = Справочники.AMS_СотрудникиОрганизации.СоздатьЭлемент();
		
		СотрудникиОрганизацииОбъект.УстановитьСсылкуНового(СсылкаНаОбъект); 
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СотрудникиОрганизацииОбъект, ИсходныеДанные);
	
	Попытка 
		
		СотрудникиОрганизацииОбъект.Записать();
		
		Комментарий = СтрШаблон("Успешно записан сотрудник организации с УИД %1", ИсходныеДанные.УИД);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Сотрудники организации", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_СотрудникиОрганизации, СотрудникиОрганизацииОбъект.Ссылка, Комментарий);
			
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Сотрудники организации", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_СотрудникиОрганизации, СотрудникиОрганизацииОбъект.Ссылка, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры  

Функция СериализацияИсходныхДанных(Данные)
	
	Попытка 
		
		СодержимоеСтруктуры = "УИД, Организация, Наименование, НаименованиеПолное, ПометкаУдаления";
		
		Результат = Новый Структура(СодержимоеСтруктуры);
		
		Результат.УИД = Новый УникальныйИдентификатор(Данные.GUID);
		
		Результат.Организация		 = Данные.Организация;
		Результат.Наименование		 = Данные.Наименование;
		Результат.НаименованиеПолное = Данные.НаименованиеПолное;
		Результат.ПометкаУдаления	 = Данные.ПометкаУдаления;
	Исключение 
		
		Результат = Неопределено;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Сотрудники организации", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_СотрудникиОрганизации,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли