#Область ПрограммныйИнтерфейс

//Входная точка для нетиповых обменов в подсистеме "Обмен данными" БСП
Процедура ВыгрузкаЗагрузкаДанных(СтандартнаяОбработка,
	ПланОбмена,
	ИмяФайлаСообщения,
	ДанныеСообщения,
	КоличествоЭлементовВТранзакции,
	ИмяСобытияЖурналаРегистрации,
	КоличествоОтправленныхОбъектов,
	НаименованиеПланаОбмена,
	ВидПроцедуры,
	Отладка = Ложь,
	ОтладочноеСообщение = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзла(ПланОбмена, ИмяФайлаСообщения, ДанныеСообщения,КоличествоЭлементовВТранзакции,
	ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов, ВидПроцедуры, Отладка, ОтладочноеСообщение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВариантыОбмена

Процедура ВыполнитьВыгрузкуЗагрузкуИзмененийДляУзла(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,
	КоличествоЭлементовВТранзакции = 0, КлючСообщенияЖурналаРегистрации = "",
	КоличествоОбъектовОбработано = 0, ВидПроцедуры, Отладка, ОтладочноеСообщение)
	
	Если ВидПроцедуры = "Выгрузка" Тогда
		
		ВыполнитьВыгрузкуИзменений(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,КоличествоЭлементовВТранзакции,
			КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение);
		
	ИначеЕсли ВидПроцедуры = "Загрузка" Тогда
		
		ВыполнитьЗагрузкуИзменений(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,КоличествоЭлементовВТранзакции,
			КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение);
		
		
	Иначе
		
		Комментарий = "Иной вариант работы не предусмотрен";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка данных из ЦССУ", УровеньЖурналаРегистрации.Ошибка, , , Комментарий);	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

Процедура ВыполнитьВыгрузкуИзменений(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,КоличествоЭлементовВТранзакции,
						КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение)
	
	ПараметрыСообщения = ОбменДаннымиAMS.ПараметрыПодключенияRabbitMQ(УзелИнформационнойБазы, ВидПроцедуры);
	ЗарегистрированныеОбъекты	= ПолучитьЗарегистрированныеКОтправкеОбъекты(ИмяФайла, УзелИнформационнойБазы);
	
	РезультатОтправки = Новый Структура("Успех, Сообщение", Истина, Неопределено);
	
	ОбъектыДляСменыСтатуса = Новый Массив;
	
	Для Каждого Пакет Из ЗарегистрированныеОбъекты Цикл
		
		ВыборкаИзменений = Пакет.Выбрать();
		
		Пока ВыборкаИзменений.Следующий() Цикл
			
			Реестр = ВыборкаИзменений.Ссылка;
			ТекстСообщения = "";
			СформироватьСообщениеПоРеестру(Реестр, ТекстСообщения);
			
			Если НЕ ЗначениеЗаполнено(ТекстСообщения) Тогда
				
				Продолжить;
				
			КонецЕсли;	
			
			ПараметрыСообщения.ТекстСообщения = ТекстСообщения;	
			РезультатОтправки = ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения);
			ОбъектыДляСменыСтатуса.Добавить(Реестр);
		КонецЦикла;
		
	КонецЦикла;
	
	СменитьстатусБазовыхреестров(ОбъектыДляСменыСтатуса);
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелИнформационнойБазы);				
	СоздатьФайлВыгрузкиЗаглушкуДляОбменаНаБСП(ИмяФайла);

КонецПроцедуры						

Процедура ВыполнитьЗагрузкуИзменений(УзелИнформационнойБазы, ИмяФайла, СообщениеОбмена,КоличествоЭлементовВТранзакции,
						КлючСообщенияЖурналаРегистрации, КоличествоОбъектовОбработано, ВидПроцедуры, Отладка, ОтладочноеСообщение)
						
						
	Если Отладка Тогда
		
		ВходящиеСообщения = ОтладочноеСообщение;
		
	Иначе 
		
		ПараметрыПодключения = ОбменДаннымиAMS
						.ПараметрыПодключенияRabbitMQ(УзелИнформационнойБазы, ВидПроцедуры);
		ВходящиеСообщения	 = ПолучитьСообщенияИзRabbitMQ(ПараметрыПодключения); 
		
	КонецЕсли;
	
	МассивДляОбработки = Новый Массив;
	
	Для Каждого Сообщение Из ВходящиеСообщения Цикл
		
		Если НЕ Сообщение.ВходящееСообщение = "" Тогда
			
			ИдентификаторСообщения = РегистрыСведений
						.AMS_ЖурналСообщенийПоРеестрамИзЦССУ
						.ДобавитьСообщение(Сообщение.ВходящееСообщение);
						
			МассивДляОбработки.Добавить(ИдентификаторСообщения);
			
		КонецЕсли;
		
	КонецЦикла;	
		
	ОбработатьВходящиеСообщения(МассивДляОбработки);					
	
КонецПроцедуры

//Чтобы типовой механизм понял, что выгрузка данных произошла,
//надо заполнить типовой файл выгрузки содержимым.
Процедура СоздатьФайлВыгрузкиЗаглушкуДляОбменаНаБСП(ИмяФайлаСообщения)

	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайлаСообщения);
	ТекстЗаглушка = "Этот файл создаётся типовым механизмом обмена БСП. Его следует игнорировать. Можно удалять.";
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Данные");
	ЗаписьХМЛ.ЗаписатьТекст(ТекстЗаглушка);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.Закрыть();
	
КонецПроцедуры

#Область КоннекторRMQ
//Отправка сообщения в очередь RabbitMQ
Функция ОтправитьСообщениеВRabbitMQ(ПараметрыСообщения)
	
	Результат = ОбменДаннымиAMS.ОтправитьСообщениеСервер(ПараметрыСообщения);	
	
	Возврат Результат;	

КонецФункции					

//Отправка сообщения в очередь RabbitMQ
Функция ПолучитьСообщенияИзRabbitMQ(ПараметрыСообщения) 
	
	Результат = ОбменДаннымиAMS.ПолучитьСообщениеСервер(ПараметрыСообщения);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьВходящиеСообщения(МассивСообщений)
	
	Для каждого ИдентификаторСообщения Из МассивСообщений Цикл
	
		Сообщение = РегистрыСведений
						.AMS_ЖурналСообщенийПоРеестрамИзЦССУ
						.ПолучитьСообщение(ИдентификаторСообщения);
		ИсходныеДанные = ПолучитьСтруктуруJSON(Сообщение);				                                   
		
		Если ТипЗнч(ИсходныеДанные) = Тип("Массив") Тогда
			ДанныеДляОбработки = ИсходныеДанные;
		Иначе	
			
			ДанныеДляОбработки = Новый Массив;
		    ДанныеДляОбработки.Добавить(ИсходныеДанные);
		КонецЕсли;	
			
		Попытка
			Справочники
				.AMS_РеестрыВознагражденийПоМотивационнымПрограммамДляПередачивЦССУ
				.СформироватьИзменитьЭлементСправочника(ДанныеДляОбработки);
				
			РегистрыСведений
						.AMS_ЖурналСообщенийПоРеестрамИзЦССУ
						.ЗафиксироватьОбработку(ИдентификаторСообщения);
		Исключение
						
			Ошибка = ИнформацияОбОшибке();
			РегистрыСведений
						.AMS_ЖурналСообщенийПоРеестрамИзЦССУ
						.ЗафиксироватьОшибку(ИдентификаторСообщения, ПодробноеПредставлениеОшибки(Ошибка));
						
		КонецПопытки;				
						
	КонецЦикла;
						
КонецПроцедуры	

Функция ПолучитьСтруктуруJSON(ТекстСообщения)
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);	
	
	Возврат ДанныеJSON;	
		
КонецФункции

Функция ПолучитьЗарегистрированныеКОтправкеОбъекты(ИмяФайла, УзелИнформационнойБазы)

	МетаДанныеОбмена		= УзелИнформационнойБазы.МетаДанные();
	СоставПланаОбмена		= МетаДанныеОбмена.Состав;
	УчаствуютВОбмене		= Новый Массив();
	НаименованиеПланаОбмена = МетаДанныеОбмена.Имя;
	
	Для Каждого Элемент Из СоставПланаОбмена Цикл
		УчаствуютВОбмене.Добавить(Элемент.Метаданные.ПолноеИмя());
	КонецЦикла;
	
	// Получаем выборку измененных данных.
	Запрос = Новый Запрос;
	Запрос.Текст = ОбменДаннымиAMS.ТекстЗапросаИзмененийПланаОбмена(УчаствуютВОбмене, НаименованиеПланаОбмена);
	Запрос.УстановитьПараметр("Узел", УзелИнформационнойБазы);
	
	ВыборкаИзменений = Запрос.ВыполнитьПакет();
	
	Возврат ВыборкаИзменений;
	
КонецФункции

Процедура СформироватьСообщениеПоРеестру(Реестр, ТекстСообщения)
	
	Сообщение = Новый Структура;
	Сообщение.Вставить("MainHeader", СтруктураЗаголовка());
	Сообщение.Вставить("Commission", ДанныеПоКомиссии(Реестр));
	
	ТекстСообщения = ОбменДаннымиAMS.СформироватьСтрокуJSON(Сообщение, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	
	ЗаписьЖурналаРегистрации("РеестрыПоПремиальнымПрограммам.СообщенияИнтеграции", 
								УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
	
КонецПроцедуры	

Функция СтруктураЗаголовка()
	
	Результат = Новый Структура;
	Результат.Вставить("RequestDate", Формат(ТекущаяДатаСеанса(),"ДФ=yyyy-MM-ddThh:mm:ss"));
	Результат.Вставить("MasterSystemGUID", "8941eaad-dbad-4619-87db-a512d3a13239");
	
	Возврат Результат;
	
КонецФункции	

Функция ДанныеПоКомиссии(Реестр)
	
	Результат = Новый Структура;
	Результат.Вставить("DocumentGUID", Реестр.ГУИД);
	Результат.Вставить("MotivationProgram", Реестр.МотивационнаяПрограмма.ГУИДЦССУ);
	Результат.Вставить("PeriodStart"	  , Формат(Реестр.НачалоПериода,"ДФ=yyyy-MM-dd"));
	Результат.Вставить("PeriodEnd"		  , Формат(Реестр.КонецПериода,"ДФ=yyyy-MM-dd"));
	Результат.Вставить("Comment", "");
	
	МассивВознаграждений = Новый Массив;
	Для каждого Вознаграждение Из Реестр.ВознагражденияАгентов Цикл
	
		СтруктураВознаграждения = Новый Структура;
		СтруктураВознаграждения.Вставить("ReestrGUID", Вознаграждение.Реестр.ГУИД);
		СтруктураВознаграждения.Вставить("AgentGUID" , Вознаграждение.Агент.ГУИД);
		СтруктураВознаграждения.Вставить("Amount"	 , Вознаграждение.СуммаВознаграждения);
		
		МассивВознаграждений.Добавить(СтруктураВознаграждения);
		
	КонецЦикла;
	
	Результат.Вставить("ComissionRecepients", МассивВознаграждений);
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьСоответствиеСтатусов()

	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.AMS_СтатусыРеестра.Создан, "VALIDATION");
	Результат.Вставить(Перечисления.AMS_СтатусыРеестра.Согласован, "APPROVED");
	Результат.Вставить(Перечисления.AMS_СтатусыРеестра.Отменен, "REJECT");
	
	Возврат Результат;
	
КонецФункции	

Процедура СменитьстатусБазовыхреестров(ОбъектыДляСменыСтатуса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	AMS_РеестрыВознагражденийПоМотивационнымПрограммамДляПередачивЦССУВознагражденияАгентов.Реестр КАК Реестр
		|ИЗ
		|	Справочник.AMS_РеестрыВознагражденийПоМотивационнымПрограммамДляПередачивЦССУ.ВознагражденияАгентов КАК AMS_РеестрыВознагражденийПоМотивационнымПрограммамДляПередачивЦССУВознагражденияАгентов
		|ГДЕ
		|	AMS_РеестрыВознагражденийПоМотивационнымПрограммамДляПередачивЦССУВознагражденияАгентов.Ссылка В(&ОбъектыДляСменыСтатуса)";
	
	Запрос.УстановитьПараметр("ОбъектыДляСменыСтатуса", ОбъектыДляСменыСтатуса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реестр) Тогда
			Продолжить;
		КонецЕсли;	
		
		РеестрОбъект = ВыборкаДетальныеЗаписи.Реестр.ПолучитьОбъект();
		РеестрОбъект.Статус = Перечисления.AMS_СтатусыРеестра.Отправлен;
		РеестрОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти