#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура УсловияПриИзменении(Элемент)
	
	УстановитьКлючиСтрокВознаграждения();
	УстановитьКлючиСтрокУсловия();

КонецПроцедуры

&НаКлиенте
Процедура ВознагражденияПередУдалением(Элемент, Отказ)
	
	ИндексСтроки = Объект.Вознаграждения.Индекс(Элементы.Вознаграждения.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.Вознаграждения.Получить(ИндексСтроки);
	КлючСвязи = ВыделеннаяСтрока.КлючСвязи;
	
	НулевыеСтроки = Условия.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
	
	Для каждого СтрокаТаблицы Из НулевыеСтроки Цикл
		
		Условия.Удалить(СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВознагражденияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Объект.Вознаграждения[Объект.Вознаграждения.Количество()-1].КлючСвязи = ПолучитьУИД();
		
	КонецЕсли;
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Попытка
		
		ИндексСтрокиУсловия = Объект.Вознаграждения.Индекс(Элементы.Вознаграждения.ТекущиеДанные);
		ВыделеннаяСтрока    = Объект.Вознаграждения.Получить(ИндексСтрокиУсловия);
		
	Исключение
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Требуется добавить данные в табличной части ""Вознаграждения""",,,,Истина);
		Отказ = Истина;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВознагражденияПриАктивизацииСтроки(Элемент)
	
	УстановитьВидимостьСтрок();

КонецПроцедуры

&НаКлиенте
Процедура ВознагражденияПриИзменении(Элемент)
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаСервере
Процедура УсловияПараметрПриИзмененииНаСервере()
	
	Для каждого Строка Из Условия Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.ОператорСравнения) Тогда
			
			Строка.ОператорСравнения = Справочники.AMS_ВидыСравнения.Равно;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_Филиалы") Тогда
		
		МассивАгентов = ПолучитьАгентовПоФилиалу(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_Агенты") Тогда	
		
		МассивАгентов = ПолучитьАгентовПоАгенту(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.AMS_КаналыПродаж") Тогда
		
		МассивАгентов = ПолучитьАгентовПоКаналам(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		МассивАгентов = ПолучитьАгентовПоФилиалуИКаналу(ВыбранноеЗначение);
		
	КонецЕсли;
	
	ЗаполнитьУчастниковПрограммы(МассивАгентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Вознаграждения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не добавлено ни одного вознаграждения",,Объект.Вознаграждения,,Истина);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Объект.УчастникиПрограммы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не добавлено ни одного участника программы",,Объект.УчастникиПрограммы,,Истина);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого Вознаграждение Из Объект.Вознаграждения Цикл
		
		Индекс = Вознаграждение.НомерСтроки - 1;
		
		Если НЕ ЗначениеЗаполнено(Вознаграждение.ДатаОтмены) 
			И Вознаграждение.Отменено Тогда
			
			ТекстСообщения	 = "В строке " + (Индекс + 1) + " таблицы ""Вознагражения"" не заполнено поле ""ДатаОтмены""";
			Поле			 = "Объект.Вознаграждения[" + Индекс + "].ДатаОтмены";
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Поле,,Истина);
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Участник Из Объект.УчастникиПрограммы Цикл
		
		Индекс = Участник.НомерСтроки - 1;
		
		Если НЕ ЗначениеЗаполнено(Участник.ДатаИсключения) 
			И Участник.Исключен Тогда
			
			ТекстСообщения	 = "В строке " + (Индекс + 1) + " таблицы ""Учасники программы"" не заполнено поле ""Дата исключения""";
			Поле			 = "Объект.УчастникиПрограммы[" + Индекс + "].ДатаИсключения";
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Поле,,Истина);
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВыгрузитьКолонки();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.МотивационнаяПрограмма) 
		И Параметры.Свойство("НаменованиеМотивационнойПрограммы") Тогда
		
		Объект.МотивационнаяПрограмма = Параметры.НаменованиеМотивационнойПрограммы;
		
	КонецЕсли;	
	
	ЗаполнитьУсловияПриСоздании();
	ЗаполнитьФилиалыПриСоздании();
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПрограммыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоСложноеУсловиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Вознаграждения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.СложноеУсловие = ЭтоСложноеУсловие;
	
	УстановитьВидимостьСтраницыУсловий();
    ДобавитьУдалитьЭлементСложныхУсловий();
	
КонецПроцедуры

&НаКлиенте
Процедура СложныеУсловияПрограммыТаблицаПриИзменении(Элемент)
	
	ТекущееВознаграждение = Элементы.Вознаграждения.ТекущиеДанные;
	Если ТекущееВознаграждение = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Элемент.ТекущиеДанные.КлючСвязи = ТекущееВознаграждение.КлючСвязи;
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.КлючСвязиСложногоУсловия) Тогда
		
		 Элемент.ТекущиеДанные.КлючСвязиСложногоУсловия = Строка(Новый УникальныйИдентификатор);
		 
	КонецЕсли;	 
	
	
	ОбновитьВидимостьСложныхУсловий();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьФилиалыПриСоздании()
	
	ОтборАгенты = ВыгрузитьКолонкуАгенты();
	
	Если ОтборАгенты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы.Агент КАК Агент,
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал
	|ИЗ
	|	Документ.AMS_ИзменениеУсловийМотивационнойПрограммы.УчастникиПрограммы КАК AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ПО AMS_ИзменениеУсловийМотивационнойПрограммыУчастникиПрограммы.Агент = AMS_АгентскиеДоговоры.Владелец
	|ГДЕ
	|	AMS_АгентскиеДоговоры.Владелец В(&Владелец)
	|	И AMS_АгентскиеДоговоры.Статус = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыАД.Действует)";
	
	Запрос.УстановитьПараметр("Владелец", ОтборАгенты);
	
	ВыборкаАгентов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаАгентов.Следующий() Цикл
		
		Отбор = Новый Структура("Агент", ВыборкаАгентов.Агент);
		СтрокаТЧ = Объект.УчастникиПрограммы.НайтиСтроки(Отбор);
		
		Если СтрокаТЧ.Количество() > 0 Тогда
			СтрокаТЧ[0].Филиал = ВыборкаАгентов.Филиал;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьАгенты(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	ОткрытьФорму("Справочник.AMS_Агенты.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьФилиалы(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	ОткрытьФорму("Справочник.AMS_Филиалы.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьКаналПодканал(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);
	
	ОткрытьФорму("Справочник.AMS_КаналыПродаж.ФормаВыбора", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьКаналПродажФилиала(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Истина, Ложь);
	
	ОткрытьФорму("Обработка.AMS_ДополнительныеФормы.Форма.ФормаВыбораМотивационнойПрограммыФилиалКанал", ПараметрыФормы, 
	ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДату(Команда)
	
	ПослеВводаДаты = Новый ОписаниеОповещения("ПерезаполнитьДату", ЭтотОбъект);
	ПоказатьВводДаты(ПослеВводаДаты,,"Выберите дату");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТаблицу(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Текст = "ru = ""Excel""; en = ""Excel""";
	Фильтр = НСтр(Текст)+"(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	
	Оповещение = Новый ОписаниеОповещения("СохранитьТабличныйДокументЗавершение", ЭтаФорма);
	ДиалогОткрытияФайла.Показать(Оповещение); 
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьКолонкуАгенты()
	
	Возврат Объект.УчастникиПрограммы.Выгрузить().ВыгрузитьКолонку("Агент");
	
КонецФункции

&НаСервере
Функция ВыгрузитьКолонкуКлючСвязи()
	
	Возврат Объект.Показатели.Выгрузить().ВыгрузитьКолонку("КлючСвязи");
	
КонецФункции

&НаКлиенте
Процедура УстановитьКлючиСтрокВознаграждения()
	
	Для каждого Стр Из Объект.Вознаграждения Цикл
		
		Если Не ЗначениеЗаполнено(Стр.КлючСвязи) Тогда
			
			Стр.КлючСвязи = Строка(Новый УникальныйИдентификатор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтрок()
	
	ТекущиеДанные = Элементы.Вознаграждения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ЭтоСложноеУсловие = ТекущиеДанные.СложноеУсловие;
	УстановитьВидимостьСтраницыУсловий();
	
	КлючСвязи = ТекущиеДанные.КлючСвязи;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("КлючСвязи", КлючСвязи);
	ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
	Элементы.Условия.ОтборСтрок 						= ОтборСтрок;
	Элементы.СложныеУсловияПрограммыТаблица.ОтборСтрок  = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючиСтрокУсловия()
	
	ИндексСтрокиУсловия = Объект.Вознаграждения.Индекс(Элементы.Вознаграждения.ТекущиеДанные);
	ВыделеннаяСтрока    = Объект.Вознаграждения.Получить(ИндексСтрокиУсловия);
	КлючСвязи = ВыделеннаяСтрока.КлючСвязи;
	
	Для каждого Стр Из Условия Цикл
		
		Если Не ЗначениеЗаполнено(Стр.КлючСвязи) Тогда
			
			Стр.КлючСвязи = КлючСвязи;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УсловияПараметрПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьУИД()
	Возврат Новый УникальныйИдентификатор();
КонецФункции

&НаСервере
Функция ПолучитьАгентовПоФилиалу(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_АгентскиеДоговоры.Владелец КАК Владелец,
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
	|	AMS_АгентскиеДоговоры.КаналПродаж.Ссылка КАК КаналПродаж
	|ИЗ
	|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|ГДЕ
	|	AMS_АгентскиеДоговоры.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Филиал", ВыбранноеЗначение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Агент", 	 Выборка.Владелец);
		СтруктураДанных.Вставить("Филиал", 	 Выборка.Филиал);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАгентовПоАгенту(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
	|	AMS_Агенты.Ссылка КАК Владелец
	|ИЗ
	|	Справочник.AMS_Агенты КАК AMS_Агенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ПО AMS_Агенты.Ссылка = AMS_АгентскиеДоговоры.Владелец
	|ГДЕ
	|	AMS_Агенты.Ссылка = &Агенты";
	
	Запрос.УстановитьПараметр("Агенты", ВыбранноеЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Агент", 	 Выборка.Владелец);
		СтруктураДанных.Вставить("Филиал", 	 Выборка.Филиал);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАгентовПоКаналам(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
	|	AMS_АгентскиеДоговоры.Владелец КАК Владелец
	|ИЗ
	|	Справочник.AMS_КаналыПродаж КАК AMS_КаналыПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|		ПО AMS_КаналыПродаж.Ссылка = AMS_АгентскиеДоговоры.КаналПродаж
	|ГДЕ
	|	AMS_КаналыПродаж.Ссылка = &Канал";
	
	Запрос.УстановитьПараметр("Канал", ВыбранноеЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Агент", 	 Выборка.Владелец);
		СтруктураДанных.Вставить("Филиал", 	 Выборка.Филиал);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАгентовПоФилиалуИКаналу(ВыбранноеЗначение)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AMS_АгентскиеДоговоры.Владелец КАК Владелец,
	|	AMS_АгентскиеДоговоры.Филиал КАК Филиал,
	|	AMS_АгентскиеДоговоры.КаналПродаж.Ссылка КАК КаналПродаж
	|ИЗ
	|	Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
	|ГДЕ
	|	AMS_АгентскиеДоговоры.Филиал = &Филиал
	|	И AMS_АгентскиеДоговоры.КаналПродаж = &КаналПродаж";
	
	Запрос.УстановитьПараметр("Филиал", ВыбранноеЗначение.Филиал);
	Запрос.УстановитьПараметр("КаналПродаж", ВыбранноеЗначение.КаналПродаж);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Агент", 	 Выборка.Владелец);
		СтруктураДанных.Вставить("Филиал", 	 Выборка.Филиал);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьУчастниковПрограммы(МассивАгентов)
	
	Для каждого Агент Из МассивАгентов Цикл 
		
		Отбор = Новый Структура("Агент", Агент.Агент);
		СтрокиТабличнойЧасти = Объект.УчастникиПрограммы.НайтиСтроки(Отбор);
		
		Если СтрокиТабличнойЧасти.Количество() = 0 Тогда
			
			СтрокаУчастников = Объект.УчастникиПрограммы.Добавить();
			СтрокаУчастников.Агент = Агент.Агент;
			СтрокаУчастников.Филиал = Агент.Филиал;
			СтрокаУчастников.ДатаНачалаДействия = ТекущаяДатаСеанса();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДату(Дата, ДополнительныеПараметры) Экспорт
	
	Если Дата = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого Участник Из Объект.УчастникиПрограммы Цикл
		
		Участник.ДатаНачалаДействия = Дата;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьКолонки()
	
	Объект.Показатели.Очистить();
	
	Для Каждого Вознаграждение Из Объект.Вознаграждения Цикл
		
		Отбор = Новый Структура("КлючСвязи", Вознаграждение.КлючСвязи);
		СтрокаТабличнойЧасти = Условия.НайтиСтроки(Отбор);
		
		МассивПараметров = Новый Массив;
		
		Для Каждого Параметр Из СтрокаТабличнойЧасти Цикл
			
			СтруктураПростыхУсловий = СтруктураПростыхУсловий();
			ЗаполнитьЗначенияСвойств(СтруктураПростыхУсловий, Параметр);
			МассивПараметров.Добавить(СтруктураПростыхУсловий);
			
		КонецЦикла;
		
		КонтрольноеЧисло = Справочники.AMS_КлючиУсловий.СоздатьКлючУсловий(МассивПараметров);
		
		ЗаполнитьДанныеФормы(КонтрольноеЧисло, Вознаграждение.КлючСвязи);
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы(КонтрольноеЧисло, КлючСвязи);
	
	ЗаполнитьПоказатели = Объект.Показатели.Добавить();
	ЗаполнитьПоказатели.КлючСвязи = КлючСвязи;
	ЗаполнитьПоказатели.КлючУсловий = Справочники.AMS_КлючиУсловий.НайтиПоРеквизиту("КонтрольноеЧисло", Строка(КонтрольноеЧисло));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловияПриСоздании();
	
	ОтборКлючСвязи = ВыгрузитьКолонкуКлючСвязи();
	
	Если ОтборКлючСвязи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_ИзменениеУсловийМотивационнойПрограммыПоказатели.КлючСвязи КАК КлючСвязи,
		|	AMS_ИзменениеУсловийМотивационнойПрограммыПоказатели.КлючУсловий КАК КлючУсловий
		|ИЗ
		|	Документ.AMS_ИзменениеУсловийМотивационнойПрограммы.Показатели КАК AMS_ИзменениеУсловийМотивационнойПрограммыПоказатели
		|ГДЕ
		|	AMS_ИзменениеУсловийМотивационнойПрограммыПоказатели.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 ЭтоПростойКлюч = AMS_КлючиУсловийСервер.ЭтоПростойКлюч(ВыборкаДетальныеЗаписи.КлючУсловий);
		 
		 Если ЭтоПростойКлюч Тогда
			 
			 Для каждого СтрокаКлюча Из ВыборкаДетальныеЗаписи.КлючУсловий.НаборУсловий Цикл
			 
			 	 СтрокаТаблицы = Условия.Добавить();
				 ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаКлюча);
				 СтрокаТаблицы.КлючСвязи = ВыборкаДетальныеЗаписи.КлючСвязи;
				 Если ЗначениеЗаполнено(СтрокаКлюча.ЗначениеПроизвольногоТипа) Тогда
					 СтрокаТаблицы.ЗначениеПроизвольногоТипа = СтрокаКлюча.ЗначениеПроизвольногоТипа.Получить();
				 КонецЕсли;
				 
			 КонецЦикла;
			 			 
		 Иначе
			 
			Для каждого СтрокаКлюча Из ВыборкаДетальныеЗаписи.КлючУсловий.НаборКлючей Цикл
			 
			 	 СтрокаТаблицы = СложныеУсловияПрограммы.Добавить();
				 СтрокаТаблицы.КлючСвязиСложногоУсловия = Строка(Новый УникальныйИдентификатор);
				 СтрокаТаблицы.КлючСвязи			    = ВыборкаДетальныеЗаписи.КлючСвязи;
				 СтрокаТаблицы.ОсновноеУсловие			= СтрокаКлюча.ОсновнойКлюч;
				 
				 Для каждого СтрокиКлюча Из СтрокаКлюча.КлючУсловий.НаборУсловий Цикл
					 
					  СтрокаУсловий = Условия.Добавить();
					  ЗаполнитьЗначенияСвойств(СтрокаУсловий, СтрокиКлюча);
					  СтрокаУсловий.КлючСвязи = ВыборкаДетальныеЗаписи.КлючСвязи;
				      СтрокаУсловий.КлючСвязиСложногоУсловия = СтрокаТаблицы.КлючСвязиСложногоУсловия;
					  СтрокаУсловий.ОсновноеУсловие = СтрокаТаблицы.ОсновноеУсловие;
					  
				 КонецЦикла;
				 
			 КонецЦикла; 
			 
		 КонецЕсли;	 
		 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьФилиалыПриСоздании();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТабличныйДокументЗавершение(Путь, ТекСтраница) Экспорт
	
	Если Путь = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Путь) = Тип("Строка") Тогда
		пПутьКФайлу = Путь;
	ИначеЕсли ТипЗнч(Путь) = Тип("Массив") Тогда
		пПутьКФайлу = Путь[0];
	Иначе
		Сообщить("Ошибка в имени файла!");
		Возврат;
	КонецЕсли;
	
	ТабДок = ДанныеТаблицыЗначенийВТабличныйДокумент();

	Строк = ТабДок.ВысотаТаблицы;
	Колонок = ТабДок.ШиринаТаблицы;
	
	Для счСтрока = 1 По Строк Цикл
		Для счКол = 1 По Колонок Цикл
			тОбл = ТабДок.Область(счСтрока, счКол);
			пТекст = тОбл.Примечание.Текст;
			Если НЕ ПустаяСтрока(пТекст) Тогда
				тОбл.Примечание.Текст = "";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Попытка
		
		ТабДок.Записать(пПутьКФайлу, ТипФайлаТабличногоДокумента.XLSX);
		ТабДок = Неопределено;
		ТекстСообщения = "Excel-файл сохранен: " + пПутьКФайлу;
		
	Исключение
		ТекстСообщения = "Не удалось созранить файл" + ОписаниеОшибки();
	КонецПопытки;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Функция ДанныеТаблицыЗначенийВТабличныйДокумент() //попробовать без построителя
	
	ДанныеВТабличныйДокумент = Объект.УчастникиПрограммы.Выгрузить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДанныеВТабличныйДокумент);
	Построитель.Вывести(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьСтраницыУсловий()
	
	ЭлементСложныеУсловияПрограммы  = Элементы.СложныеУсловияПрограммы;
	ЭлементПростыУсловия			= Элементы.ПростыеУсловия;
	
	Элементы.СтраницыУсловийПрограммы.ТекущаяСтраница = ?(ЭтоСложноеУсловие,
										ЭлементСложныеУсловияПрограммы,
										ЭлементПростыУсловия);
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьУдалитьЭлементСложныхУсловий()
	
	ТекущиеДанные = Элементы.Вознаграждения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;	

	Отбор = Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи);
	
	СтрокиУсловий = Условия.НайтиСтроки(Отбор);
	Для каждого СтрокаУсловий Из СтрокиУсловий Цикл
	
		Условия.Удалить(СтрокаУсловий);
	
	КонецЦикла;
	
	СтрокиУсловий = СложныеУсловияПрограммы.НайтиСтроки(Отбор);
	Для каждого СтрокаУсловий Из СтрокиУсловий Цикл
	
		СложныеУсловияПрограммы.Удалить(СтрокаУсловий);
	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьСложныхУсловий()

	Для каждого СложноеУсловие Из СложныеУсловияПрограммы Цикл
	
		СложноеУсловие.ПредставлениеУсловия = ПолучитьПредставлениеСложноеУсловие(СложноеУсловие)	
	
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьПредставлениеСложноеУсловие(СложноеУсловие)

	ИДСложногоУсловия = СложноеУсловие.КлючСвязиСложногоУсловия;
	Отбор = Новый Структура("КлючСвязиСложногоУсловия", ИДСложногоУсловия);
	
	СтрокиУсловий = Условия.НайтиСтроки(Отбор);
	
	Если СтрокиУсловий.Количество() = 0 Тогда
		
		Возврат "Добавить условия";
		
	КонецЕсли;

	Результат = "";
	
	Для каждого Строка Из СтрокиУсловий Цикл
	
		Результат = Результат + Строка.Параметр + " ";
		Результат = Результат + Строка.ОператорСравнения + " ";
	    Результат = Результат + Строка.Значение + ";";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СложныеУсловияПрограммыТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	НовыеУсловия = НЕ ЗначениеЗаполнено(ТекущиеДанные.КлючСвязиСложногоУсловия);
	
	ДанныеТекущихУсловий = Новый Массив;
	
	Если НовыеУсловия Тогда
		
		ТекущиеДанные.КлючСвязиСложногоУсловия = Строка(Новый УникальныйИдентификатор);
		
	КонецЕсли;	
	
	Отбор = Новый Структура("КлючСвязиСложногоУсловия", ТекущиеДанные.КлючСвязиСложногоУсловия);
	
	СтрокиПростыхУсловий = Условия.НайтиСтроки(Отбор);
	
	Для каждого СтрокаПростыхУсловий Из СтрокиПростыхУсловий Цикл
	
		СтруктураУсловия = СтруктураПростыхУсловий();
		ЗаполнитьЗначенияСвойств(СтруктураУсловия, СтрокаПростыхУсловий);
		ДанныеТекущихУсловий.Добавить(СтруктураУсловия);
	
	КонецЦикла;
	
	ПараметрыВыбораУсловий = Новый Структура("Условие", ДанныеТекущихУсловий); 
	ПараметрыВыбораУсловий.Вставить("КлючСвязиСложногоУсловия", ТекущиеДанные.КлючСвязиСложногоУсловия);
	ПараметрыВыбораУсловий.Вставить("КлючСвязи", ТекущиеДанные.КлючСвязи);
	ПараметрыВыбораУсловий.Вставить("ОсновноеУсловие", ТекущиеДанные.ОсновноеУсловие);
	
	ОткрытьФорму("Документ.AMS_ИзменениеУсловийМотивационнойПрограммы.Форма.ФормаВыбораДопУсловий", ПараметрыВыбораУсловий,,,,, 
											Новый ОписаниеОповещения("СложныеУсловияПрограммыТаблицаВыборЗавершение", ЭтотОбъект), 
											РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры

&НаКлиенте
Процедура СложныеУсловияПрограммыТаблицаВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;	
		
	Отбор = Новый Структура("КлючСвязиСложногоУсловия", Результат.КлючСвязиСложногоУсловия);
	
	СтрокиУсловий = Условия.НайтиСтроки(Отбор);
	Для каждого СтрокаУсловий Из СтрокиУсловий Цикл
	
		Условия.Удалить(СтрокаУсловий);
	
	КонецЦикла;
	
	СтрокиУсловий = СложныеУсловияПрограммы.НайтиСтроки(Отбор);
	Для каждого СтрокаУсловий Из СтрокиУсловий Цикл
	
		СложныеУсловияПрограммы.Удалить(СтрокаУсловий);
	
	КонецЦикла;
	
	Для каждого СтрокаУсловий Из Результат.Условие Цикл
	
		ТекСтрока = Условия.Добавить();
		ЗаполнитьЗначенияСвойств(ТекСтрока, СтрокаУсловий);
	
	КонецЦикла;
	
	ТекСтрока = СложныеУсловияПрограммы.Добавить();
	ЗаполнитьЗначенияСвойств(ТекСтрока, СтрокаУсловий);
	
	ОбновитьВидимостьСложныхУсловий();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураПростыхУсловий()

	Возврат AMS_КлючиУсловийСервер.СтруктураПростыхУсловий();
	
КонецФункции

&НаКлиенте
Процедура СложныеУсловияПрограммыТаблицаОсновноеУсловиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СложныеУсловияПрограммыТаблица.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторСложногоУсловия = ТекущиеДанные.КлючСвязиСложногоУсловия;
	
	СтрокиПростыхУсловий = Условия.НайтиСтроки(Новый Структура("КлючСвязиСложногоУсловия", ИдентификаторСложногоУсловия));
	
	Для каждого СтрокаПростогоУсловия Из СтрокиПростыхУсловий Цикл
	
		СтрокаПростогоУсловия.ОсновноеУсловие = ТекущиеДанные.ОсновноеУсловие;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьСложныхУсловий();
    ОбновитьВидимостьПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
		И ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
		Тогда
		
		Возврат;
		
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	ВыбратьЗначенияПараметра(ТекущиеДанные.ЗначениеПроизвольногоТипа,
								 		ТекущиеДанные.Параметр);
							 
								 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначенияПараметра(ТекущиеЗначения, Параметр) Экспорт
	
	ТипЗначенияСписка = AMS_РаботаСДиалогамиСервер.ТипПоПВХ(Параметр); 
	
	СписокРезультат = Новый СписокЗначений;
	СписокРезультат.ТипЗначения = ТипЗначенияСписка;
	
	Для каждого ЭлементСписка Из ТекущиеЗначения Цикл
	
		СписокРезультат.Добавить(ЭлементСписка.Значение);	
	
	КонецЦикла;
	
	ПараметрыВыбораТекущегоСписка = Новый Структура("СписокДанных", СписокРезультат);
	ОткрытьФорму("ОбщаяФорма.AMS_ВводСпискаЗначений", ПараметрыВыбораТекущегоСписка,,,,, Новый ОписаниеОповещения("ВыбратьЗначенияПараметраЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначенияПараметраЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
		И ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
		Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекущиеДанные.ЗначениеПроизвольногоТипа = Результат;
	ОбновитьВидимостьПредставления();	
КонецПроцедуры 

&НаКлиенте
Процедура УсловияЗначениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
		И ТекущиеДанные.ОператорСравнения <> ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
		Тогда
		
		Возврат;
		
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	ВыбратьЗначенияПараметра(ТекущиеДанные.ЗначениеПроизвольногоТипа,
								 		ТекущиеДанные.Параметр);
КонецПроцедуры

&НаКлиенте
Процедура УсловияПредставлениеУсловияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
		ИЛИ ТекущиеДанные.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
		Тогда
		
		ВыбратьЗначенияПараметра(ТекущиеДанные.ЗначениеПроизвольногоТипа,
								 		ТекущиеДанные.Параметр);
		
	Иначе
		
		ВыбратьФиксированныйТипЗначениеПараметра(ТекущиеДанные.Значение,
								 		ТекущиеДанные.Параметр);
		
	КонецЕсли;	
	
	ОбновитьВидимостьПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФиксированныйТипЗначениеПараметра(ТекущиеЗначения, Параметр) Экспорт
	
	ТипЗначенияСписка = AMS_РаботаСДиалогамиСервер.ТипПоПВХ(Параметр);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьФиксированныйТипЗначениеПараметраЗавершение",
												ЭтотОбъект);
	
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущиеЗначения, , ТипЗначенияСписка); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФиксированныйТипЗначениеПараметраЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	ТекущиеДанные.Значение = Результат;
	ОбновитьВидимостьПредставления();
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьВидимостьПредставления()
		
	Для каждого СтрокаУсловий Из Условия Цикл
	
		Если СтрокаУсловий.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.ВСписке")
			ИЛИ СтрокаУсловий.ОператорСравнения = ПредопределенноеЗначение("Справочник.AMS_ВидыСравнения.НеВСписке")
			Тогда
			
			СтрокаУсловий.ПредставлениеУсловия = СтрокаУсловий.ЗначениеПроизвольногоТипа;		
		Иначе
			
			СтрокаУсловий.ПредставлениеУсловия = СтрокаУсловий.Значение; 
			
		КонецЕсли;	
		
	КонецЦикла;
	Элементы.Условия.Обновить();
	
КонецПроцедуры	

#КонецОбласти

