
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьФорму();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМотивационныеПрограммы	

&НаКлиенте
Процедура МотивационныеПрограммыПриАктивизацииСтроки(Элемент)
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура МотивационныеПрограммыПриИзменении(Элемент)
	
	РассчитатьДокумент()

КонецПроцедуры

&НаКлиенте
Процедура ДоговорыПриИзменении(Элемент)
	
	РассчитатьДокумент();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Согласовать(Команда)
	Объект.Статус = ПредопределенноеЗначение("Перечисление.AMS_СтатусыРеестра.Согласован");
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Объект.Статус = ПредопределенноеЗначение("Перечисление.AMS_СтатусыРеестра.Отменен");
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	Объект.Статус = ПредопределенноеЗначение("Перечисление.AMS_СтатусыРеестра.Перерасчет");
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьСтрок()
	
	ТекущиеДанные = Элементы.МотивационныеПрограммы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСвязи = ТекущиеДанные.МотивационнаяПрограмма;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("МотивационнаяПрограмма", КлючСвязи);
	Элементы.Договоры.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьДокумент()
	
	ОбщаяСумма = 0;
	Для каждого СтрокаМП Из Объект.МотивационныеПрограммы Цикл
		
		СтрокиДоговоров = Объект.Договоры.НайтиСтроки(Новый Структура("МотивационнаяПрограмма", СтрокаМП.МотивационнаяПрограмма));
		СуммаПремии = 0;
		СуммаВознаграждения = 0; 
		
		Для каждого СтрокаДоговора Из СтрокиДоговоров Цикл
			
			Если НЕ СтрокаДоговора.Исключен Тогда
				
				СуммаПремии = СуммаПремии + СтрокаДоговора.Премия;
				СуммаВознаграждения = СуммаВознаграждения + СтрокаДоговора.ВознагражденийСумма;
				
			КонецЕсли;	
			
		КонецЦикла;
		
		СтрокаМП.СуммаПремии = СуммаПремии;
		СтрокаМП.СуммаВознаграждения = СуммаВознаграждения;
		ОбщаяСумма = ОбщаяСумма + СуммаВознаграждения;
		
	КонецЦикла;
	Объект.СуммаВознаграждения = ОбщаяСумма;
	
КонецПроцедуры

Процедура ОбновитьФорму()
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.AMS_СтатусыРеестра.Согласован") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти