#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедуры
// Первая версия модуля 29.08.2024

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Если Не ИсходныеДанные.Свойство("GUID") Тогда
		
		Комментарий = "Для справочника не заполнен обязательный реквизит ГУИД";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Подразделения", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		
		Возврат;
		
	КонецЕсли;	
		
	ИсходныеДанные		  = СериализацияИсходныхДанных(ИсходныеДанные);
		
	СсылкаНаОбъект 		  = Справочники.AMS_Подразделения.ПолучитьСсылку(ИсходныеДанные.УИД); 
	
	ПодразделенияОбъект				  = СсылкаНаОбъект.ПолучитьОбъект(); 
	
	Если ПодразделенияОбъект = Неопределено Тогда 
		
		ПодразделенияОбъект = Справочники.AMS_Подразделения.СоздатьЭлемент();
		
		ПодразделенияОбъект.УстановитьСсылкуНового(СсылкаНаОбъект); 
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПодразделенияОбъект, ИсходныеДанные);
	
	Попытка 
		
		ПодразделенияОбъект.Записать();
		
		Комментарий = СтрШаблон("Успешно записано подразделение с УИД %1", ИсходныеДанные.УИД);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Подразделения", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_Подразделения, ПодразделенияОбъект.Ссылка, Комментарий);
			
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Подразделения", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_Подразделения, ПодразделенияОбъект.Ссылка, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры  

Функция СериализацияИсходныхДанных(Данные)
	
	Попытка 
		
		СодержимоеСтруктуры = "УИД, Наименование, НаименованиеДляОтчетов, НаименованиеПолное, Заблокирован, ГуидВЮПро, ИдентификаторВЮПро,
								| РайонныйКоэффициент, РеквизитДопУпорядочивания";
		
		Результат = Новый Структура(СодержимоеСтруктуры);
		
		Результат.УИД = Новый УникальныйИдентификатор(Данные.GUID);
		
		Результат.Наименование = Данные.Наименование;
		Результат.НаименованиеДляОтчетов = Данные.НаименованиеДляОтчетов;
		Результат.НаименованиеПолное = Данные.НаименованиеПолное;
		Результат.Заблокирован = Булево(Данные.Заблокирован);
		Результат.ГуидВЮПро = Данные.ГуидВЮПро;
		Результат.ИдентификаторВЮПро = Данные.ИдентификаторВЮПро;
		Результат.РайонныйКоэффициент = Данные.РайонныйКоэффициент;
		Результат.РеквизитДопУпорядочивания = Данные.РеквизитДопУпорядочивания;
		
	Исключение 
		
		Результат = Неопределено;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Подразделения", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_Подразделения,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли