
#Область ПрограммныйИнтерфейс

Процедура ДобавитьОписаниеКлючаСвязи(СписокВыбора, КлючСвязи, НаименованияСсылок, КатегорияПродавца) Экспорт 
	
	ПредставлениеКлючаСвязи = "";
	
	Для Каждого Наименование из НаименованияСсылок Цикл
		ПредставлениеКлючаСвязи = ПредставлениеКлючаСвязи + Наименование.Значение + ";";
	КонецЦикла;
	
	НайденныйЭлемент = СписокВыбора.НайтиПоЗначению(КлючСвязи);
	
	Если Не НайденныйЭлемент = Неопределено Тогда
		НайденныйЭлемент.Представление = ПредставлениеКлючаСвязи;
	Иначе
		СписокВыбора.Добавить(КлючСвязи, ПредставлениеКлючаСвязи);
	КонецЕсли;	
		
КонецПроцедуры

Процедура УдалитьОписаниеКлючаСвязи(СписокВыбора, КлючСвязи) Экспорт
		
	НайденныйЭлемент = СписокВыбора.НайтиПоЗначению(КлючСвязи);
	
	СписокВыбора.Удалить(СписокВыбора.Индекс(НайденныйЭлемент));
			
КонецПроцедуры

Процедура ВидимостьПоказателейОсновные(Элементы, ВидПродукта) Экспорт
	
	ЭтоДополнение = Ложь; 
	
	ЭтоОсаго = ВидПродукта = Перечисления.AMS_ВидыСтраховыхПродуктов.ОСАГО;
	ЭтоИпотека = ВидПродукта = Перечисления.AMS_ВидыСтраховыхПродуктов.Ипотека;
	
	МассивПродуктов = ПолучитьМассивПродуктовОсновные();
	
	Элементы.ПоказателиКатегорияДоговора.Видимость = ЭтоОсаго;
	Элементы.КатегорияДоговора.Видимость = ЭтоОсаго;
	Элементы.ПоказателиЭтоЭлектронноеОсаго.Видимость = ЭтоОсаго;
	Элементы.ЭтоЭлектронноеОсаго.Видимость = ЭтоОсаго;
	
	Элементы.ПоказателиБанк.Видимость = ЭтоИпотека;
	Элементы.Банк.Видимость = ЭтоИпотека; 
	Элементы.ПоказателиГодСтрахования.Видимость = ЭтоИпотека;
	Элементы.ГодСтрахования.Видимость = ЭтоИпотека;
	
	ЭлементНайден = МассивПродуктов.Найти(ВидПродукта);
	
	Если ЭтоОсаго ИЛИ Не ЭлементНайден = Неопределено Тогда
		
		Элементы.ПоказателиКБМОт.Видимость = Истина;
		Элементы.ПоказателиКБМДо.Видимость = Истина;
		
		Элементы.КБМОт.Видимость = Истина;
		Элементы.КБМДо.Видимость = Истина;
		
	Иначе 
		
		Элементы.ПоказателиКБМОт.Видимость = Ложь;
		Элементы.ПоказателиКБМДо.Видимость = Ложь;
		
		Элементы.КБМОт.Видимость = Ложь;
		Элементы.КБМДо.Видимость = Ложь;
		
	КонецЕсли;
		
	ЭлементНайден = МассивПродуктов.Найти(ВидПродукта);

	Если Не ЭлементНайден = Неопределено Тогда
		
		Элементы.ПоказателиСтраховойПродукт.Видимость = Истина;
		Элементы.ПоказателиСтраховойРиск.Видимость = Истина;
		
		Элементы.СтраховойПродукт.Видимость = Истина;
		Элементы.СтраховойРиск.Видимость = Истина;
		
	Иначе
		
		Элементы.ПоказателиСтраховойПродукт.Видимость = Ложь;
		Элементы.ПоказателиСтраховойРиск.Видимость = Ложь;
		//Элементы.СтраховойПродукт.Видимость = Ложь;
		//Элементы.СтраховойРиск.Видимость = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ВидимостьПоказателейДополнительные(Элементы, ВидПродукта) Экспорт
	
	ЭтоДополнение = Истина;
	
	ЭтоОсаго = ВидПродукта = Перечисления.AMS_ВидыСтраховыхПродуктов.ОСАГО;
	ЭтоИпотека = ВидПродукта = Перечисления.AMS_ВидыСтраховыхПродуктов.Ипотека;
	ЭтоПроизвольный = ВидПродукта = Перечисления.AMS_ВидыСтраховыхПродуктов.Произвольный;
	
	МассивПродуктов = ПолучитьМассивПродуктовОсновные();
	МассивКаско = ПолучитьМассивКаско();
	
	Элементы.ПоказателиКатегорияДоговора.Видимость = ЭтоОсаго; 
	
	Элементы.ПоказателиЭтоЭлектронноеОсаго.Видимость = ЭтоОсаго; 
	
	Элементы.ЦелиИспользованияТС.Видимость = ЭтоОсаго;  
	
	Элементы.РегионСобственника.Видимость = ЭтоОсаго;
	
	Элементы.ПрограммаПереход.Видимость = ЭтоОсаго;
	
	Элементы.ПоказателиБанк.Видимость = ЭтоИпотека;
	Элементы.ПоказателиГодСтрахования.Видимость = ЭтоИпотека;
	
	ЭлементНайден = МассивКаско.Найти(ВидПродукта);
	
	Если ЭтоОсаго ИЛИ Не ЭлементНайден = Неопределено Тогда
		
		Элементы.ПоказателиКБМОт.Видимость = Истина;
		Элементы.ПоказателиКБМДо.Видимость = Истина;
		
	Иначе 
		
		Элементы.ПоказателиКБМОт.Видимость = Ложь;
		Элементы.ПоказателиКБМДо.Видимость = Ложь;
			
	КонецЕсли;
	
	ЭлементНайден = МассивПродуктов.Найти(ВидПродукта);
	
	Если Не ЭлементНайден = Неопределено Тогда
		
		Элементы.ПоказателиСтраховойПродукт.Видимость = Истина;
		
	Иначе 
		
		Элементы.ПоказателиСтраховойПродукт.Видимость = Ложь;
		
	КонецЕсли;
	
	ИзменитьМассивПродуктов(МассивПродуктов);
	
	ЭлементНайден = МассивПродуктов.Найти(ВидПродукта);
	
	Если Не ЭлементНайден = Неопределено Тогда
		
		Элементы.ПоказателиПролонгация.Видимость = Истина;
		
	Иначе 
		
		Элементы.ПоказателиПролонгация.Видимость = Ложь;
		
	КонецЕсли;
	
	ЭлементНайден = МассивКаско.Найти(ВидПродукта);
	
	Если ЭтоПроизвольный ИЛИ Не ЭлементНайден = Неопределено Тогда
		
		Элементы.ПоказателиПрограммаПеревод.Видимость = Ложь; 
		
	Иначе  
		
		Элементы.ПоказателиПрограммаПеревод.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры	                                                                        

#КонецОбласти 

                                                                      
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМассивПродуктовОсновные()
	
	МассивПродуктов = Новый Массив;
	
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.КАСКО);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.ЗКАСКО);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.Произвольный);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.Ответственность);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.НесчастныеСлучаи);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.ПредпринимательскиеРиски);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.ДГО);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.Грузы);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.ЛичноеСтрахование);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.СтрахованиеИмущества);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.ВЗР);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.КУГИ);
		
	Возврат МассивПродуктов;
	
КонецФункции

Функция ПолучитьМассивКаско()
	
	МассивКАСКО = Новый Массив;
	
	МассивКАСКО.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.КАСКО);
	МассивКАСКО.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.ЗКАСКО);
	
	Возврат МассивКАСКО;
	
КонецФункции

Процедура ИзменитьМассивПродуктов(МассивПродуктов)
	
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.ОСОПО);
	МассивПродуктов.Добавить(Перечисления.AMS_ВидыСтраховыхПродуктов.ЗК);
	
	МассивПродуктов.Удалить(МассивПродуктов.Найти(Перечисления.AMS_ВидыСтраховыхПродуктов.ВЗР));
	МассивПродуктов.Удалить(МассивПродуктов.Найти(Перечисления.AMS_ВидыСтраховыхПродуктов.ДГО));
		
КонецПроцедуры

#КонецОбласти