#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт

	Идентификаторы = ИдентификаторыПредопределенныхДанных();
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
	
		ВознаграждениеОбъект = КлючЗначение.Ключ.ПолучитьОбъект();
		ВознаграждениеОбъект.ГУИД = КлючЗначение.Значение;
		ВознаграждениеОбъект.ГУИДЦССУ = КлючЗначение.Значение;
		ВознаграждениеОбъект.ОбменДанными.Загрузка = Истина;
		ВознаграждениеОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт

	Результат = ПолучитьСтруктуруСообщения();
	
	ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);	 	 
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	//Данные = СтрЗаменить(Данные, """""", "null");
	 
	Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)
	
	Реквизиты = "ГУИД, Наименование";
	ДанныеКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты);	
	
	Результат.guid					 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ГУИД);
	Результат.name 				 	 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Наименование);
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "CommissionType");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедуры

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Если Не ИсходныеДанные.Свойство("GUID") Тогда
		
		Комментарий = "Для справочника не заполнен обязательный реквизит ГУИД";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Виды вознаграждений", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		
		Возврат;
		
	КонецЕсли;	
		
	ИсходныеДанные		  = СериализацияИсходныхДанных(ИсходныеДанные);
		
	СсылкаНаОбъект 		  = Справочники.AMS_ВидыВознаграждений.ПолучитьСсылку(ИсходныеДанные.УИД); 
	
	ВидыВознагражденийОбъект				  = СсылкаНаОбъект.ПолучитьОбъект(); 
	
	Если ВидыВознагражденийОбъект = Неопределено Тогда 
		
		ВидыВознагражденийОбъект = Справочники.AMS_ВидыВознаграждений.СоздатьЭлемент();
		
		ВидыВознагражденийОбъект.УстановитьСсылкуНового(СсылкаНаОбъект); 
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ВидыВознагражденийОбъект, ИсходныеДанные);
	
	Попытка 
		
		ВидыВознагражденийОбъект.Записать();
		
		Комментарий = СтрШаблон("Успешно записан вид вознаграждения с УИД %1", ИсходныеДанные.УИД);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Виды вознаграждений", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_ВидыВознаграждений, ВидыВознагражденийОбъект.Ссылка, Комментарий);
			
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Виды вознаграждений", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_ВидыВознаграждений, ВидыВознагражденийОбъект.Ссылка, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры  

Функция СериализацияИсходныхДанных(Данные)
	
	Попытка
		
		СодержимоеСтруктуры = "УИД, Наименование, НаименованиеПолное, ПометкаУдаления, Отключен";
		
		Результат = Новый Структура(СодержимоеСтруктуры);
		
		Результат.УИД = Новый УникальныйИдентификатор(Данные.ГУИД);
		
		Результат.Наименование		 = Данные.Наименование;
		Результат.НаименованиеПолное = Данные.НаименованиеПолное;
		Результат.ПометкаУдаления	 = Булево(Данные.ПометкаУдаления);
		Результат.Отключен			 = Булево(Данные.Отключен);
		
	Исключение
		
		Результат = Неопределено;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Виды вознаграждений", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_ВидыВознаграждений,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанных()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_ВидыВознаграждений.БКВ, "909c5fb3-c3df-4c76-9a3c-4a8322686a38");
	Результат.Вставить(Справочники.AMS_ВидыВознаграждений.ДКВ, "7b91f716-cd00-4406-8c69-03a6d7be7f06");
	Результат.Вставить(Справочники.AMS_ВидыВознаграждений.КВБ, "659f59af-787c-4e53-90aa-394593e95218");
	Результат.Вставить(Справочники.AMS_ВидыВознаграждений.ВМП, "e1c365c7-b241-4861-88a6-68a21fe670b8");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#КонецЕсли