#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Для Каждого Строка Из ИсходныеДанные Цикл
		
		Если Не Строка.Свойство("Контрагент") Тогда
			
			Комментарий = "Для справочника не заполнен обязательный реквизит Контрагент";
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Агенты", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			
			Возврат;
			
		КонецЕсли;	
		
		
		СправочникЭлемент = Справочники.AMS_Агенты.НайтиПоРеквизиту("ГУИДЦССУ", Строка.Контрагент); 
		
		Если СправочникЭлемент.Пустая() Тогда
			
			СправочникЭлемент = Справочники.AMS_Агенты.НайтиПоРеквизиту("ГУИДЦССУ", Строка.ГУИД);
			
		КонецЕсли;
		
		Если СправочникЭлемент.Пустая() Тогда 
							
			АгентОбъект = Справочники.AMS_Агенты.СоздатьЭлемент();
			
		Иначе
			
			АгентОбъект = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(АгентОбъект, Строка, "Наименование");
		
		Если Не Строка.ЭтоГруппа Тогда 
			
			ЗаполнитьЗначенияСвойств(АгентОбъект, Строка);
			
		КонецЕсли;
		
		ДозаполнитьОбъектФизЛица(АгентОбъект, Строка, Строка.ЭтоГруппа);
		
		Попытка
			
			АгентОбъект.ОбменДанными.Загрузка = Истина;
			АгентОбъект.Записать();
			
			Комментарий = СтрШаблон("Успешно записано физические лицо с УИД %1", Строка.Контрагент);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Агенты", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_Агенты, АгентОбъект.Ссылка, Комментарий);
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Агенты", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_Агенты, АгентОбъект.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	                                                                
КонецПроцедуры

Процедура ДозаполнитьОбъектФизЛица(АгентЛицаОбъект, Строка, ЭтоГруппа) 
	
	АгентЛицаОбъект.Родитель = Справочники.AMS_Агенты.НайтиПоРеквизиту("ГУИДЦССУ", Строка.Родитель);
	АгентЛицаОбъект.ГУИДЦССУ = Строка.Контрагент;
	АгентЛицаОбъект.ГУИД = Строка.ГУИД;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	
	АгентЛицаОбъект.ТипКонтрагента = Перечисления.AMS_ТипыКонтрагентов[Строка.ТипКонтрагента];
	АгентЛицаОбъект.СтавкаНДС = Перечисления.AMS_СтавкиНДС[Строка.СтавкаНДС];
	Если НЕ Строка.ЭтоБанк Тогда
		АгентЛицаОбъект.ТипАгента = Перечисления.AMS_ТипыАгентовПоСпособуПродаж[Строка.ТипАгента];
		АгентЛицаОбъект.ФизическоеЛицо = ЭлементСправочникаПоЦССУ("AMS_ФизическиеЛица", Строка.ФизЛицо);
	КонецЕсли;	
	
	АгентЛицаОбъект.КонтактнаяИнформация.Очистить();
	
	Для Каждого СтрокаКИ Из Строка.КонтактнаяИнформация Цикл
		
		НоваяСтрока = АгентЛицаОбъект.КонтактнаяИнформация.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКИ);
		
		Если НЕ СтрокаКИ.Тип = "ИнаяИнформация" Тогда
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации[СтрокаКИ.Тип];
		КонецЕсли;
		
		Если Не СтрокаКИ.Вид = "ИнаяИнформация" Тогда
			НоваяСтрока.Вид = Справочники.ВидыКонтактнойИнформации[СтрокаКИ.Вид];
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ДанныеПоСсылке(ОбъектСсылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AMS_Агенты.ГУИД КАК ГУИД,
		|	AMS_Агенты.Ссылка КАК Ссылка,
		|	AMS_Агенты.НаименованиеПолное КАК Наименование,
		|	AMS_Агенты.ТабельныйНомер КАК ТабельныйНомер,
		|	AMS_Агенты.ТипАгента КАК ТипАгента,
		|	AMS_Агенты.ТипКонтрагента КАК ТипКонтрагента,
		|	AMS_АгентскиеДоговоры.УдержаниеКомиссии КАК УдержаниеКомиссии,
		|	НЕ AMS_АгентскиеДоговоры.УдерживаетПВ КАК УдерживаетПВ,
		|	AMS_Агенты.ОтображатьРейтинг КАК ОтображатьРейтинг,
		|	AMS_АгентскиеДоговоры.РегистрационныйНомер КАК РегистрационныйНомер,
		|	AMS_АгентскиеДоговоры.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	AMS_Агенты.СтавкаНДС КАК СтавкаНДС,
		|	AMS_АгентскиеДоговоры.ПериодичностьВыплатыКВ КАК ПериодичностьВыплатыКВ,
		|	AMS_АгентскиеДоговоры.Филиал.ГУИДФилиалаВЮПро КАК ГУИДФилиалаВЮПро,
		|	AMS_Агенты.ИНН КАК ИНН,
		|	AMS_Агенты.КПП КАК КПП,
		|	AMS_Агенты.Уволен КАК Уволен
		|ИЗ
		|	Справочник.AMS_Агенты КАК AMS_Агенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АгентскиеДоговоры КАК AMS_АгентскиеДоговоры
		|		ПО (AMS_АгентскиеДоговоры.Владелец = AMS_Агенты.Ссылка)
		|ГДЕ
		|	AMS_Агенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции	
	
#КонецОбласти

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт
	
	 Результат = ПолучитьСтруктуруСообщения();
	 ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);
	 
	 Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	 Данные = СтрЗаменить(Данные, """""", "null");
	 
	 Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)

	ДанныеПродавца = ДанныеПоСсылке(ОбъектСсылка);
	
	Если НЕ ЗначениеЗаполнено(ДанныеПродавца.ГУИД) Тогда
		Возврат;
	КонецЕсли;	
	
	Результат.guid					 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ГУИД);
	Результат.fullName 				 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.Наименование);
	Результат.personnelNumber 		 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ТабельныйНомер);
	Результат.typeGuid 		 		 = ПреобразоватьЗначениеДляJSON(Перечисления.AMS_ТипыКонтрагентов.ПолучитьГУИД(ДанныеПродавца.ТипКонтрагента));
	Результат.withholdReward 		 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.УдержаниеКомиссии);
	Результат.withholdExtraReward 	 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.УдерживаетПВ);
	Результат.viewRating 	 		 = ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ОтображатьРейтинг);
	
	Результат.agreementNumber	= ПреобразоватьЗначениеДляJSON(ДанныеПродавца.РегистрационныйНомер); 
	Результат.agreementDate		= ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ДатаНачалаДействия);
	Результат.nds				= ЗначениеСтавкиНДС(ДанныеПродавца.СтавкаНДС);
	Результат.registryPeriod	= Строка(ДанныеПродавца.ПериодичностьВыплатыКВ);
	Результат.filialGuid		= ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ГУИДФилиалаВЮПро);
	Результат.inn				= ПреобразоватьЗначениеДляJSON(ДанныеПродавца.ИНН);
	Результат.kpp				= ПреобразоватьЗначениеДляJSON(ДанныеПродавца.КПП);
	Результат.dismissed			= ПреобразоватьЗначениеДляJSON(ДанныеПродавца.Уволен);
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "IntermediateSeller");
	Результат.Вставить("guid");
	Результат.Вставить("fullName");
	Результат.Вставить("personnelNumber");
	Результат.Вставить("typeGuid");
	Результат.Вставить("withholdReward");
	Результат.Вставить("withholdExtraReward");
	Результат.Вставить("viewRating");
	Результат.Вставить("agreementNumber");
	Результат.Вставить("agreementDate");
	Результат.Вставить("nds");
	Результат.Вставить("registryPeriod");
	Результат.Вставить("filialGuid");
	Результат.Вставить("inn");
	Результат.Вставить("kpp");
	Результат.Вставить("dismissed");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

Функция ЗначениеСтавкиНДС(СтавкаНДС)
	
	Результат = Неопределено;
	
	Если СтавкаНДС = Перечисления.AMS_СтавкиНДС.НДС10 Тогда
		Результат = 10;
	ИначеЕсли СтавкаНДС = Перечисления.AMS_СтавкиНДС.НДС15 Тогда	
		Результат = 15;
	ИначеЕсли СтавкаНДС = Перечисления.AMS_СтавкиНДС.НДС18 Тогда	
		Результат = 18;	
	ИначеЕсли СтавкаНДС = Перечисления.AMS_СтавкиНДС.НДС20 Тогда	
		Результат = 20;
	ИначеЕсли СтавкаНДС = Перечисления.AMS_СтавкиНДС.НДС22 Тогда	
		Результат = 22;	
	ИначеЕсли СтавкаНДС = Перечисления.AMS_СтавкиНДС.НДС5 Тогда	
		Результат = 5;
	ИначеЕсли СтавкаНДС = Перечисления.AMS_СтавкиНДС.НДС7 Тогда	
		Результат = 7;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	
	
#КонецОбласти

#КонецЕсли
