#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ГУИД = "";
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НеПроверяемыеРеквизиты = Новый Массив();
	
	Если НЕ ТипКонтрагента = Перечисления.AMS_ТипыКонтрагентов.ЮридическоеЛицо Тогда
		НеПроверяемыеРеквизиты.Добавить("КПП");
	КонецЕсли;
	
	ОбщегоНазначенияAMS.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры



#КонецОбласти