#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ВыполнитьОбновлениеПредопределенных() Экспорт;
	
	Идентификаторы					 = ИдентификаторыПредопределенныхДанныхГУИД();
	ИдентификаторыВидСравнения		 = ИдентификаторыПредопределенныхДанныхВидСравнения(); 
	
	Для каждого КлючЗначение Из Идентификаторы Цикл
		
		ВидыСравненияОбъект					 = КлючЗначение.Ключ.ПолучитьОбъект();
		ВидыСравненияОбъект.ГУИД			 = КлючЗначение.Значение;
		ВидыСравненияОбъект.ВидСравнения	 = ИдентификаторыВидСравнения.Получить(КлючЗначение.Ключ);
		ВидыСравненияОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыПредопределенныхДанныхГУИД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_ВидыСравнения.Равно,				 "9821d79b-0d62-4543-84cd-4a4da5430173");
	Результат.Вставить(Справочники.AMS_ВидыСравнения.НеРавно,			 "ba2ff6a3-084f-4f17-9f28-160f6a06af73");
	Результат.Вставить(Справочники.AMS_ВидыСравнения.БольшеИлиРавно,	 "fb270718-9ba1-4964-8740-5f1ec9bd6ab2");
	Результат.Вставить(Справочники.AMS_ВидыСравнения.МеньшеИлиРавно,	 "9292d0b4-9120-4cf1-b6d5-647b34bc01a7");
	Результат.Вставить(Справочники.AMS_ВидыСравнения.Больше,			 "11512b17-3226-482b-8fe9-e6bf9d16dfed");
	Результат.Вставить(Справочники.AMS_ВидыСравнения.Меньше,			 "2b4fb433-92e5-429b-ae61-fc598ca7c904");
	Результат.Вставить(Справочники.AMS_ВидыСравнения.Заполнено,			 "9d1c4e32-7e8b-4aed-bb38-4bce44978134");
	Результат.Вставить(Справочники.AMS_ВидыСравнения.НеЗаполнено,		 "ee7b28b7-4f44-43fc-82eb-c6ceb6d24e5d");
	Результат.Вставить(Справочники.AMS_ВидыСравнения.ВСписке,			 "aa161c66-f912-4121-82b5-e25d84f772d0");
	Результат.Вставить(Справочники.AMS_ВидыСравнения.НеВСписке,			 "44b7b02a-271c-4302-89e7-d61ab282f0d8");
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыПредопределенныхДанныхВидСравнения()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Справочники.AMS_ВидыСравнения.Равно,				 Перечисления.AMS_ВидыСравнения.Равно);
	Результат.Вставить(Справочники.AMS_ВидыСравнения.НеРавно,			 Перечисления.AMS_ВидыСравнения.НеРавно);
	Результат.Вставить(Справочники.AMS_ВидыСравнения.БольшеИлиРавно,	 Перечисления.AMS_ВидыСравнения.БольшеИлиРавно);
	Результат.Вставить(Справочники.AMS_ВидыСравнения.МеньшеИлиРавно,	 Перечисления.AMS_ВидыСравнения.МеньшеИлиРавно);
	Результат.Вставить(Справочники.AMS_ВидыСравнения.Больше,			 Перечисления.AMS_ВидыСравнения.Больше);
	Результат.Вставить(Справочники.AMS_ВидыСравнения.Меньше,			 Перечисления.AMS_ВидыСравнения.Меньше);
	Результат.Вставить(Справочники.AMS_ВидыСравнения.Заполнено,			 Перечисления.AMS_ВидыСравнения.Заполнено);
	Результат.Вставить(Справочники.AMS_ВидыСравнения.НеЗаполнено,		 Перечисления.AMS_ВидыСравнения.НеЗаполнено);
	Результат.Вставить(Справочники.AMS_ВидыСравнения.ВСписке,			 Перечисления.AMS_ВидыСравнения.ВСписке);
	Результат.Вставить(Справочники.AMS_ВидыСравнения.НеВСписке,			 Перечисления.AMS_ВидыСравнения.НеВСписке);
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли