#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Для Каждого Строка Из ИсходныеДанные Цикл 
		
		Если Не Строка.Свойство("ПравилоСтрахования") Тогда
			
			Комментарий = "Для справочника не заполнен обязательный реквизит ПравилоСтрахования";
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Правила Страхования", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			
			Возврат;
			
		КонецЕсли;	
		
		СправочникЭлемент = Справочники.AMS_ПравилаСтрахования.НайтиПоРеквизиту("ГУИДЦССУ", Строка.ПравилоСтрахования); 
		
		Если СправочникЭлемент.Пустая() Тогда 
			
			Если Строка.ЭтоГруппа Тогда
				
				СправочникОбъект = Справочники.AMS_ПравилаСтрахования.СоздатьГруппу();
				
			Иначе
				
				СправочникОбъект = Справочники.AMS_ПравилаСтрахования.СоздатьЭлемент();
				
			КонецЕсли;	
			
		Иначе
			
			СправочникОбъект = СправочникЭлемент.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка, "Наименование");
		
		Если Не Строка.ЭтоГруппа Тогда 
			
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка);
			
		КонецЕсли;
		
		ДозаполнитьОбъектФизЛица(СправочникОбъект, Строка, Строка.ЭтоГруппа);
		
		Попытка
			
			СправочникОбъект.Записать();
			
			Комментарий = СтрШаблон("Успешно записана функциональная принадлежность с УИД %1", Строка.ПравилоСтрахования);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Правила Страхования", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_ПравилаСтрахования, СправочникОбъект.Ссылка, Комментарий);
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Правила Страхования", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_ПравилаСтрахования, СправочникОбъект.Ссылка, ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ДозаполнитьОбъектФизЛица(АгентЛицаОбъект, Строка, ЭтоГруппа) 
	
	АгентЛицаОбъект.Родитель = Справочники.AMS_ПравилаСтрахования.НайтиПоРеквизиту("ГУИДЦССУ", Строка.Родитель);
	АгентЛицаОбъект.ГУИДЦССУ = Строка.ПравилоСтрахования;
	АгентЛицаОбъект.ГУИД = Строка.ГУИД;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли