#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить данные продавца
//
// Параметры:
//  ДатаСреза		 - Дата - дата на которую необходимо получить информацию об агенте 
//  Агент			 - Массив, СправочникСсылка.AMS_Агенты	 - список или агент для которых нужна информация по продавцу(-цам)
//  АгентскийДоговор - Массив, СправочникСсылка.AMS_АгентскиеДоговоры	 - список или агентский договор для которых нужна информация по продавцу(-цам)
//  Продавец		 - Массив, СправочникСсылка.AMS_Продавцы	 - список или продавцов для которых нужна информация
// 
// Возвращаемое значение:
//  Массив - массив структур 
//
Функция ПолучитьДанныеПродавца(ДатаСреза = Неопределено, Агент = Неопределено, АгентскийДоговор = Неопределено, Продавец = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДатаСеанса();		
	КонецЕсли;
	
	ОтборПоАгенту = ЗначениеЗаполнено(Агент);
	ОтборПоАгентскомуДоговору = ЗначениеЗаполнено(АгентскийДоговор);
	ОтборПоПродавцу = ЗначениеЗаполнено(Продавец);
	
	Если ОтборПоАгенту Тогда
		
		МассивАгентов = Агент;
		
		Если Не ТипЗнч(МассивАгентов) = Тип("Массив") Тогда
			МассивАгентов = Новый Массив;
			МассивАгентов.Добавить(Агент);
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ОтборПоАгентскомуДоговору Тогда
		
		МассивАгентскихДоговоров = АгентскийДоговор;
		
		Если Не ТипЗнч(МассивАгентов) = Тип("Массив") Тогда
			МассивАгентскихДоговоров = Новый Массив;
			МассивАгентскихДоговоров.Добавить(АгентскийДоговор);
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ОтборПоПродавцу Тогда
		
		МассивПродавцов = Продавец;
		
		Если Не ТипЗнч(МассивАгентов) = Тип("Массив") Тогда
			МассивПродавцов = Новый Массив;
			МассивПродавцов.Добавить(Продавец);
		КонецЕсли;	
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AMS_ИнформацияОПродавцеСрезПоследних.Продавец КАК Продавец,
	|	AMS_ИнформацияОПродавцеСрезПоследних.Агент КАК Агент,
	|	AMS_ИнформацияОПродавцеСрезПоследних.АгентскийДоговор КАК АгентскийДоговор,
	|	AMS_ИнформацияОПродавцеСрезПоследних.Уволен КАК Уволен,
	|	AMS_ИнформацияОПродавцеСрезПоследних.Куратор КАК Куратор,
	|	AMS_ИнформацияОПродавцеСрезПоследних.ВидТерритории КАК ВидТерритории,
	|	AMS_ИнформацияОПродавцеСрезПоследних.КаналПродаж КАК КаналПродаж,
	|	AMS_ИнформацияОПродавцеСрезПоследних.ПодканалПродаж КАК ПодканалПродаж,
	|	AMS_ИнформацияОПродавцеСрезПоследних.ФункциональнаяПринадлежность КАК ФункциональнаяПринадлежность,
	|	AMS_ИнформацияОПродавцеСрезПоследних.ВидОперации КАК ВидОперации
	|ИЗ
	|	РегистрСведений.AMS_ИнформацияОПродавце.СрезПоследних(
	|			&ДатаСреза,
	|			ВЫБОР
	|					КОГДА &ОтборПоАгенту
	|						ТОГДА Агент В (&СписокАгентов)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ОтборПоАгентскомуДоговору
	|						ТОГДА Агент В (&СписокАгентскихДоговоров)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ОтборПоПродавцу
	|						ТОГДА Агент В (&СписокПродавцов)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК AMS_ИнформацияОПродавцеСрезПоследних";
	
	
	Запрос.УстановитьПараметр("ОтборПоАгенту", ОтборПоАгенту);
	Запрос.УстановитьПараметр("СписокАгентов", МассивАгентов);
	Запрос.УстановитьПараметр("ОтборПоАгентскийДоговор", ОтборПоАгентскомуДоговору);
	Запрос.УстановитьПараметр("СписокАгентскихДоговоров", МассивАгентскихДоговоров);
	Запрос.УстановитьПараметр("ОтборПоПродавцу", ОтборПоПродавцу);
	Запрос.УстановитьПараметр("СписокПродавцов", МассивПродавцов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	МассивПродавцов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПродавцов.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка));
	КонецЦикла;	
	
	Возврат МассивПродавцов;
	
КонецФункции

#КонецОбласти

#КонецЕсли