
Процедура ПриЗаписи(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.Куратор)
			ИЛИ НЕ ЗначениеЗаполнено(Запись.Агент) Тогда
			Продолжить;
		КонецЕсли;
		
		АгентОбъект = Запись.Куратор.Получитьобъект();
		АгентОбъект.Куратор = Истина;
		АгентОбъект.ОбменДанными.Загрузка = Истина;
		АгентОбъект.Записать();
		
		Куратор = РегистрыСведений.СоответствиеКураторовАгентам.СоздатьКуратораПоАгенту(Запись.Куратор);	
	    РегистрыСведений.СоответствиеКураторовАгентам.ЗаписатьСоответствие(Запись.Агент, Куратор);
		
	КонецЦикла;
	
КонецПроцедуры
