
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.ДатаДобавленияЗаписи) Тогда
		 Запись.ДатаДобавленияЗаписи = ТекущаяДатаСеанса();
	КонецЕсли;
	 
	Если НЕ ЗначениеЗаполнено(Запись.Ответственный) Тогда
		
		Запись.Ответственный = Пользователи.ТекущийПользователь();
		
	КонецЕсли;	
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти