#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедуры

Процедура СформироватьИзменитьЭлементСправочника(ИсходныеДанные) Экспорт
	
	Если Не ИсходныеДанные.Свойство("GUID") Тогда
		
		Комментарий = "Для справочника не заполнен обязательный реквизит ГУИД";
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Филиалы", УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		
		Возврат;
		
	КонецЕсли;	
		
	ИсходныеДанные		  = СериализацияИсходныхДанных(ИсходныеДанные);
		
	СсылкаНаОбъект 		  = Справочники.AMS_Филиалы.ПолучитьСсылку(ИсходныеДанные.УИД); 
	
	ФилиалыОбъект				  = СсылкаНаОбъект.ПолучитьОбъект(); 
	
	Если ФилиалыОбъект = Неопределено Тогда 
		
		ФилиалыОбъект = Справочники.AMS_Филиалы.СоздатьЭлемент();
		
		ФилиалыОбъект.УстановитьСсылкуНового(СсылкаНаОбъект); 
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ФилиалыОбъект, ИсходныеДанные);
	
	Попытка 
		
		ФилиалыОбъект.Записать();
		
		Комментарий = СтрШаблон("Успешно записан филиал с УИД %1", ИсходныеДанные.УИД);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Филиалы", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.AMS_Филиалы, ФилиалыОбъект.Ссылка, Комментарий);
			
	Исключение 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Филиалы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_Филиалы, ФилиалыОбъект.Ссылка, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры  

Функция СериализацияИсходныхДанных(Данные)
	
	Попытка
		
		СодержимоеСтруктуры = "УИД, Наименование, НаименованиеПолное, ПометкаУдаления, КодФилиала, УровеньФилиала,
								| РеквизитДопУпорядочивания, Заблокирован, КраткоеНаименование, 
								| НаименованиеФилиалаВЮПро, ГУИДФилиалаВЮПро, ИдентификаторЮПро, Отключен";
		
		Результат = Новый Структура(СодержимоеСтруктуры);
		
		Результат.УИД = Новый УникальныйИдентификатор(Данные.ГУИД);
				
		Результат.Наименование					 = Данные.Наименование;
		Результат.НаименованиеПолное			 = Данные.ПолноеНаименование;
		Результат.ПометкаУдаления				 = Булево(Данные.ПометкаУдаления);
		Результат.КодФилиала					 = Данные.КодФилиала;
		Результат.УровеньФилиала				 = Данные.УровеньФилиала;
		Результат.РеквизитДопУпорядочивания		 = Данные.РеквизитДопУпорядочивания;
		Результат.Заблокирован					 = Булево(Данные.Заблокирован);
		Результат.КраткоеНаименование			 = Данные.КраткоеНаименование;
		Результат.НаименованиеФилиалаВЮПро		 = Данные.НаименованиеФилиалаВЮПро;
		Результат.ГУИДФилиалаВЮПро				 = Данные.ГУИДФилиалаВЮПро;
		Результат.ИдентификаторЮПро				 = Данные.ИдентификаторЮПро;
		Результат.Отключен						 = Булево(Данные.Отключен);
			

		
	Исключение 
		
		Результат = Неопределено;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Загрузка справочника Филиалы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.AMS_Филиалы,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияМАМС

Функция СформироватьСообщениеДляМАМС(ОбъектСсылка) Экспорт

	Результат = ПолучитьСтруктуруСообщения();
	
	ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат);	 	 
	Данные = ОбменДаннымиAMS.СформироватьСтрокуJSON(Результат, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	 
	// Данные = СтрЗаменить(Данные, """""", "null");
	 
	Возврат Данные;
	 
КонецФункции	

#Область СообщениеДляМАМС

Процедура ЗаполнитьСтруктуруСообщенияМАМС(ОбъектСсылка, Результат)
	
	Реквизиты = "ГУИДЦССУ, Наименование, КраткоеНаименование, ИдентификаторЮПро, УровеньФилиала, Владелец, Родитель, ГУИДФилиалаВЮПро";
	ДанныеКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты);	
	
	Результат.guid					 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ГУИДФилиалаВЮПро);
	Результат.name 				 	 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Наименование);
	Результат.crustedId 			 = ПреобразоватьЗначениеДляJSON(ДанныеКП.ИдентификаторЮПро);
	Результат.level 			 	 = ПреобразоватьЗначениеДляJSON(ДанныеКП.УровеньФилиала);
	Результат.parentFilialGuid 		 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Родитель.ГУИДФилиалаВЮПро);
	Результат.regionGuid 			 = ПреобразоватьЗначениеДляJSON(ДанныеКП.Владелец.ГУИДЦССУ);
	Результат.shortName 			 = ПреобразоватьЗначениеДляJSON(ДанныеКП.КраткоеНаименование);
	
КонецПроцедуры	

Функция ПолучитьСтруктуруСообщения()

	Результат = Новый Структура;
	Результат.Вставить("objectType", "Filial");
	Результат.Вставить("guid");
	Результат.Вставить("name");
	Результат.Вставить("crustedId");
	Результат.Вставить("level");
	Результат.Вставить("parentFilialGuid");
	Результат.Вставить("regionGuid");
	Результат.Вставить("shortName");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьЗначениеДляJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#КонецЕсли