
&НаСервереБезКонтекста
Процедура ОбработатьСообщениеНаСервере(Идентификатор)
	
	ДанныеСообщения = AMS_ОбменДаннымиОбщегоНазначенияСервер.ПолучитьСообщение(Идентификатор);	
	
	ДанныеПользователя = ДанныеСообщения.Данные.value.EmployeeDto;
	ДанныеАвторизации  = ДанныеСообщения.Данные.value.AccessUsersDto;
	
	ДанныеЗаполнения = Справочники.AMS_ПользователиСистем.ИнициализироватьСтруктуруЗаполнения();
	ДанныеЗаполнения.UUID 				= ДанныеПользователя.UUID;
	ДанныеЗаполнения.Наименование 		= ДанныеПользователя.Name;
	ДанныеЗаполнения.НаименованиеПолное = ДанныеПользователя.Name;
	ДанныеЗаполнения.Роль			    = ДанныеПользователя.Position.Name;
	ДанныеЗаполнения.Активен 						= ДанныеПользователя.IsActive;
	ДанныеЗаполнения.ДоступенПросмотрРеестровКВ		= ДанныеПользователя.AllowShowKV;
	ДанныеЗаполнения.ДоступноПодписаниеРеестровКВ	= ДанныеПользователя.AllowSignKV;
	
	Если ДанныеАвторизации.Количество() > 0 Тогда
		
		Авторизация = ДанныеАвторизации[0];
		
		ДанныеЗаполнения.Логин			    		= Авторизация.Login;
		ДанныеЗаполнения.НомерТелефонаПодтвержден 	= Авторизация.IsPhoneConfirmed;
		ДанныеЗаполнения.НомерТелефона				= Авторизация.PhoneNumber;
		ДанныеЗаполнения.АдресЭлектроннойПочты		= Авторизация.Email;
		ДанныеЗаполнения.АутентификацияПоСМС		= Авторизация.IsTwoFactorSmsRequired;
		ДанныеЗаполнения.АутентификацияВПриложении	= Авторизация.IsTwoFactorActivated;
		
	КонецЕсли;	

	Справочники.AMS_ПользователиСистем.СформироватьИзменитьЭлементСправочника(ДанныеЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	ОбработатьСообщениеНаСервере(Запись.Идентификатор);
КонецПроцедуры
