#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура УстановитьСтатус(Заявка, Статус) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗаявокНаИзменениеАДСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СостояниеЗаявокНаИзменениеАД.СрезПоследних КАК СостояниеЗаявокНаИзменениеАДСрезПоследних
		|ГДЕ
		|	СостояниеЗаявокНаИзменениеАДСрезПоследних.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		НовыйСтатус = Справочники.СтатусыЗаявок.Новая;
		
	Иначе	
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если ВыборкаДетальныеЗаписи.Статус = Статус Тогда
			
			Возврат;
			
		КонецЕсли;
		
		НовыйСтатус = Статус;
		
	КонецЕсли;	
	
	Менеджер = РегистрыСведений.СостояниеЗаявокНаИзменениеАД.СоздатьМенеджерЗаписи();
	Менеджер.Период = ТекущаяДатаСеанса();
	Менеджер.Заявка = Заявка;
	Менеджер.Статус = НовыйСтатус;
	Менеджер.Записать(Истина);
	
КонецПроцедуры	

Функция ТекущийСтатус(Заявка) Экспорт
	
	Результат = Справочники.СтатусыЗаявок.Новая;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗаявокНаИзменениеАДСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СостояниеЗаявокНаИзменениеАД.СрезПоследних КАК СостояниеЗаявокНаИзменениеАДСрезПоследних
		|ГДЕ
		|	СостояниеЗаявокНаИзменениеАДСрезПоследних.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Статус;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти 

#КонецЕсли